MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
  Callback name               | Default value                       | Callback registration function
  ----------------------------| ----------------------------------- | ---------------------------
  TxHalfCpltCallback          | HAL_UART_TxHalfCpltCallback()       | HAL_UART_RegisterTxHalfCpltCallback()
  TxCpltCallback              | HAL_UART_TxCpltCallback()           | HAL_UART_RegisterTxCpltCallback()
  RxHalfCpltCallback          | HAL_UART_RxHalfCpltCallback()       | HAL_UART_RegisterRxHalfCpltCallback()
  RxCpltCallback              | HAL_UART_RxCpltCallback()           | HAL_UART_RegisterRxCpltCallback()
  ErrorCallback               | HAL_UART_ErrorCallback()            | HAL_UART_RegisterErrorCallback()
  AbortCpltCallback           | HAL_UART_AbortCpltCallback()        | HAL_UART_RegisterAbortCpltCallback()
  AbortTransmitCpltCallback   | HAL_UART_AbortTransmitCpltCallback()| HAL_UART_RegisterAbortTransmitCpltCallback()
  AbortReceiveCpltCallback    | HAL_UART_AbortReceiveCpltCallback() | HAL_UART_RegisterAbortReceiveCpltCallback()
  WakeupCallback              | HAL_UART_WakeupCallback()           | HAL_UART_RegisterWakeupCallback()
  RxFifoFullCallback          | HAL_UART_RxFifoFullCallback()        | HAL_UART_RegisterRxFifoFullCallback()
  TxFifoEmptyCallback         | HAL_UART_TxFifoEmptyCallback()       | HAL_UART_RegisterTxFifoEmptyCallback()
  LINBreakCallback            | HAL_UART_LINBreakCallback()          | HAL_UART_RegisterLINBreakCallback()
  ClearToSendCallback         | HAL_UART_ClearToSendCallback()       | HAL_UART_RegisterClearToSendCallback()

  To unregister a callback, register the default callback via the registration function.

  By default, after the HAL_UART_Init() and when the state is HAL_UART_STATE_INIT, all callbacks are set to the
  corresponding default weak functions.

  Register callbacks when the handle global_state is HAL_UART_STATE_INIT or HAL_UART_STATE_CONFIGURED.

  When the compilation define USE_HAL_UART_REGISTER_CALLBACKS is set to 0 or not defined, the callback registration
  feature is not available and weak callbacks are used, represented by the default value in the table above.

## 8- Acquire/Release the HAL UART handle
  - When the compilation flag USE_HAL_MUTEX is set to 1, a multi-thread user application can acquire the
    whole UART HAL handle to execute a transmit or a receive process or a sequence of transmit/receive.
    When the given process or sequence ends, release the UART HAL handle.
    - The HAL acquire/release operations are based on the HAL OS abstraction layer (stm32_hal_os.c/.h osal):
      - Use HAL_UART_AcquireBus() to acquire the HAL UART handle.
      - Use HAL_UART_ReleaseBus() to release the HAL UART handle.
  */

/**
  * @}
  */

/** @defgroup UART_Configuration_Table UART Configuration Table
  * @{

## 9- Configuration inside the UART driver:

Software configuration defined in stm32c5xx_hal_conf.h:
Preprocessor flags              |   Default value   | Comment
------------------------------- | ----------------- | ------------------------------------------------
USE_HAL_UART_MODULE             |         1         | Enable HAL UART driver module
USE_HAL_UART_REGISTER_CALLBACKS |         0         | Allows you to define your own callback
USE_HAL_UART_DMA                |         1         | Enable DMA code inside the HAL UART
USE_HAL_CHECK_PARAM             |         0         | Enable runtime parameter checking
USE_HAL_UART_CLK_ENABLE_MODEL   | HAL_CLK_ENABLE_NO | Enable the gating of the peripheral clock
USE_HAL_CHECK_PROCESS_STATE     |         0         | Enable atomicity of process state checking
USE_HAL_MUTEX                   |         0         | Enable semaphore creation for OS
USE_HAL_UART_USER_DATA          |         0         | Add user data inside the HAL UART handle
USE_HAL_UART_GET_LAST_ERRORS    |         0         | Enable retrieval of the last process error codes

Software configuration defined in preprocessor environment:
Preprocessor flags              |   Default value   | Comment
------------------------------- | ----------------- | ------------------------------------------------
USE_ASSERT_DBG_PARAM            |    Not defined    | Enable parameter checking for HAL and LL
USE_ASSERT_DBG_STATE            |    Not defined    | Enable state checking for HAL

  */
/**
  * @}
  */

#if defined(USE_HAL_UART_MODULE) && (USE_HAL_UART_MODULE == 1)

/* Private constants ------------------------------------------------------------*/
/** @defgroup UART_Private_Constants UART Private Constants
  * @{
  */

/*! LPUART BRR minimum authorized value */
#define LPUART_BRR_MIN  0x300U
/*! LPUART BRR maximum authorized value */
#define LPUART_BRR_MAX  0xFFFFFU
/*! UART BRR minimum authorized value */
#define UART_BRR_MIN    0x10U
/*! UART BRR maximum authorized value */
#define UART_BRR_MAX    0xFFFFU

/*! UART mask for 9-bit data length used for RDR reading */
#define UART_RDR_MASK_9BITS                 0x1FFU
/*! UART mask for 8-bit data length used for RDR reading */
#define UART_RDR_MASK_8BITS                 0xFFU
/*! UART mask for 7-bit data length used for RDR reading */
#define UART_RDR_MASK_7BITS                 0x7FU
/*! UART mask for 6-bit data length used for RDR reading */
#define UART_RDR_MASK_6BITS                 0x3FU

/*! Timeout value for UART instance enabling checks */
#define UART_ENABLE_TIMEOUT_MS              100U

/*! UART RX FIFO depth */
#define UART_RX_FIFO_DEPTH 8U

/*! UART TX FIFO depth */
#define UART_TX_FIFO_DEPTH 8U

/**
  * @}
  */

/* Private variables ---------------------------------------------------------*/
/** @addtogroup UART_Private_Variables UART Private variables
  * @{
  */
/*! UART Prescaler Table preset */
#if defined(USE_ASSERT_DBG_PARAM)
const uint16_t UARTPrescTable[16] = {1U, 2U, 4U, 6U, 8U, 10U, 12U, 16U, 32U, 64U, 128U, 256U, 256U, 256U, 256U, 256U};
#endif /* USE_ASSERT_DBG_PARAM */
/**
  * @}
  */

/* Private macros -----------------------------------------------------------*/
/** @defgroup UART_Private_Macros UART Private Macros
  * @{
  */

/** @brief  Check UART Baud rate.
  * @param  baud_rate Baud rate specified by the user.
  *         The maximum Baud Rate is derived from the maximum clock on C5 (i.e. 144 MHz)
  *         divided by the smallest oversampling used on the USART (i.e. 8)
  * @retval SET (baud_rate is valid) or RESET (baud_rate is invalid)
  */
#define IS_UART_BAUD_RATE(baud_rate) ((baud_rate) <= 18000000U && ((baud_rate) != 0U))

/** @brief  Check UART assertion time.
  * @param  time 5-bit value assertion time.
  * @retval SET (time is valid) or RESET (time is invalid)
  */
#define IS_UART_ASSERTION_TIME(time) ((time) <= 0x1FU)

/** @brief  Check UART deassertion time.
  * @param  time 5-bit value deassertion time.
  * @retval SET (time is valid) or RESET (time is invalid)
  */
#define IS_UART_DEASSERTION_TIME(time) ((time) <= 0x1FU)

/** @brief  Check UART Receiver Timeout value.
  * @param  timeoutvalue Timeout value.
  * @retval SET (timeoutvalue is valid) or RESET (timeoutvalue is invalid)
  */
#define IS_UART_RECEIVER_TIMEOUT_VALUE(timeoutvalue) ((timeoutvalue) <= 0xFFFFFFU)

/**
  * @brief Ensure that the number of transferred data is valid.
  * @param datasize UART TX data size.
  * @retval SET (datasize is valid) or RESET (datasize is invalid)
  */
#define IS_UART_TX_DATA_SIZE(datasize) ((datasize) <= 0xFFFFU)

/**
  * @brief Ensure that UART frame length is valid.
  * @param length UART frame length.
  * @retval SET (length is valid) or RESET (length is invalid)
  */
#define IS_UART_WORD_LENGTH(length) (((length) == HAL_UART_WORD_LENGTH_7_BIT)     \
                                     || ((length) == HAL_UART_WORD_LENGTH_8_BIT)  \
                                     || ((length) == HAL_UART_WORD_LENGTH_9_BIT))

/**
  * @brief Ensure that UART frame number of stop bits is valid.
  * @param stopbits UART frame number of stop bits.
  * @retval SET (stopbits is valid) or RESET (stopbits is invalid)
  */
#define IS_UART_STOP_BITS(stopbits) (((stopbits) == HAL_UART_STOP_BIT_0_5)    \
                                     || ((stopbits) == HAL_UART_STOP_BIT_1)   \
                                     || ((stopbits) == HAL_UART_STOP_BIT_1_5) \
                                     || ((stopbits) == HAL_UART_STOP_BIT_2))

/**
  * @brief Ensure that LPUART frame number of stop bits is valid.
  * @param stopbits LPUART frame number of stop bits.
  * @retval SET (stopbits is valid) or RESET (stopbits is invalid)
  */
#define IS_LPUART_STOP_BITS(stopbits) (((stopbits) == HAL_UART_STOP_BIT_1)     \
                                       || ((stopbits) == HAL_UART_STOP_BIT_2))

/**
  * @brief Ensure that UART frame parity is valid.
  * @param parity UART frame parity.
  * @retval SET (parity is valid) or RESET (parity is invalid)
  */
#define IS_UART_PARITY(parity) (((parity) == HAL_UART_PARITY_NONE)     \
                                || ((parity) == HAL_UART_PARITY_EVEN)  \
                                || ((parity) == HAL_UART_PARITY_ODD))

/**
  * @brief Ensure that UART hardware flow control is valid.
  * @param flowcontrol UART hardware flow control.
  * @retval SET (flowcontrol is valid) or RESET (flowcontrol is invalid)
  */
#define IS_UART_HARDWARE_FLOW_CONTROL(flowcontrol) (((flowcontrol) == HAL_UART_HW_CONTROL_NONE)        \
                                                    || ((flowcontrol) == HAL_UART_HW_CONTROL_RTS)      \
                                                    || ((flowcontrol) == HAL_UART_HW_CONTROL_CTS)      \
                                                    || ((flowcontrol) == HAL_UART_HW_CONTROL_RTS_CTS))

/**
  * @brief Ensure that UART direction is valid.
  * @param direction UART direction.
  * @retval SET (direction is valid) or RESET (direction is invalid)
  */
#define IS_UART_DIRECTION(direction) (((direction) == HAL_UART_DIRECTION_RX)        \
                                      || ((direction) == HAL_UART_DIRECTION_TX)     \
                                      || ((direction) == HAL_UART_DIRECTION_TX_RX))

/**
  * @brief Ensure that UART oversampling is valid.
  * @param sampling UART oversampling.
  * @retval SET (sampling is valid) or RESET (sampling is invalid)
  */
#define IS_UART_OVERSAMPLING(sampling) (((sampling) == HAL_UART_OVERSAMPLING_16)    \
                                        || ((sampling) == HAL_UART_OVERSAMPLING_8))

/**
  * @brief Ensure that LPUART oversampling is valid.
  * @param sampling LPUART oversampling.
  * @retval SET (sampling is valid) or RESET (sampling is invalid)
  */
#define IS_LPUART_OVERSAMPLING(sampling) ((sampling) == HAL_UART_OVERSAMPLING_16)

/**
  * @brief Ensure that UART frame sampling is valid.
  * @param onebit UART frame sampling.
  * @retval SET (onebit is valid) or RESET (onebit is invalid)
  */
#define IS_UART_ONE_BIT_SAMPLE(onebit) (((onebit) == HAL_UART_ONE_BIT_SAMPLE_DISABLE)    \
                                        || ((onebit) == HAL_UART_ONE_BIT_SAMPLE_ENABLE))

/**
  * @brief Ensure that UART Prescaler is valid.
  * @param clockprescaler UART Prescaler value.
  * @retval SET (clockprescaler is valid) or RESET (clockprescaler is invalid)
  */
#define IS_UART_PRESCALER(clockprescaler) (((clockprescaler) == HAL_UART_PRESCALER_DIV1)       \
                                           || ((clockprescaler) == HAL_UART_PRESCALER_DIV2)    \
                                           || ((clockprescaler) == HAL_UART_PRESCALER_DIV4)    \
                                           || ((clockprescaler) == HAL_UART_PRESCALER_DIV6)    \
                                           || ((clockprescaler) == HAL_UART_PRESCALER_DIV8)    \
                                           || ((clockprescaler) == HAL_UART_PRESCALER_DIV10)   \
                                           || ((clockprescaler) == HAL_UART_PRESCALER_DIV12)   \
                                           || ((clockprescaler) == HAL_UART_PRESCALER_DIV16)   \
                                           || ((clockprescaler) == HAL_UART_PRESCALER_DIV32)   \
                                           || ((clockprescaler) == HAL_UART_PRESCALER_DIV64)   \
                                           || ((clockprescaler) == HAL_UART_PRESCALER_DIV128)  \
                                           || ((clockprescaler) == HAL_UART_PRESCALER_DIV256))

/**
  * @brief Ensure that the UART wakeup method is valid.
  * @param wakeup UART wakeup method.
  * @retval SET (wakeup is valid) or RESET (wakeup is invalid)
  */
#define IS_UART_WAKEUP_METHOD(wakeup) (((wakeup) == HAL_UART_WAKEUP_METHOD_IDLE_LINE)        \
                                       || ((wakeup) == HAL_UART_WAKEUP_METHOD_ADDRESS_MARK))

/**
  * @brief Ensure that IRDA power mode is valid.
  * @param power_mode IRDA power mode.
  * @retval SET (power_mode is valid) or RESET (power_mode is invalid)
  */
#define IS_UART_IRDA_POWER_MODE(power_mode) (((power_mode) == HAL_UART_IRDA_POWER_MODE_NORMAL)  \
                                             || ((power_mode) == HAL_UART_IRDA_POWER_MODE_LOW))

/**
  * @brief Ensure that IRDA prescaler is valid.
  * @param prescaler IRDA Prescaler.
  * @retval SET (prescaler is valid) or RESET (prescaler is invalid)
  */
#define IS_UART_IRDA_PRESCALER(prescaler) (((prescaler) <= 0xFFU) && (prescaler != 0U))

/**
  * @brief Ensure that UART LIN break detection length is valid.
  * @param length UART LIN break detection length.
  * @retval SET (length is valid) or RESET (length is invalid)
  */
#define IS_UART_LIN_BREAK_DETECT_LENGTH(length) (((length) == HAL_UART_LIN_BREAK_DETECT_10_BIT)     \
                                                 || ((length) == HAL_UART_LIN_BREAK_DETECT_11_BIT))

/**
  * @brief Ensure that UART driver enable polarity is valid.
  * @param polarity UART driver enable polarity.
  * @retval SET (polarity is valid) or RESET (polarity is invalid)
  */
#define IS_UART_DE_POLARITY(polarity)    (((polarity) == HAL_UART_DE_POLARITY_HIGH)    \
                                          || ((polarity) == HAL_UART_DE_POLARITY_LOW))

/**
  * @brief Ensure that UART request parameter is valid.
  * @param request UART request parameter.
  * @retval SET (request is valid) or RESET (request is invalid)
  */
#define IS_UART_REQUEST_PARAMETER(request) (((request) == HAL_UART_REQUEST_AUTO_BAUD_RATE)     \
                                            || ((request) == HAL_UART_REQUEST_SEND_BREAK)      \
                                            || ((request) == HAL_UART_REQUEST_MUTE_MODE)       \
                                            || ((request) == HAL_UART_REQUEST_RX_DATA_FLUSH)   \
                                            || ((request) == HAL_UART_REQUEST_TX_DATA_FLUSH))

/**
  * @brief Ensure that UART wake-up selection is valid.
  * @param wakesel UART wake-up selection.
  * @retval SET (wakesel is valid) or RESET (wakesel is invalid)
  */
#define IS_UART_WAKEUP_SELECTION(wakesel) (((wakesel) == HAL_UART_WAKEUP_ON_ADDRESS)               \
                                           || ((wakesel) == HAL_UART_WAKEUP_ON_STARTBIT)           \
                                           || ((wakesel) == HAL_UART_WAKEUP_ON_READDATA_NONEMPTY))

/**
  * @brief Ensure that UART wake-up address length is valid.
  * @param address UART wake-up address length.
  * @retval SET (address is valid) or RESET (address is invalid)
  */
#define IS_UART_ADDRESS_LENGTH_DETECT(address) (((address) == HAL_UART_ADDRESS_DETECT_4_BIT)     \
                                                || ((address) == HAL_UART_ADDRESS_DETECT_7_BIT))

/**
  * @brief Ensure that UART FIFO threshold level is valid.
  * @param threshold UART FIFO threshold level.
  * @retval SET (threshold is valid) or RESET (threshold is invalid)
  */
#define IS_UART_FIFO_THRESHOLD(threshold) (((threshold) == HAL_UART_FIFO_THRESHOLD_1_8)     \
                                           || ((threshold) == HAL_UART_FIFO_THRESHOLD_1_4)  \
                                           || ((threshold) == HAL_UART_FIFO_THRESHOLD_1_2)  \
                                           || ((threshold) == HAL_UART_FIFO_THRESHOLD_3_4)  \
                                           || ((threshold) == HAL_UART_FIFO_THRESHOLD_7_8)  \
                                           || ((threshold) == HAL_UART_FIFO_THRESHOLD_8_8))

/**
  * @brief Ensure that UART Auto Baud Rate Mode is valid.
  * @param mode UART Auto Baud Rate Mode.
  * @retval SET (mode is valid) or RESET (mode is invalid)
  */
#define IS_UART_AUTO_BAUD_RATE_MODE(mode)  (((mode) == HAL_UART_AUTO_BAUD_DET_ON_START_BIT)       \
                                            || ((mode) == HAL_UART_AUTO_BAUD_DET_ON_FALLING_EDGE) \
                                            || ((mode) == HAL_UART_AUTO_BAUD_DET_ON_0X7F_FRAME)   \
                                            || ((mode) == HAL_UART_AUTO_BAUD_DET_ON_0X55_FRAME))

/**
  * @brief Ensure that UART Optional Interrupts for IT in Transmit is valid.
  * @param interrupt UART Optional Interrupts.
  * @retval SET (interrupt is valid) or RESET (interrupt is invalid)
  */

#define IS_UART_OPT_TX_IT(interrupt)  (((interrupt) == HAL_UART_OPT_TX_IT_NONE)             \
                                       || ((interrupt) == HAL_UART_OPT_TX_IT_FIFO_EMPTY)    \
                                       || ((interrupt) == HAL_UART_OPT_TX_IT_CLEAR_TO_SEND) \
                                       || ((interrupt) == HAL_UART_OPT_TX_IT_DEFAULT))

/**
  * @brief Ensure that UART Optional Interrupts for IT in Receive is valid.
  * @param interrupt UART Optional Interrupts.
  * @retval SET (interrupt is valid) or RESET (interrupt is invalid)
  */

#define IS_UART_OPT_RX_IT(interrupt)    (((interrupt) == HAL_UART_OPT_RX_IT_NONE)         \
                                         || ((interrupt) == HAL_UART_OPT_RX_IT_FIFO_FULL) \
                                         || ((interrupt) == HAL_UART_OPT_RX_IT_LIN_BREAK) \
                                         || ((interrupt) == HAL_UART_OPT_RX_IT_DEFAULT))

#if defined(USE_HAL_UART_DMA) && (USE_HAL_UART_DMA == 1)
/**
  * @brief Ensure that UART Optional Interrupts for DMA in Transmit is valid.
  * @param interrupt UART Optional Interrupts.
  * @retval SET (interrupt is valid) or RESET (interrupt is invalid)
  */
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
#define IS_UART_OPT_TX_DMA(interrupt)  (((interrupt) == HAL_UART_OPT_DMA_TX_IT_NONE)        \
                                        || ((interrupt) == HAL_UART_OPT_DMA_TX_IT_HT)       \
                                        || ((interrupt) == HAL_UART_OPT_DMA_TX_IT_SILENT)   \
                                        || ((interrupt) == HAL_UART_OPT_DMA_TX_IT_DEFAULT))

#define IS_UART_DMA_TX_VALID_SILENT_MODE(handle_dma, interrupt)                \
  (((interrupt) == HAL_UART_OPT_DMA_TX_IT_SILENT)                              \
   && (handle_dma->xfer_mode != HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR) ? 0U : 1U)

#else
#define IS_UART_OPT_TX_DMA(interrupt)  (((interrupt) == HAL_UART_OPT_DMA_TX_IT_NONE)        \
                                        || ((interrupt) == HAL_UART_OPT_DMA_TX_IT_HT)       \
                                        || ((interrupt) == HAL_UART_OPT_DMA_TX_IT_DEFAULT))

#endif /* USE_HAL_DMA_LINKEDLIST */

/**
  * @brief Ensure that UART Optional Interrupts for DMA in Receive is valid.
  * @param interrupt UART Optional Interrupts.
  * @retval SET (interrupt is valid) or RESET (interrupt is invalid)
  */
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
#define IS_UART_OPT_RX_DMA(interrupt)    (((interrupt) == HAL_UART_OPT_DMA_RX_IT_NONE)        \
                                          || ((interrupt) == HAL_UART_OPT_DMA_RX_IT_HT)       \
                                          || ((interrupt) == HAL_UART_OPT_DMA_RX_IT_SILENT)   \
                                          || ((interrupt) == HAL_UART_OPT_DMA_RX_IT_DEFAULT))

