MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
#define IS_UART_DMA_RX_VALID_SILENT_MODE(handle_dma ,interrupts)                  \
  (((interrupts) == HAL_UART_OPT_DMA_RX_IT_SILENT)                                \
   && (handle_dma->xfer_mode != HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR) ? 0U : 1U)

#else
#define IS_UART_OPT_RX_DMA(interrupt)    (((interrupt) == HAL_UART_OPT_DMA_RX_IT_NONE)        \
                                          || ((interrupt) == HAL_UART_OPT_DMA_RX_IT_HT)       \
                                          || ((interrupt) == HAL_UART_OPT_DMA_RX_IT_DEFAULT))

#endif /* USE_HAL_DMA_LINKEDLIST */
#endif /* USE_HAL_UART_DMA */

/**
  * @brief Check whether the UART instance is enabled. If it is, disable it.
  * @param handle specifies the UART handle.
  */
#define UART_ENSURE_INSTANCE_DISABLED(handle)                \
  uint32_t instance_enabled;                                 \
  do                                                         \
  {                                                          \
    instance_enabled = LL_USART_IsEnabled(handle);           \
    if (instance_enabled != 0U)                              \
    {                                                        \
      LL_USART_Disable(handle);                              \
    }                                                        \
  } while(0U)

/**
  * @brief Check whether the UART instance needs to be re-enabled.
  * @param handle specifies the UART handle.
  */
#define UART_ENSURE_INSTANCE_ENABLED(handle)                 \
  do                                                         \
  {                                                          \
    if (instance_enabled != 0U)                              \
    {                                                        \
      LL_USART_Enable(handle);                               \
    }                                                        \
  } while(0U)

/**
  * @brief Retrieve the UART instance from the handle.
  * @param handle specifies the USART handle.
  */
#define UART_GET_INSTANCE(handle)   ((USART_TypeDef *)((uint32_t)(handle)->instance))

/**
  * @}
  */

/* Private functions --------------------------------------------------------*/
/** @defgroup UART_Private_Functions UART Private Functions
  * @{
  */
#if defined(USE_HAL_UART_CLK_ENABLE_MODEL) && (USE_HAL_UART_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
/** @brief  Set the UART clock frequency.
  * @param  huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  */
__STATIC_INLINE void UART_SetClockFrequency(const hal_uart_handle_t *huart)
{
  /*! Instance USART1 */
  if (huart->instance == HAL_UART1)
  {
    HAL_RCC_USART1_EnableClock();
  }
  /*! Instance USART2 */
  if (huart->instance == HAL_UART2)
  {
    HAL_RCC_USART2_EnableClock();
  }
#if defined(USART3)
  /*! Instance USART3 */
  if (huart->instance == HAL_UART3)
  {
    HAL_RCC_USART3_EnableClock();
  }
#endif /* USART3 */
  /*! Instance UART4 */
  if (huart->instance == HAL_UART4)
  {
    HAL_RCC_UART4_EnableClock();
  }
  /*! Instance UART5 */
  if (huart->instance == HAL_UART5)
  {
    HAL_RCC_UART5_EnableClock();
  }
#if defined(USART6)
  /*! Instance USART6 */
  if (huart->instance == HAL_UART6)
  {
    HAL_RCC_USART6_EnableClock();
  }
#endif /* USART6 */
#if defined(UART7)
  /*! Instance UART7 */
  if (huart->instance == HAL_UART7)
  {
    HAL_RCC_UART7_EnableClock();
  }
#endif /* UART7 */
  /*! Instance LPUART1 */
  if (huart->instance == HAL_LPUART1)
  {
    HAL_RCC_LPUART1_EnableClock();
  }
}
#endif /* USE_HAL_UART_CLK_ENABLE_MODEL */

/** @brief  Report the UART mask to apply to retrieve the received data
  *         according to the word length and parity bit activation.
  * @param  huart specifies the UART Handle.
  * @note   If PCE bit from the CR1 register = 1, the parity bit is not included in the data extracted
  *         by the reception API().
  *         This masking operation is not carried out in the case of
  *         DMA transfers.
  * @retval HAL_OK UART RDR mask has been correctly calculated.
  * @retval HAL_ERROR UART RDR mask cannot be calculated because of a mismatch
  *         between parity and word length.
  */
__STATIC_INLINE hal_status_t UART_RDRMaskComputation(hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx = UART_GET_INSTANCE(huart);
  uint32_t data_width = LL_USART_GetDataWidth(p_uartx);
  uint32_t parity = LL_USART_GetParity(p_uartx);

  if (data_width == LL_USART_DATAWIDTH_9_BIT)
  {
    if (parity == LL_USART_PARITY_NONE)
    {
      huart->rdr_mask = UART_RDR_MASK_9BITS;
    }
    else
    {
      huart->rdr_mask = UART_RDR_MASK_8BITS;
    }
  }
  else if (data_width == LL_USART_DATAWIDTH_8_BIT)
  {
    if (parity == LL_USART_PARITY_NONE)
    {
      huart->rdr_mask = UART_RDR_MASK_8BITS;
    }
    else
    {
      huart->rdr_mask = UART_RDR_MASK_7BITS;
    }
  }
  else if (data_width == LL_USART_DATAWIDTH_7_BIT)
  {
    if (parity == LL_USART_PARITY_NONE)
    {
      huart->rdr_mask = UART_RDR_MASK_7BITS;
    }
    else
    {
      huart->rdr_mask = UART_RDR_MASK_6BITS;
    }
  }
  else
  {
    return HAL_ERROR;
  }
  return HAL_OK;
}

#if defined (USE_HAL_UART_DMA) && (USE_HAL_UART_DMA == 1)
static void UART_EndTxTransfer(hal_uart_handle_t *huart);
#endif /* USE_HAL_UART_DMA */
static void UART_EndRxTransfer(hal_uart_handle_t *huart);
#if defined (USE_HAL_UART_DMA) && (USE_HAL_UART_DMA == 1)
static void UART_DMAAbortOnError(hal_dma_handle_t *hdma);
static void UART_DMATransmitCplt(hal_dma_handle_t *hdma);
static void UART_DMAReceiveCplt(hal_dma_handle_t *hdma);
static void UART_DMARxHalfCplt(hal_dma_handle_t *hdma);
static void UART_DMATxHalfCplt(hal_dma_handle_t *hdma);
static void UART_DMAError(hal_dma_handle_t *hdma);

static void UART_DMATxAbortCallback(hal_dma_handle_t *hdma);
static void UART_DMARxAbortCallback(hal_dma_handle_t *hdma);
static void UART_DMATxOnlyAbortCallback(hal_dma_handle_t *hdma);
static void UART_DMARxOnlyAbortCallback(hal_dma_handle_t *hdma);
static void UART_DMAAbortOnSuccessCallback(hal_dma_handle_t *hdma);
static hal_status_t UART_Start_Receive_DMA(hal_uart_handle_t *huart, uint8_t *p_data, uint32_t size,
                                           hal_uart_rx_modes_t rx_mode, uint32_t interrupts);
static hal_status_t UART_Start_Transmit_DMA(hal_uart_handle_t *huart, const uint8_t *p_data, uint32_t size,
                                            uint32_t interrupts);
#endif /* USE_HAL_UART_DMA */
static void UART_TxISR_8BIT_FIFOEN(hal_uart_handle_t *huart);
static void UART_TxISR_16BIT_FIFOEN(hal_uart_handle_t *huart);
static void UART_SetNbDataToProcess(hal_uart_handle_t *huart);
static void UART_TxISR_8BIT(hal_uart_handle_t *huart);
static void UART_TxISR_16BIT(hal_uart_handle_t *huart);
static void UART_EndTransmit_IT(hal_uart_handle_t *huart);
static void UART_RxISR_8BIT(hal_uart_handle_t *huart);
static void UART_RxISR_16BIT(hal_uart_handle_t *huart);
static void UART_RxISR_8BIT_FIFOEN(hal_uart_handle_t *huart);
static void UART_RxISR_16BIT_FIFOEN(hal_uart_handle_t *huart);
static hal_status_t UART_Abort(hal_uart_handle_t *huart);
static hal_status_t UART_CheckEnabledState(hal_uart_handle_t *huart);

