MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
static hal_status_t UART_Start_Receive_IT(hal_uart_handle_t *huart, uint8_t *p_data, uint32_t size,
                                          hal_uart_rx_modes_t rx_mode, uint32_t interrupts);
static hal_status_t UART_Start_Transmit_IT(hal_uart_handle_t *huart, const uint8_t *p_data, uint32_t size,
                                           uint32_t interrupts);
static hal_status_t UART_Start_Receive_Polling(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte,
                                               uint32_t *p_rx_size_byte, uint32_t timeout_ms,
                                               hal_uart_rx_modes_t rx_mode);
static hal_status_t UART_WaitOnFlagUntilTimeout(hal_uart_handle_t *huart, uint32_t flag, uint32_t status,
                                                uint32_t tick_start, uint32_t timeout_ms);
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
static void UART_InitCallbacksToDefault(hal_uart_handle_t *huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
#if defined(USE_ASSERT_DBG_PARAM)
hal_status_t UART_Check_lpuart_baudrate_validity(uint32_t instance_clock_freq, uint32_t baud_rate,
                                                 uint32_t instance_clock_prescaler);
hal_status_t UART_Check_uart_baudrate_validity(uint32_t instance_clock_freq, uint32_t baud_rate,
                                               uint32_t instance_clock_prescaler,
                                               hal_uart_oversampling_t oversampling);
#endif /* USE_ASSERT_DBG_PARAM */
void UART_Parity_Computation(hal_uart_handle_t *huart, uint8_t *p_character);

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/

/** @addtogroup UART_Exported_Functions
  * @{
  */

/** @addtogroup UART_Exported_Functions_Group1
  * @{
This subsection provides a set of functions to initialize and deinitialize the USARTx in
asynchronous mode.
  - Call the function HAL_UART_Init() to initialize the selected USARTx handle and associate an instance.
  - Call the function HAL_UART_DeInit() to deinitialize the given HAL UART instance by stopping any ongoing process
  and resetting the state machine.
  */

/**
  * @brief Initialize the UART handler for the associated instance.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which will contain the UART instance.
  * @param instance USARTx instance.
  * @retval HAL_OK UART instance has been correctly initialized
  * @retval HAL_INVALID_PARAM UART instance is NULL
  * @retval HAL_ERROR UART semaphore creation is failed (USE_HAL_MUTEX is set to 1)
  */
hal_status_t HAL_UART_Init(hal_uart_handle_t *huart, hal_uart_t instance)
{
  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(((IS_UART_INSTANCE((USART_TypeDef *)((uint32_t)instance))))
                   || (IS_LPUART_INSTANCE((USART_TypeDef *)((uint32_t)instance))));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (huart == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  huart->rx_state = HAL_UART_RX_STATE_RESET;
  huart->tx_state = HAL_UART_TX_STATE_RESET;
  huart->reception_type = HAL_UART_RX_STANDARD;

  huart->instance = instance;

#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
  UART_InitCallbacksToDefault(huart);
#endif /* (USE_HAL_UART_REGISTER_CALLBACKS) */

  huart->nb_tx_data_to_process = 1;
  huart->nb_rx_data_to_process = 1;
  huart->fifo_mode = HAL_UART_FIFO_MODE_DISABLED;

#if defined (USE_HAL_UART_DMA) && (USE_HAL_UART_DMA == 1)
  huart->hdma_tx = NULL;
  huart->hdma_rx = NULL;
#endif /* USE_HAL_UART_DMA */

#if defined (USE_HAL_UART_USER_DATA) && (USE_HAL_UART_USER_DATA == 1)
  huart->p_user_data = NULL;
#endif /* USE_HAL_UART_USER_DATA */

#if defined (USE_HAL_UART_GET_LAST_ERRORS) && (USE_HAL_UART_GET_LAST_ERRORS == 1)
  huart->last_reception_error_codes = 0;
  huart->last_transmission_error_codes = 0;
#endif /* USE_HAL_UART_GET_LAST_ERRORS */

#if defined(USE_HAL_UART_CLK_ENABLE_MODEL) && (USE_HAL_UART_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
  UART_SetClockFrequency(huart);
#endif /* USE_HAL_UART_CLK_ENABLE_MODEL */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  if (HAL_OS_SemaphoreCreate(&huart->semaphore) != HAL_OS_OK)
  {
    return HAL_ERROR;
  }
#endif /* USE_HAL_MUTEX */

  huart->global_state = HAL_UART_STATE_INIT;

  return HAL_OK;
}

/**
  * @brief Deinitializes the UART handler, reset the flags, states and counters.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  */
void HAL_UART_DeInit(hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;
  hal_uart_rx_state_t temp_rx_state;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM((IS_UART_INSTANCE(p_uartx))
                   || (IS_LPUART_INSTANCE(p_uartx)));

  temp_rx_state = huart->rx_state;
  /* Check if any transfer ongoing */
  if ((huart->tx_state == HAL_UART_TX_STATE_ACTIVE) || (temp_rx_state == HAL_UART_RX_STATE_ACTIVE))
  {
    /* Stop current process/operation(s) */
#if defined (USE_HAL_UART_DMA) && (USE_HAL_UART_DMA == 1)
    if (LL_USART_IsEnabledDMAReq_TX(p_uartx) != 0U)
    {
      LL_USART_DisableDMAReq_TX(p_uartx);
      /* Abort the UART DMA Tx channel : use blocking DMA Abort API (no callback) */
      if (huart->hdma_tx != NULL)
      {
        (void)HAL_DMA_Abort(huart->hdma_tx);
      }
    }
    if (LL_USART_IsEnabledDMAReq_RX(p_uartx) != 0U)
    {
      LL_USART_DisableDMAReq_RX(p_uartx);
      /* Abort the UART DMA Rx channel : use blocking DMA Abort API (no callback) */
      if (huart->hdma_rx != NULL)
      {
        (void)HAL_DMA_Abort(huart->hdma_rx);
      }
    }
#endif /* USE_HAL_UART_DMA */
    (void)UART_Abort(huart);
  }

  LL_USART_Disable(p_uartx);

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  (void)HAL_OS_SemaphoreDelete(&huart->semaphore);
#endif /* USE_HAL_MUTEX */

  huart->reception_type = HAL_UART_RX_STANDARD;
  huart->rx_state = HAL_UART_RX_STATE_RESET;
  huart->tx_state = HAL_UART_TX_STATE_RESET;
  huart->global_state = HAL_UART_STATE_RESET;
}
/**
  * @}
  */

/** @addtogroup UART_Exported_Functions_Group2
  * @{
This subsection provides a set of functions to configure the USARTx in asynchronous mode.
  - Call HAL_UART_SetConfig() to configure the initialized instance with a set of parameters containing:
    - Baud Rate
    - Prescaler
    - Word Length
    - Stop Bits
    - Parity: If the parity is enabled, then the MSB bit of the data written in the data register is transmitted but
    is changed by the parity bit.
    - Hardware flow control
    - Direction (Receiver/Transmitter)
    - Oversampling method
    - One-bit sampling method
  - Call HAL_UART_GetConfig() to retrieve the current configuration (optional).
  - If needed, after calling HAL_UART_SetConfig(), modify the configuration by using the unitary
  configuration functions:
    - HAL_UART_SetBaudRate()
    - HAL_UART_SetStopBits()
    - HAL_UART_SetWordLength()
    - HAL_UART_SetParity()
    - HAL_UART_SetHwFlowCtl()
    - HAL_UART_SetXferDirection()
    - HAL_UART_SetOneBitSample()

