MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
  @note
    - __Prescaler__: cannot be modified with a unitary configuration function as it impacts other parameters. Call
    HAL_UART_SetConfig() to modify it.
    - __Over Sampling__: cannot be modified with a unitary configuration function as it impacts other parameters. Call
    HAL_UART_SetConfig() to modify it.

  - If needed, retrieve the different parameters by calling:
    - HAL_UART_GetBaudRate()
    - HAL_UART_GetStopBits()
    - HAL_UART_GetWordLength()
    - HAL_UART_GetParity()
    - HAL_UART_GetHwFlowCtl()
    - HAL_UART_GetXferDirection()
    - HAL_UART_GetOneBitSample()

  @note
    - __Prescaler__: As there is no unitary configuration function for this parameter, there is no unitary
    getter.
    - __Over Sampling__: As there is no unitary configuration function for this parameter, there is no unitary
    getter.

  - Possible frame format:
    Depending on the frame length defined by the M1 and M0 bits from the CR1 register (7-bit, 8-bit or 9-bit),
    the possible UART formats are listed in the following table.

~~~
  UART frame format.
    +-----------------------------------------------------------------------+
    |  M1 bit |  M0 bit |  PCE bit  |             UART frame                |
    |---------|---------|-----------|---------------------------------------|
    |    0    |    0    |    0      |    | SB |    8 bit data   | STB |     |
    |---------|---------|-----------|---------------------------------------|
    |    0    |    0    |    1      |    | SB | 7 bit data | PB | STB |     |
    |---------|---------|-----------|---------------------------------------|
    |    0    |    1    |    0      |    | SB |    9 bit data   | STB |     |
    |---------|---------|-----------|---------------------------------------|
    |    0    |    1    |    1      |    | SB | 8 bit data | PB | STB |     |
    |---------|---------|-----------|---------------------------------------|
    |    1    |    0    |    0      |    | SB |    7 bit data   | STB |     |
    |---------|---------|-----------|---------------------------------------|
    |    1    |    0    |    1      |    | SB | 6 bit data | PB | STB |     |
    +-----------------------------------------------------------------------+
~~~
  */

/**
  * @brief Set the basic configuration to enable the use of the UART instance.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param p_config Pointer to a hal_uart_config_t structure containing the UART configuration.
  * @retval HAL_OK UART instance has been correctly configured.
  * @retval HAL_INVALID_PARAM p_config is NULL.
  * @retval HAL_ERROR Kernel clock is not set.
  */
hal_status_t HAL_UART_SetConfig(hal_uart_handle_t *huart, const hal_uart_config_t *p_config)
{
  USART_TypeDef *p_uartx;
  uint32_t instance_clock_freq;
  uint32_t reg_temp;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(p_config != NULL);
#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
#if defined(USE_ASSERT_DBG_PARAM)
  ASSERT_DBG_PARAM(IS_UART_PRESCALER(p_config->clock_prescaler));
  ASSERT_DBG_PARAM(IS_UART_WORD_LENGTH(p_config->word_length));
  if (IS_LPUART_INSTANCE(p_uartx))
  {
    ASSERT_DBG_PARAM(IS_LPUART_STOP_BITS(p_config->stop_bits));
  }
  if (IS_UART_INSTANCE(p_uartx))
  {
    ASSERT_DBG_PARAM(IS_UART_STOP_BITS(p_config->stop_bits));
  }

  ASSERT_DBG_PARAM(IS_UART_PARITY(p_config->parity));
  ASSERT_DBG_PARAM(IS_UART_BAUD_RATE(p_config->baud_rate));
  ASSERT_DBG_PARAM(IS_UART_DIRECTION(p_config->direction));
  ASSERT_DBG_PARAM(IS_UART_HARDWARE_FLOW_CONTROL(p_config->hw_flow_ctl));
  ASSERT_DBG_PARAM(IS_UART_ONE_BIT_SAMPLE(p_config->one_bit_sampling));
  if (!IS_LPUART_INSTANCE(p_uartx))
  {
    ASSERT_DBG_PARAM(IS_UART_OVERSAMPLING(p_config->oversampling));
  }
#endif /* USE_ASSERT_DBG_PARAM */

  ASSERT_DBG_STATE(huart->global_state, (uint32_t)(HAL_UART_STATE_INIT | HAL_UART_STATE_CONFIGURED));
  ASSERT_DBG_STATE(huart->rx_state, (uint32_t)(HAL_UART_RX_STATE_RESET | HAL_UART_RX_STATE_IDLE));
  ASSERT_DBG_STATE(huart->tx_state, (uint32_t)(HAL_UART_TX_STATE_RESET | HAL_UART_TX_STATE_IDLE));

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_ConfigAsyncMode(p_uartx);

  if (IS_LPUART_INSTANCE(p_uartx))
  {
    reg_temp = ((uint32_t)p_config->word_length | (uint32_t)p_config->parity | (uint32_t)p_config->direction);

    LL_LPUART_ConfigXfer(p_uartx, reg_temp, (uint32_t)p_config->stop_bits);
  }
  else
  {
    reg_temp = ((uint32_t)p_config->word_length | (uint32_t)p_config->parity
                | (uint32_t)p_config->direction | (uint32_t)p_config->oversampling);

    LL_USART_ConfigXfer(p_uartx, reg_temp, (uint32_t)p_config->stop_bits);
  }
  LL_USART_SetHWFlowCtrl(p_uartx, (uint32_t)p_config->hw_flow_ctl);
  if (p_config->one_bit_sampling != HAL_UART_ONE_BIT_SAMPLE_DISABLE)
  {
    LL_USART_EnableOneBitSample(p_uartx);
  }
  else
  {
    LL_USART_DisableOneBitSample(p_uartx);
  }

  LL_USART_SetPrescaler(p_uartx, (uint32_t)p_config->clock_prescaler);

  instance_clock_freq = HAL_RCC_UART_GetKernelClkFreq(p_uartx);
  if (instance_clock_freq != 0U)
  {
    if (IS_LPUART_INSTANCE(p_uartx))
    {
      ASSERT_DBG_PARAM(UART_Check_lpuart_baudrate_validity(instance_clock_freq, p_config->clock_prescaler,
                                                           p_config->baud_rate) == HAL_OK);
      LL_LPUART_SetBaudRate(p_uartx, instance_clock_freq, (uint32_t)p_config->clock_prescaler, p_config->baud_rate);
    }
    else
    {
      ASSERT_DBG_PARAM(UART_Check_uart_baudrate_validity(instance_clock_freq, p_config->clock_prescaler,
                                                         p_config->baud_rate, p_config->oversampling) == HAL_OK);
      LL_USART_SetBaudRate(p_uartx, instance_clock_freq, (uint32_t)p_config->clock_prescaler,
                           (uint32_t)p_config->oversampling, p_config->baud_rate);
    }
  }
  else
  {
    /* Kernel clock not set */
    return HAL_ERROR;
  }

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  huart->rx_state = HAL_UART_RX_STATE_IDLE;
  huart->tx_state = HAL_UART_TX_STATE_IDLE;
  huart->global_state = HAL_UART_STATE_CONFIGURED;

  return HAL_OK;
}

/**
  * @brief Get the current basic configuration set in the current UART instance.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param p_config Pointer to a hal_uart_config_t structure to store the UART configuration.
  */
void HAL_UART_GetConfig(const hal_uart_handle_t *huart, hal_uart_config_t *p_config)
{
  USART_TypeDef *p_uartx;
  uint32_t reg_temp;
  uint32_t instance_clock_freq;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM((p_config != NULL));

