MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  reg_temp = LL_USART_READ_REG(p_uartx, CR1);
  p_config->word_length = (hal_uart_word_length_t)(uint32_t)
                          (reg_temp & (LL_USART_DATAWIDTH_7_BIT | LL_USART_DATAWIDTH_9_BIT));
  p_config->parity = (hal_uart_parity_t)(uint32_t)(reg_temp & (LL_USART_PARITY_ODD));
  p_config->direction = (hal_uart_direction_t)(uint32_t)(reg_temp & (LL_USART_DIRECTION_TX_RX));
  p_config->oversampling = (hal_uart_oversampling_t)(uint32_t)(reg_temp & LL_USART_OVERSAMPLING_8);

  p_config->stop_bits = (hal_uart_stop_bits_t)LL_USART_GetStopBitsLength(p_uartx);

  reg_temp = LL_USART_READ_REG(p_uartx, CR3);
  p_config->hw_flow_ctl = (hal_uart_hw_control_t)(uint32_t)(reg_temp & (LL_USART_HWCONTROL_RTS_CTS));
  p_config->one_bit_sampling = (hal_uart_one_bit_sample_t)(uint32_t)(reg_temp & LL_USART_ONE_BIT_SAMPLE_ENABLE);

  p_config->clock_prescaler = (hal_uart_prescaler_t)LL_USART_GetPrescaler(p_uartx);

  instance_clock_freq = HAL_RCC_UART_GetKernelClkFreq(p_uartx);
  if (IS_LPUART_INSTANCE(p_uartx))
  {
    p_config->baud_rate = LL_LPUART_GetBaudRate(p_uartx, instance_clock_freq, (uint32_t)p_config->clock_prescaler);
  }
  else
  {
    p_config->baud_rate = LL_USART_GetBaudRate(p_uartx, instance_clock_freq,
                                               (uint32_t)p_config->clock_prescaler, (uint32_t)p_config->oversampling);
  }
}

/**
  * @brief Set the Word Length configuration passed in parameters into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param word_length Word length to be applied.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_SetWordLength(const hal_uart_handle_t *huart, hal_uart_word_length_t word_length)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(IS_UART_WORD_LENGTH(word_length));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  p_uartx = UART_GET_INSTANCE(huart);

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_SetDataWidth(p_uartx, (uint32_t)word_length);

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief Get the Word Length configuration according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval hal_uart_word_length_t Current Word length configuration.
  */
hal_uart_word_length_t HAL_UART_GetWordLength(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  p_uartx = UART_GET_INSTANCE(huart);

  return (hal_uart_word_length_t)LL_USART_GetDataWidth(p_uartx);
}

/**
  * @brief Set the Parity configuration passed in parameters into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param parity Parity to be applied.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_SetParity(const hal_uart_handle_t *huart, hal_uart_parity_t parity)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(IS_UART_PARITY(parity));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  p_uartx = UART_GET_INSTANCE(huart);

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_SetParity(p_uartx, (uint32_t)parity);

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief Get the Parity configuration according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval hal_uart_parity_t Current Parity configuration.
  */
hal_uart_parity_t HAL_UART_GetParity(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  p_uartx = UART_GET_INSTANCE(huart);

  return (hal_uart_parity_t)LL_USART_GetParity(p_uartx);
}

/**
  * @brief Set the Stop Bits configuration passed in parameters into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param stop_bits Stop Bits to be applied.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_SetStopBits(const hal_uart_handle_t *huart, hal_uart_stop_bits_t stop_bits)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
#if defined(USE_ASSERT_DBG_PARAM)
  if (IS_LPUART_INSTANCE(p_uartx))
  {
    ASSERT_DBG_PARAM(IS_LPUART_STOP_BITS(stop_bits));
  }
  if (IS_UART_INSTANCE(p_uartx))
  {
    ASSERT_DBG_PARAM(IS_UART_STOP_BITS(stop_bits));
  }
#endif /* USE_ASSERT_DBG_PARAM */

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_SetStopBitsLength(p_uartx, (uint32_t)stop_bits);

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief Get the Stop Bits configuration according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval hal_uart_stop_bits_t Current Stop Bits configuration.
  */
hal_uart_stop_bits_t HAL_UART_GetStopBits(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  p_uartx = UART_GET_INSTANCE(huart);

  return (hal_uart_stop_bits_t)LL_USART_GetStopBitsLength(p_uartx);
}

/**
  * @brief Set the XFer Direction configuration passed in parameters into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param direction XFer Direction to be applied.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_SetXferDirection(const hal_uart_handle_t *huart, hal_uart_direction_t direction)
{
  USART_TypeDef *p_uartx;
  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(IS_UART_DIRECTION(direction));

