MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  p_uartx = UART_GET_INSTANCE(huart);

  LL_USART_SetTransferDirection(p_uartx, (uint32_t)direction);

  return HAL_OK;
}

/**
  * @brief Get the XFer Direction configuration according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval hal_uart_direction_t Current XFer Direction configuration.
  */
hal_uart_direction_t HAL_UART_GetXferDirection(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  p_uartx = UART_GET_INSTANCE(huart);

  return (hal_uart_direction_t)LL_USART_GetTransferDirection(p_uartx);
}

/**
  * @brief Set the Hardwre Flow Control configuration passed in parameters into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param hw_flow_ctl Hardware Flow Control to be applied.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_SetHwFlowCtl(const hal_uart_handle_t *huart, hal_uart_hw_control_t hw_flow_ctl)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(IS_UART_HARDWARE_FLOW_CONTROL(hw_flow_ctl));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  p_uartx = UART_GET_INSTANCE(huart);

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_SetHWFlowCtrl(p_uartx, (uint32_t)hw_flow_ctl);

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief Get the Hardware Flow Control configuration according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval hal_uart_hw_control_t Current Hardware Flow Control configuration.
  */
hal_uart_hw_control_t HAL_UART_GetHwFlowCtl(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  p_uartx = UART_GET_INSTANCE(huart);

  return (hal_uart_hw_control_t)LL_USART_GetHWFlowCtrl(p_uartx);
}

/**
  * @brief Set the One Bit Sample configuration passed in parameters into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param one_bit_sample One Bit Sample to be applied
  * @note  This feature is not available for LPUART instances.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_SetOneBitSample(const hal_uart_handle_t *huart, hal_uart_one_bit_sample_t one_bit_sample)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

  p_uartx = UART_GET_INSTANCE(huart);

#if defined(USE_ASSERT_DBG_PARAM)
  ASSERT_DBG_PARAM(!IS_LPUART_INSTANCE(p_uartx));

#endif /* USE_ASSERT_DBG_PARAM */
  ASSERT_DBG_PARAM(IS_UART_ONE_BIT_SAMPLE(one_bit_sample));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  if (one_bit_sample == HAL_UART_ONE_BIT_SAMPLE_ENABLE)
  {
    LL_USART_EnableOneBitSample(p_uartx);
  }
  else
  {
    LL_USART_DisableOneBitSample(p_uartx);
  }

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief Get the One Bit Sample configuration according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note  This feature is not available for LPUART instances.
  * @retval hal_uart_one_bit_sample_t Current One Bit Sampling configuration.
  */
hal_uart_one_bit_sample_t HAL_UART_GetOneBitSample(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;
  hal_uart_one_bit_sample_t one_bit_sample;

  ASSERT_DBG_PARAM(huart != NULL);

  p_uartx = UART_GET_INSTANCE(huart);

#if defined(USE_ASSERT_DBG_PARAM)
  ASSERT_DBG_PARAM(!IS_LPUART_INSTANCE(p_uartx));

#endif /* USE_ASSERT_DBG_PARAM */
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  if (LL_USART_IsEnabledOneBitSample(p_uartx) != 0U)
  {
    one_bit_sample = HAL_UART_ONE_BIT_SAMPLE_ENABLE;
  }
  else
  {
    one_bit_sample = HAL_UART_ONE_BIT_SAMPLE_DISABLE;
  }
  return (one_bit_sample);
}

/**
  * @brief Set the Baud Rate configuration passed in parameters into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param baud_rate Baud rate value to set.
  * @retval HAL_OK UART instance has been correctly configured.
  * @retval HAL_INVALID_PARAM Required baud rate value can't be set with current config.
  */
hal_status_t HAL_UART_SetBaudRate(const hal_uart_handle_t *huart, uint32_t baud_rate)
{
  USART_TypeDef *p_uartx;
  hal_uart_oversampling_t oversampling;
  uint32_t instance_clock_freq;
  uint32_t instance_clock_prescaler;

  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(IS_UART_BAUD_RATE(baud_rate));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  p_uartx = UART_GET_INSTANCE(huart);
  instance_clock_freq = HAL_RCC_UART_GetKernelClkFreq(p_uartx);
  instance_clock_prescaler = LL_USART_GetPrescaler(p_uartx);

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  if (IS_LPUART_INSTANCE(p_uartx))
  {
    ASSERT_DBG_PARAM(UART_Check_lpuart_baudrate_validity(instance_clock_freq, instance_clock_prescaler,
                                                         baud_rate) == HAL_OK);
    LL_LPUART_SetBaudRate(p_uartx, instance_clock_freq, instance_clock_prescaler, baud_rate);
  }
  else
  {
    oversampling = (hal_uart_oversampling_t)LL_USART_GetOverSampling(p_uartx);
    ASSERT_DBG_PARAM(UART_Check_uart_baudrate_validity(instance_clock_freq, instance_clock_prescaler, baud_rate,
                                                       oversampling) == HAL_OK);
    LL_USART_SetBaudRate(p_uartx, instance_clock_freq, instance_clock_prescaler, (uint32_t)oversampling, baud_rate);
  }

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief Get the Baud Rate configuration according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval uint32_t Current baud rate value.
  */
uint32_t HAL_UART_GetBaudRate(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;
  uint32_t instance_clock_freq;
  uint32_t baud_rate = 0;
  uint32_t oversampling;
  uint32_t prescaler;

  ASSERT_DBG_PARAM(huart != NULL);

