MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  p_uartx = UART_GET_INSTANCE(huart);
  instance_clock_freq = HAL_RCC_UART_GetKernelClkFreq(p_uartx);

  prescaler = LL_USART_GetPrescaler(p_uartx);
  if (IS_LPUART_INSTANCE(p_uartx))
  {
    baud_rate = LL_LPUART_GetBaudRate(p_uartx, instance_clock_freq, prescaler);
  }
  if (IS_UART_INSTANCE(p_uartx))
  {
    oversampling = LL_USART_GetOverSampling(p_uartx);
    baud_rate = LL_USART_GetBaudRate(p_uartx, instance_clock_freq, prescaler, oversampling);
  }

  return (baud_rate);
}
/**
  * @}
  */

/** @addtogroup UART_Exported_Functions_Group3
  * @{
  This subsection provides a set of functions to configure the USARTx instance in IRDA mode.
  Use the following functions to use the IRDA feature:
    - HAL_UART_IRDA_SetConfig(): Set the configuration and enable IRDA mode
    - HAL_UART_IRDA_SetPrescaler(): Set the IRDA prescaler (different from clock prescaler)
    - HAL_UART_IRDA_SetPowerMode(): Set the desired IRDA power mode (low power or normal)

  A set of getter functions is also provided to check the current configuration:
    - HAL_UART_IRDA_GetConfig(): Get the configuration for IRDA mode
    - HAL_UART_IRDA_GetPrescaler(): Get the IRDA prescaler (different from clock prescaler)
    - HAL_UART_IRDA_GetPowerMode(): Get the desired IRDA power mode (low power or normal)

  Note that the HAL_UART_IRDA_SetConfig API can be called without calling
  HAL_UART_SetConfig beforehand. The HAL_UART_xxxx API are still available in IRDA and are used to communicate.

  @warning Please note that while in IRDA mode LIN mode cannot be enabled, the stop bit configuration cannot
           be changed (1 bit is locked) and FIFO cannot be enabled.
  */

/**
  * @brief Set the basic configuration to enable the use of the UART instance.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param p_config Pointer to a hal_uart_irda_config_t structure containing the IRDA configuration.
  * @retval HAL_OK UART instance has been correctly configured.
  * @retval HAL_INVALID_PARAM p_config is NULL.
  */
hal_status_t HAL_UART_IRDA_SetConfig(hal_uart_handle_t *huart, const hal_uart_irda_config_t *p_config)
{
  USART_TypeDef *p_uartx;
  uint32_t instance_clock_freq;
  uint32_t div_temp;
  uint32_t reg_temp;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_IRDA_INSTANCE(p_uartx));
#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
  ASSERT_DBG_PARAM(IS_UART_BAUD_RATE(p_config->baud_rate));
  ASSERT_DBG_PARAM(IS_UART_PRESCALER(p_config->clock_prescaler));
  ASSERT_DBG_PARAM(IS_UART_IRDA_POWER_MODE(p_config->irda_power_mode));
  ASSERT_DBG_PARAM(IS_UART_IRDA_PRESCALER(p_config->irda_prescaler));
  ASSERT_DBG_PARAM(IS_UART_WORD_LENGTH(p_config->word_length));
  ASSERT_DBG_PARAM(IS_UART_PARITY(p_config->parity));
  ASSERT_DBG_PARAM(IS_UART_DIRECTION(p_config->direction));
  ASSERT_DBG_PARAM(IS_UART_ONE_BIT_SAMPLE(p_config->one_bit_sampling));

  ASSERT_DBG_STATE(huart->global_state, (uint32_t)(HAL_UART_STATE_INIT | HAL_UART_STATE_CONFIGURED));
  ASSERT_DBG_STATE(huart->rx_state, (uint32_t)(HAL_UART_RX_STATE_RESET | HAL_UART_RX_STATE_IDLE));
  ASSERT_DBG_STATE(huart->tx_state, (uint32_t)(HAL_UART_TX_STATE_RESET | HAL_UART_TX_STATE_IDLE));

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_ConfigIrdaMode(p_uartx);

  reg_temp = ((uint32_t)p_config->word_length | (uint32_t)p_config->parity
              | (uint32_t)p_config->direction | (uint32_t)HAL_UART_OVERSAMPLING_16);

  LL_USART_ConfigXfer(p_uartx, reg_temp, (uint32_t)HAL_UART_STOP_BIT_1);

  reg_temp = LL_USART_READ_REG(p_uartx, CR3);
  reg_temp = (reg_temp & ~(uint32_t)(HAL_UART_ONE_BIT_SAMPLE_ENABLE)) | (uint32_t)p_config->one_bit_sampling;
  reg_temp = (reg_temp & ~(uint32_t)(HAL_UART_IRDA_POWER_MODE_LOW)) | (uint32_t)p_config->irda_power_mode;
  LL_USART_WRITE_REG(p_uartx, CR3, reg_temp);

  LL_USART_SetIrdaPrescaler(p_uartx, p_config->irda_prescaler);

  LL_USART_SetPrescaler(p_uartx, (uint32_t)p_config->clock_prescaler);

  instance_clock_freq = HAL_RCC_UART_GetKernelClkFreq(p_uartx);
  if (instance_clock_freq != 0UL)
  {
    div_temp = LL_USART_DIV_SAMPLING16(instance_clock_freq, (uint32_t)p_config->clock_prescaler, p_config->baud_rate);
    ASSERT_DBG_PARAM((div_temp >= UART_BRR_MIN) && (div_temp <= UART_BRR_MAX));
  }
  else
  {
    return HAL_ERROR;
  }
  LL_USART_WRITE_REG(p_uartx, BRR, (uint16_t)div_temp);

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  huart->rx_state = HAL_UART_RX_STATE_IDLE;
  huart->tx_state = HAL_UART_TX_STATE_IDLE;
  huart->global_state = HAL_UART_STATE_CONFIGURED;

  return HAL_OK;
}

/**
  * @brief Get the current IRDA configuration set in the current UART instance.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param p_config Pointer to a \ref hal_uart_irda_config_t structure to store the IRDA configuration.
  */
void HAL_UART_IRDA_GetConfig(const hal_uart_handle_t *huart, hal_uart_irda_config_t *p_config)
{
  USART_TypeDef *p_uartx;
  uint32_t reg_temp;
  uint32_t instance_clock_freq;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM((p_config != NULL));
  ASSERT_DBG_PARAM(IS_IRDA_INSTANCE(p_uartx));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  reg_temp = LL_USART_READ_REG(p_uartx, CR1);
  p_config->word_length = (hal_uart_word_length_t)(uint32_t)
                          (reg_temp & (LL_USART_DATAWIDTH_7_BIT | LL_USART_DATAWIDTH_9_BIT));
  p_config->parity = (hal_uart_parity_t)(uint32_t)(reg_temp & (LL_USART_PARITY_ODD));
  p_config->direction = (hal_uart_direction_t)(uint32_t)(reg_temp & (LL_USART_DIRECTION_TX_RX));

  reg_temp = LL_USART_READ_REG(p_uartx, CR3);
  p_config->one_bit_sampling = (hal_uart_one_bit_sample_t)(uint32_t)(reg_temp & LL_USART_ONE_BIT_SAMPLE_ENABLE);
  p_config->irda_power_mode = (hal_uart_irda_power_mode_t)(uint32_t)(reg_temp & LL_USART_IRDA_POWER_MODE_LOW);

