MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
  p_config->clock_prescaler = (hal_uart_prescaler_t)LL_USART_GetPrescaler(p_uartx);

  p_config->irda_prescaler = LL_USART_GetIrdaPrescaler(p_uartx);

  instance_clock_freq = HAL_RCC_UART_GetKernelClkFreq(p_uartx);

  p_config->baud_rate = LL_USART_GetBaudRate(p_uartx, instance_clock_freq, (uint32_t)p_config->clock_prescaler,
                                             (uint32_t)HAL_UART_OVERSAMPLING_16);
}

/**
  * @brief Set the IRDA prescaler value.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param irda_prescaler IRDA prescaler value to set (must be between 0x00 and 0xFF).
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_IRDA_SetPrescaler(const hal_uart_handle_t *huart, uint32_t irda_prescaler)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);

  ASSERT_DBG_PARAM(IS_IRDA_INSTANCE(p_uartx));
  ASSERT_DBG_PARAM(IS_UART_IRDA_PRESCALER(irda_prescaler));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_SetIrdaPrescaler(p_uartx, irda_prescaler);

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief Get the IRDA prescaler value according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval uint32_t Current IRDA prescaler value.
  */
uint32_t HAL_UART_IRDA_GetPrescaler(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(IS_IRDA_INSTANCE(p_uartx));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  return LL_USART_GetIrdaPrescaler(p_uartx);
}

/**
  * @brief Get the IRDA power mode according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param irda_power_mode Irda power mode to set from \ref hal_uart_irda_power_mode_t
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_IRDA_SetPowerMode(const hal_uart_handle_t *huart,
                                        hal_uart_irda_power_mode_t irda_power_mode)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(IS_IRDA_INSTANCE(p_uartx));
  ASSERT_DBG_PARAM(IS_UART_IRDA_POWER_MODE(irda_power_mode));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_SetIrdaPowerMode(p_uartx, (uint32_t)irda_power_mode);

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief Get the IRDA power mode according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval hal_uart_irda_power_mode_t Current IRDA power mode.
  */
hal_uart_irda_power_mode_t HAL_UART_IRDA_GetPowerMode(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(IS_IRDA_INSTANCE(p_uartx));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);


  return (hal_uart_irda_power_mode_t)LL_USART_GetIrdaPowerMode(p_uartx);
}
/**
  * @}
  */

/** @addtogroup UART_Exported_Functions_Group4
  * @{
  This subsection provides a set of functions to configure the USARTx instance in particular
  asynchronous modes.
  Before enabling one of the following particular asynchronous modes, configure the instance in
  asynchronous mode with HAL_UART_SetConfig().

  Some modes require configuration that you can set by calling the following APIs:
    - HAL_UART_SetLINModeBreakDetectLength()
    - HAL_UART_SetConfigRS485Mode()
    - HAL_UART_SetConfigMultiProcessorMode()

  Enable a mode by calling the associated functions:
    - HAL_UART_EnableLINMode()
    - HAL_UART_EnableRS485Mode()
    - HAL_UART_EnableHalfDuplexMode()
    - HAL_UART_EnableMultiProcessorMode()

  The different modes are not compatible with each other, so do not enable two modes on the same instance.

  Disable each mode by calling the associated functions:
    - HAL_UART_DisableLINMode()
    - HAL_UART_DisableRS485Mode()
    - HAL_UART_DisableHalfDuplexMode()
    - HAL_UART_DisableMultiProcessorMode()

  Check whether a mode is enabled by calling the associated functions:
    - HAL_UART_IsEnabledLINMode()
    - HAL_UART_IsEnabledRS485Mode()
    - HAL_UART_IsEnabledHalfDuplexMode()
    - HAL_UART_IsEnabledMultiProcessorMode()

  For the multiprocessor mode, once you enable the mode, it is not active yet. Call
  HAL_UART_EnterMultiProcessorMuteMode() to enter mute. Check whether the UART is in mute with
  HAL_UART_IsEnteredMultiProcessorMuteMode().

  */

/**
  * @brief Enable the LIN Mode.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note  This feature is not available for LPUART instances.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_EnableLINMode(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(IS_UART_LIN_INSTANCE(p_uartx));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  ASSERT_DBG_PARAM(LL_USART_GetOverSampling(p_uartx) == LL_USART_OVERSAMPLING_16);
  ASSERT_DBG_PARAM(LL_USART_GetDataWidth(p_uartx) == LL_USART_DATAWIDTH_8_BIT);

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_ConfigLINMode(p_uartx);

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief Disable the LIN Mode.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note  This feature is not available for LPUART instances.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_DisableLINMode(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(IS_UART_LIN_INSTANCE(p_uartx));

