MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_DisableLIN(p_uartx);

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief Return the LIN Mode status according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note  This feature is not available for LPUART instances.
  * @retval hal_uart_lin_mode_status_t Current LIN mode status.
  */
hal_uart_lin_mode_status_t HAL_UART_IsEnabledLINMode(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(IS_UART_LIN_INSTANCE(p_uartx));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  return (hal_uart_lin_mode_status_t)LL_USART_IsEnabledLIN(p_uartx);
}

/**
  * @brief In LIN mode, set the Break Detection Length configuration passed in parameters into the handler instance
  *        registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param break_detect_length LIN Break Detection Length.
  * @note  This feature is not available for LPUART instances.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_SetLINModeBreakDetectLength(const hal_uart_handle_t *huart,
                                                  hal_uart_lin_break_detect_length_t break_detect_length)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(IS_UART_LIN_INSTANCE(p_uartx));
  ASSERT_DBG_PARAM(IS_UART_LIN_BREAK_DETECT_LENGTH(break_detect_length));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_SetLINBrkDetectionLen(p_uartx, (uint32_t)break_detect_length);

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief In LIN mode, get the Break Detection Length configuration according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note  This feature is not available for LPUART instances.
  * @retval hal_uart_lin_break_detect_length_t Current Break Detection Length configuration.
  */
hal_uart_lin_break_detect_length_t HAL_UART_GetLINModeBreakDetectLength(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(IS_UART_LIN_INSTANCE(p_uartx));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  return (hal_uart_lin_break_detect_length_t)LL_USART_GetLINBrkDetectionLen(p_uartx);
}

/**
  * @brief Enable the RS485 Mode.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_EnableRS485Mode(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(IS_UART_DRIVER_ENABLE_INSTANCE(p_uartx));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_EnableDEMode(p_uartx);

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief Disable the RS485 Mode.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_DisableRS485Mode(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(IS_UART_DRIVER_ENABLE_INSTANCE(p_uartx));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_DisableDEMode(p_uartx);

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief Return the RS485 Mode status according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval hal_uart_rs485_mode_status_t Current RS485 Mode status.
  */
hal_uart_rs485_mode_status_t HAL_UART_IsEnabledRS485Mode(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(IS_UART_DRIVER_ENABLE_INSTANCE(p_uartx));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  return (hal_uart_rs485_mode_status_t)LL_USART_IsEnabledDEMode(p_uartx);
}

/**
  * @brief In RS485 mode, set the configuration passed in parameters into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param p_config Pointer on a hal_uart_rs485_config_t structure.
  * @retval HAL_OK UART instance has been correctly configured.
  * @retval HAL_INVALID_PARAM p_config is NULL.
  */
hal_status_t HAL_UART_SetConfigRS485Mode(const hal_uart_handle_t *huart, const hal_uart_rs485_config_t *p_config)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(IS_UART_DRIVER_ENABLE_INSTANCE(p_uartx));
  ASSERT_DBG_PARAM(IS_UART_ASSERTION_TIME(p_config->assertion_time_samples));
  ASSERT_DBG_PARAM(IS_UART_DEASSERTION_TIME(p_config->deassertion_time_samples));
  ASSERT_DBG_PARAM(IS_UART_DE_POLARITY(p_config->polarity));

