MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  return (hal_uart_multi_processor_mode_status_t)LL_USART_IsEnabledMuteMode(p_uartx);
}

/**
  * @brief For multiprocessor mode, set the mute configuration passed in parameters into the handler instance
  *        registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param p_wakeup_config Pointer to a hal_uart_multi_processor_mode_wakeup_config_t.
  * @retval HAL_OK UART instance has been correctly configured.
  * @retval HAL_INVALID_PARAM p_wakeup_config is NULL.
  */
hal_status_t HAL_UART_SetConfigMultiProcessorMode(const hal_uart_handle_t *huart,
                                                  const hal_uart_multi_processor_mode_wakeup_config_t *p_wakeup_config)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(p_wakeup_config != NULL);
  ASSERT_DBG_PARAM(IS_UART_WAKEUP_METHOD(p_wakeup_config->wakeup_method));
  ASSERT_DBG_PARAM(IS_UART_ADDRESS_LENGTH_DETECT(p_wakeup_config->address_length));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_wakeup_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_uartx = UART_GET_INSTANCE(huart);

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_SetWakeUpMethod(p_uartx, (uint32_t) p_wakeup_config->wakeup_method);
  LL_USART_ConfigNodeAddress(p_uartx, (uint32_t) p_wakeup_config->address_length, (uint32_t) p_wakeup_config->address);

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief For multiprocessor mode, get the mute configuration according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param p_wakeup_config Pointer to a hal_uart_multi_processor_mode_wakeup_config_t.
  */
void HAL_UART_GetConfigMultiProcessorMode(const hal_uart_handle_t *huart,
                                          hal_uart_multi_processor_mode_wakeup_config_t *p_wakeup_config)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(p_wakeup_config != NULL);
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  p_uartx = UART_GET_INSTANCE(huart);

  p_wakeup_config->wakeup_method = (hal_uart_wakeup_method_t)LL_USART_GetWakeUpMethod(p_uartx);
  p_wakeup_config->address_length = (hal_uart_address_detect_length_t)LL_USART_GetNodeAddressLength(p_uartx);
  p_wakeup_config->address = (uint8_t)LL_USART_GetNodeAddress(p_uartx);
}

/**
  * @brief For multiprocessor mode, request instance to enter in mute.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note Requires HAL_UART_EnableMultiProcessorMode to be called first.
  * @retval HAL_OK Request has been sent.
  */
hal_status_t HAL_UART_EnterMultiProcessorMuteMode(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  p_uartx = UART_GET_INSTANCE(huart);

  LL_USART_RequestEnterMuteMode(p_uartx);

  return HAL_OK;
}

/**
  * @brief For multiprocessor mode, return if the instance is in mute.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval hal_uart_multi_processor_mode_mute_status_t Status of mute.
  */
hal_uart_multi_processor_mode_mute_status_t HAL_UART_IsEnteredMultiProcessorMuteMode(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  p_uartx = UART_GET_INSTANCE(huart);

  return (hal_uart_multi_processor_mode_mute_status_t)LL_USART_IsActiveFlag_RWU(p_uartx);
}

/**
  * @}
  */

/** @addtogroup UART_Exported_Functions_Group5
  * @{
  This subsection provides a set of functions to configure advanced features for the USARTx instance.
  Note that not all advanced features are supported on all instances.
  Before configuring advanced features, configure the instance in asynchronous
  mode with HAL_UART_SetConfig().

  Enable a set of advanced features by calling the associated functions:
    - HAL_UART_EnableTxPinLevelInvert(): Enable the Tx pin inverted logical level
    - HAL_UART_EnableRxPinLevelInvert(): Enable the Rx pin inverted logical level
    - HAL_UART_EnableDataInvert(): Enable the binary data inversion (1=L, 0=H)
    - HAL_UART_EnableTxRxSwap(): Enable the swap between Tx and Rx pins
    - HAL_UART_EnableRxOverRunDetection(): Enable the Rx overrun detection
    - HAL_UART_EnableDMAStopOnRxError(): Enable the stop of the DMA in case of Rx error
    - HAL_UART_EnableMSBFirst(): Enable the most significant bit first
    - HAL_UART_EnableReceiverTimeout(): Enable the hardware timeout on the receiver side
    - HAL_UART_EnableTransmitter(): Enable the transmitter side
    - HAL_UART_EnableReceiver(): Enable the receiver side

  Disable a set of advanced features by calling the associated functions:
    - HAL_UART_DisableTxPinLevelInvert(): Disable the Tx pin inverted logical level
    - HAL_UART_DisableRxPinLevelInvert(): Disable the Rx pin inverted logical level
    - HAL_UART_DisableDataInvert(): Disable the binary data inversion (1=H, 0=L)
    - HAL_UART_DisableTxRxSwap(): Disable the swap between Tx and Rx pins
    - HAL_UART_DisableRxOverRunDetection(): Disable the Rx overrun detection
    - HAL_UART_DisableDMAStopOnRxError(): Disable the stop of the DMA in case of Rx error
    - HAL_UART_DisableMSBFirst(): Disable the Most Significant Bit first
    - HAL_UART_DisableReceiverTimeout(): Disable the hardware timeout on the receiver side
    - HAL_UART_DisableTransmitter(): Disable the transmitter side
    - HAL_UART_DisableReceiver(): Disable the receiver side

  Check whether a feature is enabled by calling the associated functions:
    - HAL_UART_IsEnabledTxPinLevelInvert(): Check whether the Tx pin inverted logical level is enabled
    - HAL_UART_IsEnabledRxPinLevelInvert(): Check whether the Rx pin inverted logical level is enabled
    - HAL_UART_IsEnabledDataInvert(): Check whether the binary data inversion is enabled
    - HAL_UART_IsEnabledTxRxSwap(): Check whether the swap between Tx and Rx pins is enabled
    - HAL_UART_IsEnabledRxOverRunDetection(): Check whether the Rx overrun detection is enabled
    - HAL_UART_IsEnabledDMAStopOnRxError(): Check whether the stop of the DMA in case of Rx error is enabled
    - HAL_UART_IsEnabledMSBFirst(): Check whether the Most Significant Bit first is enabled
    - HAL_UART_IsEnabledReceiverTimeout(): Check whether the hardware timeout on the receiver side is enabled
    - HAL_UART_IsEnabledTransmitter(): Check whether the transmitter side is enabled
    - HAL_UART_IsEnabledReceiver(): Check whether the receiver side is enabled

  Configure some features by calling the associated functions:
    - HAL_UART_SetConfigReceiverTimeout(): Set a hardware timeout on the receiver side
    - HAL_UART_GetConfigReceiverTimeout(): Get the hardware timeout on the receiver side
  */

/**
  * @brief Enable the Tx pin level inversion into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_EnableTxPinLevelInvert(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

