MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  p_uartx = UART_GET_INSTANCE(huart);

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_SetTXPinLevel(p_uartx, LL_USART_TXPIN_LEVEL_INVERTED);

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief Disable the Tx pin level inversion into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_DisableTxPinLevelInvert(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  p_uartx = UART_GET_INSTANCE(huart);

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_SetTXPinLevel(p_uartx, LL_USART_TXPIN_LEVEL_STANDARD);

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief Return the Tx pin level inversion status according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval hal_uart_tx_pin_level_invert_status_t Current Tx pin level inversion status.
  */
hal_uart_tx_pin_level_invert_status_t HAL_UART_IsEnabledTxPinLevelInvert(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  p_uartx = UART_GET_INSTANCE(huart);

  if (LL_USART_GetTXPinLevel(p_uartx) == LL_USART_TXPIN_LEVEL_STANDARD)
  {
    return HAL_UART_TX_PIN_LEVEL_INVERT_DISABLED;
  }
  else
  {
    return HAL_UART_TX_PIN_LEVEL_INVERT_ENABLED;
  }
}

/**
  * @brief Enable the Rx pin level inversion into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_EnableRxPinLevelInvert(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  p_uartx = UART_GET_INSTANCE(huart);

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_SetRXPinLevel(p_uartx, LL_USART_RXPIN_LEVEL_INVERTED);

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief Disable the Rx pin level inversion into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_DisableRxPinLevelInvert(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  p_uartx = UART_GET_INSTANCE(huart);

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_SetRXPinLevel(p_uartx, LL_USART_RXPIN_LEVEL_STANDARD);

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief Return the Rx pin level inversion status according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval hal_uart_rx_pin_level_invert_status_t Current Rx pin level inversion status.
  */
hal_uart_rx_pin_level_invert_status_t HAL_UART_IsEnabledRxPinLevelInvert(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  p_uartx = UART_GET_INSTANCE(huart);

  if (LL_USART_GetRXPinLevel(p_uartx) == LL_USART_RXPIN_LEVEL_STANDARD)
  {
    return HAL_UART_RX_PIN_LEVEL_INVERT_DISABLED;
  }
  else
  {
    return HAL_UART_RX_PIN_LEVEL_INVERT_ENABLED;
  }
}

/**
  * @brief Enable the binary Data Inversion into the handler instance registers, (1=L, 0=H).
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_EnableDataInvert(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  p_uartx = UART_GET_INSTANCE(huart);

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_SetBinaryDataLogic(p_uartx, LL_USART_BINARY_LOGIC_NEGATIVE);

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief Disable the binary Data Inversion into the handler instance registers (1=H, 0=L).
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_DisableDataInvert(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  p_uartx = UART_GET_INSTANCE(huart);

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_SetBinaryDataLogic(p_uartx, LL_USART_BINARY_LOGIC_POSITIVE);

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief Return the binary Data Inversion status according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval hal_uart_data_invert_status_t Current Data Inversion status.
  */
hal_uart_data_invert_status_t HAL_UART_IsEnabledDataInvert(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

