MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  p_uartx = UART_GET_INSTANCE(huart);

  if (LL_USART_GetBinaryDataLogic(p_uartx) == LL_USART_BINARY_LOGIC_POSITIVE)
  {
    return HAL_UART_DATA_INVERT_DISABLED;
  }
  else
  {
    return HAL_UART_DATA_INVERT_ENABLED;
  }
}

/**
  * @brief Enable the swap between Tx and Rx pins into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_EnableTxRxSwap(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  p_uartx = UART_GET_INSTANCE(huart);

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_SetTXRXSwap(p_uartx, LL_USART_TXRX_SWAPPED);

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief Disable the swap between Tx and Rx pins into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_DisableTxRxSwap(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  p_uartx = UART_GET_INSTANCE(huart);

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_SetTXRXSwap(p_uartx, LL_USART_TXRX_STANDARD);

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief Return the swap between Tx and Rx pins status according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval hal_uart_tx_rx_swap_status_t Current Tx/Rx swap status.
  */
hal_uart_tx_rx_swap_status_t HAL_UART_IsEnabledTxRxSwap(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  p_uartx = UART_GET_INSTANCE(huart);

  if (LL_USART_GetTXRXSwap(p_uartx) == LL_USART_TXRX_STANDARD)
  {
    return HAL_UART_TX_RX_SWAP_DISABLED;
  }
  else
  {
    return HAL_UART_TX_RX_SWAP_ENABLED;
  }
}

/**
  * @brief Enable the Rx Overrun detection into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note  When UART is initialised and configured with basic configuration parameters, this feature is enabled by
  *        default.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_EnableRxOverRunDetection(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  p_uartx = UART_GET_INSTANCE(huart);

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_EnableOverrunDetect(p_uartx);

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief Disable the Rx Overrun detection into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note  When UART is initialised and configured with basic configuration parameters, this feature is enabled by
  *        default.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_DisableRxOverRunDetection(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  p_uartx = UART_GET_INSTANCE(huart);

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_DisableOverrunDetect(p_uartx);

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief Return the Rx Overrun detection status according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note  When UART is initialised and configured with basic configuration parameters, this feature is enabled by
  *        default.
  * @retval hal_uart_rx_overrun_detection_status_t Current Rx Overrun detection status.
  */
hal_uart_rx_overrun_detection_status_t HAL_UART_IsEnabledRxOverRunDetection(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;
  ASSERT_DBG_PARAM(huart != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  p_uartx = UART_GET_INSTANCE(huart);

  return (hal_uart_rx_overrun_detection_status_t)LL_USART_IsEnabledOverrunDetect(p_uartx);
}

#if defined (USE_HAL_UART_DMA) && (USE_HAL_UART_DMA == 1)
/**
  * @brief Enable the DMA Disabling On a Rx Error into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_EnableDMAStopOnRxError(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  p_uartx = UART_GET_INSTANCE(huart);

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_EnableDMADeactOnRxErr(p_uartx);

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief Disable the DMA Disabling On a Rx Error into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_DisableDMAStopOnRxError(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

