MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  LL_USART_DisableRxTimeout(p_uartx);

  return HAL_OK;
}

/**
  * @brief Return the Receiver Timeout status according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval hal_uart_receiver_timeout_status_t Current Receiver Timeout status.
  */
hal_uart_receiver_timeout_status_t HAL_UART_IsEnabledReceiverTimeout(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(IS_UART_INSTANCE(p_uartx));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  return (hal_uart_receiver_timeout_status_t) LL_USART_IsEnabledRxTimeout(p_uartx);
}

/**
  * @brief Enable the Transmitter into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note  Refer to Half Duplex mode to use this API.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_EnableTransmitter(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  p_uartx = UART_GET_INSTANCE(huart);

  LL_USART_EnableDirectionTx(p_uartx);

  return HAL_OK;
}

/**
  * @brief Disable the Transmitter into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note  Refer to Half Duplex mode to use this API.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_DisableTransmitter(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  p_uartx = UART_GET_INSTANCE(huart);

  LL_USART_DisableDirectionTx(p_uartx);

  return HAL_OK;
}

/**
  * @brief Return the Transmitter status according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note  Refer to Half Duplex mode to use this API.
  * @retval hal_uart_transmitter_status_t Current Transmitter status.
  */
hal_uart_transmitter_status_t HAL_UART_IsEnabledTransmitter(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;
  uint32_t transfer_dir;

  ASSERT_DBG_PARAM(huart != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  p_uartx = UART_GET_INSTANCE(huart);

  transfer_dir = LL_USART_GetTransferDirection(p_uartx);

  if ((transfer_dir == (LL_USART_DIRECTION_TX)) || (transfer_dir == (LL_USART_DIRECTION_TX_RX)))
  {
    return HAL_UART_TRANSMITTER_ENABLED;
  }
  else
  {
    return HAL_UART_TRANSMITTER_DISABLED;
  }
}

/**
  * @brief Enable the Receiver into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note  Refer to Half Duplex mode to use this API.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_EnableReceiver(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  p_uartx = UART_GET_INSTANCE(huart);

  LL_USART_EnableDirectionRx(p_uartx);

  return HAL_OK;
}

/**
  * @brief Disable the Receiver into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note  Refer to Half Duplex mode to use this API.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_DisableReceiver(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  p_uartx = UART_GET_INSTANCE(huart);

  LL_USART_DisableDirectionRx(p_uartx);

  return HAL_OK;
}

/**
  * @brief Return the Receiver status according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note  Refer to Half Duplex mode to use this API.
  * @retval hal_uart_receiver_status_t Current Receiver status.
  */
hal_uart_receiver_status_t HAL_UART_IsEnabledReceiver(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;
  uint32_t transfer_dir;

  ASSERT_DBG_PARAM(huart != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  p_uartx = UART_GET_INSTANCE(huart);

  transfer_dir = LL_USART_GetTransferDirection(p_uartx);

  if ((transfer_dir == (LL_USART_DIRECTION_RX)) || (transfer_dir == (LL_USART_DIRECTION_TX_RX)))
  {
    return HAL_UART_RECEIVER_ENABLED;
  }
  else
  {
    return HAL_UART_RECEIVER_DISABLED;
  }
}
/**
  * @}
  */
/** @addtogroup UART_Exported_Functions_Group6
  * @{
  This subsection provides a set of functions to use the auto baud rate feature for the USARTx instance.
  Before using the auto baud rate feature, configure the instance in asynchronous
  mode with HAL_UART_SetConfig().

  Use the following functions to use the auto baud rate feature:
    - HAL_UART_EnableAutoBaudRate(): Enable the auto baud rate feature
    - HAL_UART_DisableAutoBaudRate(): Disable the auto baud rate feature
    - HAL_UART_IsEnabledAutoBaudRate(): Check if the auto baud rate feature is enabled
    - HAL_UART_GetAutoBaudRateStatus(): Get the result of the auto baud rate operation
    - HAL_UART_SetConfigAutoBaudRateMode(): Set the configuration of the auto baud rate feature
    - HAL_UART_GetConfigAutoBaudRateMode(): Retrieve the configuration of the auto baud rate feature
    - HAL_UART_GetBaudRate(): Retrieve the current baud rate

  Use the following procedure:
    - HAL_UART_SetConfigAutoBaudRateMode()
    - HAL_UART_EnableAutoBaudRate()
    - Start a receive process, for example: HAL_UART_Receive()
    - HAL_UART_GetAutoBaudRateStatus() returns HAL_UART_AUTO_BAUD_RATE_DET_SUCCESS
    - HAL_UART_GetBaudRate()
  */

/**
  * @brief Enable the Auto Baud Rate feature.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note  This feature is not available for LPUART instances.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_EnableAutoBaudRate(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(p_uartx));

