MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  if (LL_USART_IsEnabledAutoBaud(p_uartx) == 0U)
  {
    LL_USART_EnableAutoBaudRate(p_uartx);
  }
  else
  {
    LL_USART_RequestAutoBaudRate(p_uartx);
  }
  return HAL_OK;
}

/**
  * @brief Disable the Auto Baud Rate feature.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note  This feature is not available for LPUART instances.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_DisableAutoBaudRate(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(p_uartx));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  LL_USART_DisableAutoBaudRate(p_uartx);

  return HAL_OK;
}

/**
  * @brief Return the Auto Baud Rate activation status according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note  This feature is not available for LPUART instances.
  * @retval hal_uart_auto_baud_rate_status_t Current Auto Baud Rate activation status.
  */
hal_uart_auto_baud_rate_status_t HAL_UART_IsEnabledAutoBaudRate(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(p_uartx));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  return (hal_uart_auto_baud_rate_status_t)LL_USART_IsEnabledAutoBaud(p_uartx);
}

/**
  * @brief Return the Auto Baud Rate Detection state according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note  This feature is not available for LPUART instances.
  * @note  Baud Rate Value is available though HAL_UART_GetBaudRate().
  * @retval hal_uart_auto_baud_rate_detection_status_t Current Auto Baud Rate detection state.
  */
hal_uart_auto_baud_rate_detection_status_t HAL_UART_GetAutoBaudRateStatus(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(p_uartx));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  if (LL_USART_IsEnabledAutoBaud(p_uartx) == 0U)
  {
    return HAL_UART_AUTO_BAUD_RATE_DET_NOT_ENABLED;
  }

  if (LL_USART_IsActiveFlag_ABR(p_uartx) == 0U)
  {
    return HAL_UART_AUTO_BAUD_RATE_DET_ONGOING;
  }

  if (LL_USART_IsActiveFlag_ABRE(p_uartx) != 0U)
  {
    return HAL_UART_AUTO_BAUD_RATE_DET_ERROR;
  }

  return HAL_UART_AUTO_BAUD_RATE_DET_SUCCESS;
}

/**
  * @brief Set the Auto Baud Rate detection configuration passed in parameters into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param auto_baud_rate_mode Auto Baud Rate Mode to set.
  * @note  This feature is not available for LPUART instances.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_SetConfigAutoBaudRateMode(const hal_uart_handle_t *huart,
                                                hal_uart_auto_baud_rate_mode_t auto_baud_rate_mode)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(p_uartx));
  ASSERT_DBG_PARAM(IS_UART_AUTO_BAUD_RATE_MODE(auto_baud_rate_mode));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  /* Configure Auto Baud Rate only when it is not enabled */
  ASSERT_DBG_PARAM(LL_USART_IsEnabledAutoBaud(p_uartx) == 0U);

  LL_USART_SetAutoBaudRateMode(p_uartx, (uint32_t)auto_baud_rate_mode);

  return HAL_OK;
}

/**
  * @brief Get the Auto Baud Rate detection configuration according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note  This feature is not available for LPUART instances.
  * @retval hal_uart_auto_baud_rate_mode_t Current Auto Baud Rate detection configuration.
  */
hal_uart_auto_baud_rate_mode_t HAL_UART_GetConfigAutoBaudRateMode(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(p_uartx));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  return (hal_uart_auto_baud_rate_mode_t) LL_USART_GetAutoBaudRateMode(p_uartx);
}

/**
  * @}
  */

/** @addtogroup UART_Exported_Functions_Group7
  * @{
  This subsection provides a set of functions to use the stop mode feature for the USARTx instance.
  Before using the stop mode feature, configure the instance in asynchronous
  mode with HAL_UART_SetConfig().
  Use the following functions to use the stop mode feature:
    - HAL_UART_EnableStopMode(): Allow the instance to operate in stop mode
    - HAL_UART_DisableStopMode(): Disallow the instance to operate in stop mode
    - HAL_UART_IsEnabledStopMode(): Check whether the instance is allowed to operate in stop mode
    - HAL_UART_SetStopModeWkUpSource(): Set the source of the Wakeup flag
    - HAL_UART_GetStopModeWkUpSource(): Get the source of the Wakeup flag
    - HAL_UART_SetStopModeWkUpAddrLength(): Set the length of the address if the Wakeup source is an address
    - HAL_UART_GetStopModeWkUpAddrLength(): Get the length of the address
    - HAL_UART_SetStopModeWkUpAddr(): Set the address if the Wakeup source is an address
    - HAL_UART_GetStopModeWkUpAddr(): Get the address set for the Wakeup source

  Use the following procedure:
    - HAL_UART_SetStopModeWkUpSource()
    - HAL_UART_EnableStopMode()
    - Start a process, for example: HAL_UART_Receive_IT()
    - Call the PWR driver to enter low-power mode
    - Sleep until the Wakeup source is triggered
  */

/**
  * @brief Enable the Stop Mode into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_EnableStopMode(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(IS_UART_WAKEUP_FROMSTOP_INSTANCE(p_uartx));

