MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_SetNodeAddress(p_uartx, (uint32_t)address);

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief Get the Stop Mode Wakeup address according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval uint8_t address.
  */
uint8_t HAL_UART_GetStopModeWkUpAddr(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(IS_UART_WAKEUP_FROMSTOP_INSTANCE(p_uartx));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  return (uint8_t)LL_USART_GetNodeAddress(p_uartx);
}

/**
  * @}
  */
/** @addtogroup UART_Exported_Functions_Group8
  * @{
  This subsection provides a set of functions to use the FIFO mode feature for the USARTx instance.
  Before using the FIFO mode feature, configure the instance in asynchronous
  mode with HAL_UART_SetConfig().
  Use the following functions to use the FIFO mode feature:
    - HAL_UART_EnableFifoMode(): Enable the fifo mode feature
    - HAL_UART_DisableFifoMode(): Disable the fifo mode feature
    - HAL_UART_IsEnabledFifoMode(): Check if the fifo mode feature is enabled
    - HAL_UART_SetTxFifoThreshold(): Set the configuration of the Tx FIFO
    - HAL_UART_GetTxFifoThreshold(): Retrieve the configuration of the Tx FIFO
    - HAL_UART_SetRxFifoThreshold(): Set the configuration of the Rx FIFO
    - HAL_UART_GetRxFifoThreshold(): Retrieve the configuration of the Rx FIFO

  Use the following procedure:
    - HAL_UART_SetTxFifoThreshold()
    - HAL_UART_SetRxFifoThreshold()
    - HAL_UART_EnableFifoMode()
    - Start a process, for example: HAL_UART_Receive()
  */

/**
  * @brief Enable the FIFO into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note  This feature is not available in LIN mode.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_EnableFifoMode(hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_EnableFIFO(p_uartx);

  huart->fifo_mode = HAL_UART_FIFO_MODE_ENABLED;

  UART_SetNbDataToProcess(huart);

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief Disable the FIFO into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note  This feature is not available in LIN mode.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_DisableFifoMode(hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);

  LL_USART_DisableFIFO(p_uartx);

  huart->fifo_mode = HAL_UART_FIFO_MODE_DISABLED;

  UART_SetNbDataToProcess(huart);

  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return HAL_OK;
}

/**
  * @brief Return the FIFO status according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note  This feature is not available in LIN mode.
  * @retval hal_uart_fifo_mode_status_t Current FIFO status.
  */
hal_uart_fifo_mode_status_t HAL_UART_IsEnabledFifoMode(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  return (hal_uart_fifo_mode_status_t)LL_USART_IsEnabledFIFO(p_uartx);
}

/**
  * @brief Set the Tx FIFO threshold configuration passed in parameters into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param tx_fifo_threshold Tx FIFO threshold to apply.
  * @note  This feature is not available in LIN mode.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_SetTxFifoThreshold(hal_uart_handle_t *huart, hal_uart_fifo_threshold_t tx_fifo_threshold)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(IS_UART_FIFO_THRESHOLD(tx_fifo_threshold));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  LL_USART_SetTXFIFOThreshold(p_uartx, (uint32_t)tx_fifo_threshold);

  UART_SetNbDataToProcess(huart);

  return HAL_OK;
}

/**
  * @brief Get the Tx FIFO threshold configuration according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note  This feature is not available in LIN mode.
  * @retval hal_uart_fifo_threshold_t Current Tx FIFO threshold configuration.
  */
hal_uart_fifo_threshold_t HAL_UART_GetTxFifoThreshold(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  return (hal_uart_fifo_threshold_t) LL_USART_GetTXFIFOThreshold(p_uartx);
}

/**
  * @brief Set the Rx FIFO threshold configuration passed in parameters into the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param rx_fifo_threshold Rx FIFO threshold to apply.
  * @note  This feature is not available in LIN mode.
  * @retval HAL_OK UART instance has been correctly configured.
  */
hal_status_t HAL_UART_SetRxFifoThreshold(hal_uart_handle_t *huart, hal_uart_fifo_threshold_t rx_fifo_threshold)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(IS_UART_FIFO_THRESHOLD(rx_fifo_threshold));

