MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  LL_USART_SetRXFIFOThreshold(p_uartx, (uint32_t)rx_fifo_threshold);

  UART_SetNbDataToProcess(huart);

  return HAL_OK;
}

/**
  * @brief Get the Rx FIFO threshold configuration according to the handler instance registers.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note  This feature is not available in LIN mode.
  * @retval hal_uart_fifo_threshold_t Current Rx FIFO threshold configuration.
  */
hal_uart_fifo_threshold_t HAL_UART_GetRxFifoThreshold(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  return (hal_uart_fifo_threshold_t) LL_USART_GetRXFIFOThreshold(p_uartx);
}
/**
  * @}
  */


/** @addtogroup UART_Exported_Functions_Group10
  * @{
  This subsection provides a set of functions to link the HAL UART handle to a Tx and Rx DMA handler
  for the USARTx instance.
  Use the following functions to use the DMA feature:
    - HAL_UART_SetTxDMA(): Link a DMA instance to the Tx channel
    - HAL_UART_SetRxDMA(): Link a DMA instance to the Rx channel
  */
#if defined (USE_HAL_UART_DMA) && (USE_HAL_UART_DMA == 1)
/**
  * @brief Set DMA channel for Transmission.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param hdma_tx Pointer to a hal_dma_handle_t structure which contains the DMA instance
  * @retval HAL_OK The channel has been correctly set.
  * @retval HAL_INVALID_PARAM hdma_tx is NULL.
  */
hal_status_t HAL_UART_SetTxDMA(hal_uart_handle_t *huart, hal_dma_handle_t *hdma_tx)
{
  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(hdma_tx != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED | HAL_UART_STATE_INIT);
  ASSERT_DBG_STATE(huart->tx_state, (uint32_t)(HAL_UART_TX_STATE_IDLE | HAL_UART_TX_STATE_RESET));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma_tx == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  huart->hdma_tx = hdma_tx;
  hdma_tx->p_parent = huart;

  return HAL_OK;
}

/**
  * @brief Set DMA channel for Reception.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param hdma_rx Pointer to a hal_dma_handle_t structure which contains the DMA instance
  * @retval HAL_OK The channel has been correctly set.
  * @retval HAL_INVALID_PARAM hdma_rx is NULL.
  */
hal_status_t HAL_UART_SetRxDMA(hal_uart_handle_t *huart, hal_dma_handle_t *hdma_rx)
{
  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(hdma_rx != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED | HAL_UART_STATE_INIT);
  ASSERT_DBG_STATE(huart->rx_state, (uint32_t)(HAL_UART_RX_STATE_IDLE | HAL_UART_RX_STATE_RESET));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma_rx == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  huart->hdma_rx = hdma_rx;
  hdma_rx->p_parent = huart;

  return HAL_OK;
}
#endif /* USE_HAL_UART_DMA */

/**
  * @}
  */

/** @addtogroup UART_Exported_Functions_Group11
  * @{
  This subsection provides a set of functions to configure the callbacks for the USARTx instance.
  Before configuring the callbacks, configure the instance in asynchronous
  mode with HAL_UART_SetConfig().
  Use the following functions to configure the callbacks:
    - HAL_UART_RegisterTxHalfCpltCallback(): Set the Tx half complete callback
    - HAL_UART_RegisterTxCpltCallback(): Set the Tx complete callback
    - HAL_UART_RegisterRxHalfCpltCallback(): Set the Rx half complete callback
    - HAL_UART_RegisterRxCpltCallback(): Set the Rx complete callback
    - HAL_UART_RegisterErrorCallback(): Set the error callback
    - HAL_UART_RegisterAbortCpltCallback(): Set the abort complete callback
    - HAL_UART_RegisterAbortTransmitCpltCallback(): Set the abort transmit complete callback
    - HAL_UART_RegisterAbortReceiveCpltCallback(): Set the abort receive complete callback
    - HAL_UART_RegisterWakeupCallback(): Set the wakeup callback
    - HAL_UART_RegisterRxFifoFullCallback(): Set the Rx FIFO full callback
    - HAL_UART_RegisterTxFifoEmptyCallback(): Set the Tx FIFO empty callback
    - HAL_UART_RegisterClearToSendCallback(): Set the clear to send callback
    - HAL_UART_RegisterLINBreakCallback(): Set the LIN break callback
  */
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)

/**
  * @brief  Register the UART Tx Half Complete Callback.
  * @param  huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param  p_callback pointer to the Tx Half Complete Callback function
  * @retval HAL_OK The function has been registered.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  */
hal_status_t HAL_UART_RegisterTxHalfCpltCallback(hal_uart_handle_t *huart, hal_uart_cb_t p_callback)
{
  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(huart->global_state, (uint32_t)(HAL_UART_STATE_CONFIGURED | HAL_UART_STATE_INIT));
  ASSERT_DBG_STATE(huart->rx_state, (uint32_t)(HAL_UART_RX_STATE_IDLE | HAL_UART_RX_STATE_RESET));
  ASSERT_DBG_STATE(huart->tx_state, (uint32_t)(HAL_UART_TX_STATE_IDLE | HAL_UART_TX_STATE_RESET));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  huart->p_tx_half_cplt_callback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the UART Tx Complete Callback.
  * @param  huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param  p_callback pointer to the Tx Complete Callback function
  * @retval HAL_OK The function has been registered.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  */
hal_status_t HAL_UART_RegisterTxCpltCallback(hal_uart_handle_t *huart, hal_uart_cb_t p_callback)
{
  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

