MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
  ASSERT_DBG_STATE(huart->global_state, (uint32_t)(HAL_UART_STATE_CONFIGURED | HAL_UART_STATE_INIT));
  ASSERT_DBG_STATE(huart->rx_state, (uint32_t)(HAL_UART_RX_STATE_IDLE | HAL_UART_RX_STATE_RESET));
  ASSERT_DBG_STATE(huart->tx_state, (uint32_t)(HAL_UART_TX_STATE_IDLE | HAL_UART_TX_STATE_RESET));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  huart->p_abort_receive_cplt_callback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the UART wakeup callback.
  * @param  huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param  p_callback Pointer to the wakeup callback function.
  * @retval HAL_OK The function has been registered.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  */
hal_status_t HAL_UART_RegisterWakeupCallback(hal_uart_handle_t *huart, hal_uart_cb_t p_callback)
{
  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(huart->global_state, (uint32_t)(HAL_UART_STATE_CONFIGURED | HAL_UART_STATE_INIT));
  ASSERT_DBG_STATE(huart->rx_state, (uint32_t)(HAL_UART_RX_STATE_IDLE | HAL_UART_RX_STATE_RESET));
  ASSERT_DBG_STATE(huart->tx_state, (uint32_t)(HAL_UART_TX_STATE_IDLE | HAL_UART_TX_STATE_RESET));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  huart->p_wakeup_callback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the UART Rx FIFO Full Callback.
  * @param  huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param  p_callback pointer to the Rx FIFO Full Callback function
  * @retval HAL_OK The function has been registered.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  */
hal_status_t HAL_UART_RegisterRxFifoFullCallback(hal_uart_handle_t *huart, hal_uart_cb_t p_callback)
{
  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(huart->global_state, (uint32_t)(HAL_UART_STATE_CONFIGURED | HAL_UART_STATE_INIT));
  ASSERT_DBG_STATE(huart->rx_state, (uint32_t)(HAL_UART_RX_STATE_IDLE | HAL_UART_RX_STATE_RESET));
  ASSERT_DBG_STATE(huart->tx_state, (uint32_t)(HAL_UART_TX_STATE_IDLE | HAL_UART_TX_STATE_RESET));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  huart->p_rx_fifo_full_callback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the UART Tx FIFO Empty Callback.
  * @param  huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param  p_callback pointer to the Tx FIFO Empty Callback function
  * @retval HAL_OK The function has been registered.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  */
hal_status_t HAL_UART_RegisterTxFifoEmptyCallback(hal_uart_handle_t *huart, hal_uart_cb_t p_callback)
{
  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(huart->global_state, (uint32_t)(HAL_UART_STATE_CONFIGURED | HAL_UART_STATE_INIT));
  ASSERT_DBG_STATE(huart->rx_state, (uint32_t)(HAL_UART_RX_STATE_IDLE | HAL_UART_RX_STATE_RESET));
  ASSERT_DBG_STATE(huart->tx_state, (uint32_t)(HAL_UART_TX_STATE_IDLE | HAL_UART_TX_STATE_RESET));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  huart->p_tx_fifo_empty_callback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the UART Clear To Send Callback.
  * @param  huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param  p_callback pointer to the Clear To Send Callback function
  * @retval HAL_OK The function has been registered.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  */
hal_status_t HAL_UART_RegisterClearToSendCallback(hal_uart_handle_t *huart, hal_uart_cb_t p_callback)
{
  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(huart->global_state, (uint32_t)(HAL_UART_STATE_CONFIGURED | HAL_UART_STATE_INIT));
  ASSERT_DBG_STATE(huart->rx_state, (uint32_t)(HAL_UART_RX_STATE_IDLE | HAL_UART_RX_STATE_RESET));
  ASSERT_DBG_STATE(huart->tx_state, (uint32_t)(HAL_UART_TX_STATE_IDLE | HAL_UART_TX_STATE_RESET));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  huart->p_clear_to_send_callback = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the UART LIN Break Callback.
  * @param  huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param  p_callback pointer to the LIN Break Callback function
  * @retval HAL_OK The function has been registered.
  * @retval HAL_INVALID_PARAM p_callback is NULL.
  */
hal_status_t HAL_UART_RegisterLINBreakCallback(hal_uart_handle_t *huart, hal_uart_cb_t p_callback)
{
  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  ASSERT_DBG_STATE(huart->global_state, (uint32_t)(HAL_UART_STATE_CONFIGURED | HAL_UART_STATE_INIT));
  ASSERT_DBG_STATE(huart->rx_state, (uint32_t)(HAL_UART_RX_STATE_IDLE | HAL_UART_RX_STATE_RESET));
  ASSERT_DBG_STATE(huart->tx_state, (uint32_t)(HAL_UART_TX_STATE_IDLE | HAL_UART_TX_STATE_RESET));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  huart->p_lin_break_callback = p_callback;

  return HAL_OK;
}

#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @addtogroup UART_Exported_Functions_Group12
  *  @{
  This subsection provides a set of functions to manage the UART asynchronous
  and Half Duplex data transfers.

 There are two modes of transfer:
    - Blocking mode: The communication is performed in polling mode.
      The HAL status of all data processing is returned by the same function
      after finishing transfer.
    - Non-blocking mode: The communication is performed using interrupts
      or DMA. These APIs return the HAL status.
      The end of the data processing will be indicated through the
      dedicated UART IRQ when using Interrupt mode or the DMA IRQ when
      using DMA mode.
      The HAL_UART_TxCpltCallback() and HAL_UART_RxCpltCallback() user callbacks
      are executed at the end of the transmit or receive process.
      The HAL_UART_ErrorCallback() user callback is executed when a communication error is detected.

  Blocking mode APIs are:
    - HAL_UART_Transmit()
    - HAL_UART_Receive()

  Non-blocking mode APIs with interrupt are:
    - HAL_UART_Transmit_IT()
    - HAL_UART_Transmit_IT_Opt()
    - HAL_UART_Receive_IT()
    - HAL_UART_Receive_IT_Opt()

  Non-blocking mode APIs with DMA are:
    - HAL_UART_Transmit_DMA()
    - HAL_UART_Transmit_DMA_Opt()
    - HAL_UART_Receive_DMA()
    - HAL_UART_Receive_DMA_Opt()
    - HAL_UART_Pause_DMA()
    - HAL_UART_PauseReceive_DMA()
    - HAL_UART_PauseTransmit_DMA()
    - HAL_UART_Resume_DMA()
    - HAL_UART_ResumeReceive_DMA()
    - HAL_UART_ResumeTransmit_DMA()

  A set of Transfer Complete Callbacks are provided in non-blocking mode:
    - HAL_UART_TxHalfCpltCallback()
    - HAL_UART_TxCpltCallback()
    - HAL_UART_RxHalfCpltCallback()
    - HAL_UART_RxCpltCallback()
    - HAL_UART_ErrorCallback()

  Abort non-blocking mode transfers using the Abort APIs:
    - HAL_UART_Abort()
    - HAL_UART_AbortTransmit()
    - HAL_UART_AbortReceive()
    - HAL_UART_Abort_IT()
    - HAL_UART_AbortTransmit_IT()
    - HAL_UART_AbortReceive_IT()

