MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
  For abort services based on interrupts (HAL_UART_Abortxxx_IT), a set of Abort Complete callbacks are provided:
    - HAL_UART_AbortCpltCallback()
    - HAL_UART_AbortTransmitCpltCallback()
    - HAL_UART_AbortReceiveCpltCallback()

  In non-blocking mode transfers, possible errors are split into two categories:
    - Error is considered recoverable and non-blocking: Transfer can run to completion, but error severity is
      to be evaluated by the user. This concerns Frame Error, Parity Error, or Noise Error
      in interrupt mode reception.
      The received character is then retrieved and stored in the Rx buffer, the error code is set to allow the user
      to identify the error type, and the HAL_UART_ErrorCallback() user callback is executed.
      Transfer remains ongoing on the UART side.
      If you want to abort it, call the Abort services.
    - Error is considered blocking: Transfer cannot be completed properly and is aborted.
      This concerns Overrun Error in interrupt mode reception and all errors in DMA mode.
      The error code is set to allow the user to identify the error type, and the HAL_UART_ErrorCallback()
      user callback is executed.

  In Half Duplex communication, do not run the transmit and receive process in parallel.
  */

/**
  * @brief Send an amount of data in blocking mode.
  * @param huart              Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param p_data             Pointer to data buffer.
  * @param size_byte          Amount of bytes to be sent.
  * @param timeout_ms         Timeout duration.
  * @warning When UART parity is not enabled (PCE bit from register CR1 = 0), and Word Length is configured to 9 bits
  *          (M1-M0 from register CR1 = 01), the sent data is handled as a set of u16.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_TIMEOUT       Operation exceeds user timeout.
  * @retval HAL_ERROR         Error during instance enabling.
  */
hal_status_t HAL_UART_Transmit(hal_uart_handle_t *huart, const void *p_data, uint32_t size_byte, uint32_t timeout_ms)
{
  uint32_t tick_start;
  uint32_t reg_temp;
  USART_TypeDef *p_uartx;
  const uint8_t  *p_data_8_bits;
  const uint16_t *p_data_16_bits;

  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_uartx = UART_GET_INSTANCE(huart);

  HAL_CHECK_UPDATE_STATE(huart, tx_state, HAL_UART_TX_STATE_IDLE, HAL_UART_TX_STATE_ACTIVE);

  if (UART_CheckEnabledState(huart) != HAL_OK)
  {
    huart->tx_state = HAL_UART_TX_STATE_IDLE;
    return HAL_ERROR;
  }

  if (LL_USART_IsEnabledHalfDuplex(p_uartx) != 0U)
  {
    LL_USART_SetTransferDirection(p_uartx, LL_USART_DIRECTION_TX);
  }

  reg_temp = LL_USART_READ_REG(p_uartx, CR1);

  if (((reg_temp & USART_CR1_M) == LL_USART_DATAWIDTH_9_BIT) && ((reg_temp & USART_CR1_PCE) == LL_USART_PARITY_NONE))
  {
    p_data_16_bits = (const uint16_t *)p_data;
    p_data_8_bits = NULL;
  }
  else
  {
    p_data_8_bits = (const uint8_t *)p_data;
    p_data_16_bits = NULL;
  }

  /* Init tick_start for timeout management */
  tick_start = HAL_GetTick();

  huart->tx_xfer_size  = size_byte;
  huart->tx_xfer_count = size_byte;

  while (huart->tx_xfer_count > 0U)
  {
    if (UART_WaitOnFlagUntilTimeout(huart, LL_USART_ISR_TXE_TXFNF, 0U, tick_start, timeout_ms) != HAL_OK)
    {
      huart->tx_state = HAL_UART_TX_STATE_IDLE;
      return HAL_TIMEOUT;
    }
    if (p_data_8_bits == NULL)
    {
      LL_USART_TransmitData9(p_uartx, *p_data_16_bits);
      p_data_16_bits++;
    }
    else
    {
      LL_USART_TransmitData8(p_uartx, *p_data_8_bits);
      p_data_8_bits++;
    }
    huart->tx_xfer_count--;
  }

  if (UART_WaitOnFlagUntilTimeout(huart, LL_USART_ISR_TC, 0U, tick_start, timeout_ms) != HAL_OK)
  {
    huart->tx_state = HAL_UART_TX_STATE_IDLE;
    return HAL_TIMEOUT;
  }

  huart->tx_state = HAL_UART_TX_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief Receive an amount of data in blocking mode.
  * @param huart              Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param p_data             Pointer to data buffer.
  * @param size_byte          Amount of bytes to be received.
  * @param timeout_ms         Timeout duration.
  * @warning When UART parity is not enabled (PCE bit from the CR1 register = 0), and Word Length is configured to
  *          9 bits (M1-M0 from the CR1 register = 01), the received data is handled as a set of u16.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_TIMEOUT       Operation exceeds user timeout.
  * @retval HAL_ERROR         Error during instance enabling.
  */
hal_status_t HAL_UART_Receive(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte, uint32_t timeout_ms)
{
  hal_status_t status;

  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(huart, rx_state, HAL_UART_RX_STATE_IDLE, HAL_UART_RX_STATE_ACTIVE);

  status = UART_Start_Receive_Polling(huart, p_data, size_byte, NULL, timeout_ms, HAL_UART_RX_STANDARD);

  huart->rx_state = HAL_UART_RX_STATE_IDLE;
  return status;
}

/**
  * @brief Send an amount of data in interrupt mode.
  * @param huart              Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param p_data             Pointer to data buffer.
  * @param size_byte          Amount of bytes to be sent.
  * @warning When UART parity is not enabled (PCE bit from the CR1 register = 0), and Word Length is configured to
  *          9 bits (M1-M0 from the CR1 register = 01), the sent data is handled as a set of u16.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_ERROR         Error during instance enabling.
  */
hal_status_t HAL_UART_Transmit_IT(hal_uart_handle_t *huart, const void *p_data, uint32_t size_byte)
{

  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0);

