MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(huart, tx_state, HAL_UART_TX_STATE_IDLE, HAL_UART_TX_STATE_ACTIVE);

  return UART_Start_Transmit_IT(huart, (const uint8_t *)p_data, size_byte, HAL_UART_OPT_TX_IT_NONE);
}

/**
  * @brief Send an amount of data in interrupt mode, allow user to enable Optional Interrupts part of
  *        \ref UART_Transmit_IT_Optional_Interrupts.
  * @param huart              Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param p_data             Pointer to data buffer.
  * @param size_byte          Amount of bytes to be sent.
  * @param interrupts         Optional interrupts part of \ref UART_Transmit_IT_Optional_Interrupts.
  * @warning When UART parity is not enabled (PCE bit from the CR1 register = 0), and Word Length is configured to
  *          9 bits (M1-M0 from the CR1 register = 01), the sent data is handled as a set of u16.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_ERROR         Error during instance enabling.
  */
hal_status_t HAL_UART_Transmit_IT_Opt(hal_uart_handle_t *huart, const void *p_data, uint32_t size_byte,
                                      uint32_t interrupts)
{

  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0);
  ASSERT_DBG_PARAM(IS_UART_OPT_TX_IT(interrupts));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(huart, tx_state, HAL_UART_TX_STATE_IDLE, HAL_UART_TX_STATE_ACTIVE);

  return UART_Start_Transmit_IT(huart, (const uint8_t *)p_data, size_byte, interrupts);
}

/**
  * @brief Receive an amount of data in interrupt mode.
  * @param huart              Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param p_data             Pointer to data buffer.
  * @param size_byte          Amount of bytes to be received.
  * @warning When UART parity is not enabled (PCE bit from the CR1 register = 0), and Word Length is configured to
  *          9 bits (M1-M0 from the CR1 register = 01), the received data is handled as a set of u16.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_ERROR         Error during instance enabling.
  */
hal_status_t HAL_UART_Receive_IT(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte)
{
  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(huart, rx_state, HAL_UART_RX_STATE_IDLE, HAL_UART_RX_STATE_ACTIVE);

  huart->reception_type = HAL_UART_RX_STANDARD;

  return (UART_Start_Receive_IT(huart, (uint8_t *)p_data, size_byte, HAL_UART_RX_STANDARD,
                                HAL_UART_OPT_RX_IT_NONE));
}

/**
  * @brief Receive an amount of data in interrupt mode, allow user to enable Optional Interrupts part of
  *        \ref UART_Receive_IT_Optional_Interrupts.
  * @param huart              Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param p_data             Pointer to data buffer.
  * @param size_byte          Amount of bytes to be received.
  * @param interrupts         Optional interrupts part of \ref UART_Receive_IT_Optional_Interrupts.
  * @warning When UART parity is not enabled (PCE bit from the CR1 register = 0), and Word Length is configured to
  *          9 bits (M1-M0 from the CR1 register = 01), the received data is handled as a set of u16.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_ERROR         Error during instance enabling.
  */
hal_status_t HAL_UART_Receive_IT_Opt(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte, uint32_t interrupts)
{
  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0);
  ASSERT_DBG_PARAM(IS_UART_OPT_RX_IT(interrupts));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(huart, rx_state, HAL_UART_RX_STATE_IDLE, HAL_UART_RX_STATE_ACTIVE);

  huart->reception_type = HAL_UART_RX_STANDARD;

  return (UART_Start_Receive_IT(huart, (uint8_t *)p_data, size_byte, HAL_UART_RX_STANDARD,
                                interrupts));
}

#if defined (USE_HAL_UART_DMA) && (USE_HAL_UART_DMA == 1)
/**
  * @brief Send an amount of data in DMA mode.
  * @param huart              Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param p_data             Pointer to data buffer.
  * @param size_byte          Amount of bytes to be sent.
  * @warning When UART parity is not enabled (PCE bit from the CR1 register = 0), and Word Length is configured to
  *          9 bits (M1-M0 from the CR1 register = 01), the sent data is handled as a set of u16.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_ERROR         TX DMA handler not set or Error during instance enabling.
  */
hal_status_t HAL_UART_Transmit_DMA(hal_uart_handle_t *huart, const void *p_data, uint32_t size_byte)
{

  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0);
  ASSERT_DBG_PARAM(huart->hdma_tx != NULL);

