MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
  if (huart->rx_state == HAL_UART_RX_STATE_ACTIVE)
  {
    if (LL_USART_IsEnabledDMAReq_RX(p_uartx) != 0U)
    {
      if (huart->hdma_rx != NULL)
      {
        LL_USART_DisableIT_PE(p_uartx);
        LL_USART_DisableIT_ERROR(p_uartx);
        LL_USART_DisableDMAReq_RX(p_uartx);
        huart->rx_state = HAL_UART_RX_STATE_PAUSED;
      }
    }
  }
  return HAL_OK;
}

/**
  * @brief Pause the DMA receive transfer.
  * @param huart        Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval HAL_OK      Operation completed successfully.
  */
hal_status_t HAL_UART_PauseReceive_DMA(hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  p_uartx = UART_GET_INSTANCE(huart);

  if (huart->rx_state == HAL_UART_RX_STATE_ACTIVE)
  {
    if (LL_USART_IsEnabledDMAReq_RX(p_uartx) != 0U)
    {
      if (huart->hdma_rx != NULL)
      {
        LL_USART_DisableIT_PE(p_uartx);
        LL_USART_DisableIT_ERROR(p_uartx);
        LL_USART_DisableDMAReq_RX(p_uartx);
        huart->rx_state = HAL_UART_RX_STATE_PAUSED;
      }
    }
  }

  return HAL_OK;
}

/**
  * @brief Pause the DMA transmit transfer.
  * @param huart        Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval HAL_OK      Operation completed successfully.
  */
hal_status_t HAL_UART_PauseTransmit_DMA(hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  p_uartx = UART_GET_INSTANCE(huart);

  if (huart->tx_state == HAL_UART_TX_STATE_ACTIVE)
  {
    if (LL_USART_IsEnabledDMAReq_TX(p_uartx) != 0U)
    {
      LL_USART_DisableDMAReq_TX(p_uartx);
      huart->tx_state = HAL_UART_TX_STATE_PAUSED;
    }
  }
  return HAL_OK;
}

/**
  * @brief Resume DMA transfer.
  * @param huart      Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval HAL_OK    Operation completed successfully.
  */
hal_status_t HAL_UART_Resume_DMA(hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  p_uartx = UART_GET_INSTANCE(huart);

  if (huart->tx_state == HAL_UART_TX_STATE_PAUSED)
  {
    if (huart->hdma_tx != NULL)
    {
      LL_USART_EnableDMAReq_TX(p_uartx);
      huart->tx_state = HAL_UART_TX_STATE_ACTIVE;
    }
  }

  if (huart->rx_state == HAL_UART_RX_STATE_PAUSED)
  {
    if (huart->hdma_rx != NULL)
    {
      LL_USART_ClearFlag_ORE(p_uartx);

      if (LL_USART_GetParity(p_uartx) != LL_USART_PARITY_NONE)
      {
        LL_USART_EnableIT_PE(p_uartx);
      }
      LL_USART_RequestRxDataFlush(p_uartx);
      LL_USART_EnableIT_ERROR(p_uartx);
      LL_USART_EnableDMAReq_RX(p_uartx);
      huart->rx_state = HAL_UART_RX_STATE_ACTIVE;
    }
  }
  return HAL_OK;
}

/**
  * @brief Resume the DMA receive transfer.
  * @param huart      Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval HAL_OK    Operation completed successfully.
  */
hal_status_t HAL_UART_ResumeReceive_DMA(hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  p_uartx = UART_GET_INSTANCE(huart);

  if (huart->rx_state == HAL_UART_RX_STATE_PAUSED)
  {
    if (huart->hdma_rx != NULL)
    {
      LL_USART_ClearFlag_ORE(p_uartx);

      if (LL_USART_GetParity(p_uartx) != LL_USART_PARITY_NONE)
      {
        LL_USART_EnableIT_PE(p_uartx);
      }
      LL_USART_RequestRxDataFlush(p_uartx);
      LL_USART_EnableIT_ERROR(p_uartx);
      LL_USART_EnableDMAReq_RX(p_uartx);
      huart->rx_state = HAL_UART_RX_STATE_ACTIVE;
    }
  }
  return HAL_OK;
}

/**
  * @brief Resume the DMA transmit transfer.
  * @param huart      Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval HAL_OK    Operation completed successfully.
  */
hal_status_t HAL_UART_ResumeTransmit_DMA(hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  p_uartx = UART_GET_INSTANCE(huart);

  if (huart->tx_state == HAL_UART_TX_STATE_PAUSED)
  {
    if (huart->hdma_tx != NULL)
    {
      LL_USART_EnableDMAReq_TX(p_uartx);
      huart->tx_state = HAL_UART_TX_STATE_ACTIVE;
    }
  }
  return HAL_OK;
}
#endif /* USE_HAL_UART_DMA */

/**
  * @brief  Abort ongoing transfers (blocking mode).
  * @param  huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note   This procedure could be used for aborting any ongoing transfer started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable UART Interrupts (Tx and Rx)
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort (in case of transfer in DMA mode)
  *           - Set handle rx_state to HAL_UART_RX_STATE_IDLE and tx_state to HAL_UART_TX_STATE_IDLE
  * @note   This procedure is executed in blocking mode : when exiting function, Abort is considered as completed.
  * @retval HAL_OK      Operation completed successfully.
  */
hal_status_t HAL_UART_Abort(hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  p_uartx = UART_GET_INSTANCE(huart);

  huart->tx_state = HAL_UART_TX_STATE_ABORT;
  huart->rx_state = HAL_UART_RX_STATE_ABORT;

  (void)UART_Abort(huart);

#if defined (USE_HAL_UART_DMA) && (USE_HAL_UART_DMA == 1)
  if (LL_USART_IsEnabledDMAReq_TX(p_uartx) != 0U)
  {
    LL_USART_DisableDMAReq_TX(p_uartx);
    /* Abort the UART DMA Tx channel : use blocking DMA Abort API (no callback) */
    if (huart->hdma_tx != NULL)
    {
      (void)HAL_DMA_Abort(huart->hdma_tx);
    }
  }
  if (LL_USART_IsEnabledDMAReq_RX(p_uartx) != 0U)
  {
    LL_USART_DisableDMAReq_RX(p_uartx);
    /* Abort the UART DMA Rx channel : use blocking DMA Abort API (no callback) */
    if (huart->hdma_rx != NULL)
    {
      (void)HAL_DMA_Abort(huart->hdma_rx);
    }
  }
#endif /* USE_HAL_UART_DMA */

  huart->rx_xfer_count = 0U;
  huart->tx_xfer_count = 0U;
  /* Clear the Error flags in the ICR register */
  LL_USART_ClearFlag(p_uartx, LL_USART_ICR_ORECF | LL_USART_ICR_NECF | LL_USART_ICR_PECF | LL_USART_ICR_FECF);

  /* Flush the whole FIFO */
  LL_USART_RequestTxDataFlush(p_uartx);
  LL_USART_RequestRxDataFlush(p_uartx);

