MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
#if defined (USE_HAL_UART_GET_LAST_ERRORS) && (USE_HAL_UART_GET_LAST_ERRORS == 1)
    huart->last_reception_error_codes = 0U;
    huart->last_transmission_error_codes = 0U;
#endif /* USE_HAL_UART_GET_LAST_ERRORS */

    huart->tx_state = HAL_UART_TX_STATE_IDLE;
    huart->rx_state = HAL_UART_RX_STATE_IDLE;
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    huart->p_abort_cplt_callback(huart);
#else
    HAL_UART_AbortCpltCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
  }
  return HAL_OK;
}

/**
  * @brief  Abort ongoing Transmit transfer (Interrupt mode).
  * @param  huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note   This procedure could be used for aborting any ongoing Tx transfer started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable UART Interrupts (Tx)
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort_IT (in case of transfer in DMA mode)
  *           - Set handle tx_state to HAL_UART_TX_STATE_IDLE
  *           - At abort completion, call user abort complete callback
  * @note   This procedure is executed in Interrupt mode, meaning that abort procedure could be
  *         considered as completed only when user abort complete callback is executed (not when exiting function).
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_UART_AbortTransmit_IT(hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;
  uint32_t abort_cplt;

  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  p_uartx = UART_GET_INSTANCE(huart);
  abort_cplt = 1U;

  huart->tx_state = HAL_UART_TX_STATE_ABORT;

  LL_USART_DisableIT_CR1(p_uartx, (LL_USART_CR1_TXEIE_TXFNFIE | LL_USART_CR1_TCIE | LL_USART_CR1_TXFEIE));
  LL_USART_DisableIT_CR3(p_uartx, (LL_USART_CR3_TXFTIE | LL_USART_CR3_CTSIE));
  LL_USART_ClearFlag(p_uartx, (LL_USART_ICR_TXFECF | LL_USART_ICR_CTSCF));

#if defined (USE_HAL_UART_DMA) && (USE_HAL_UART_DMA == 1)
  if (LL_USART_IsEnabledDMAReq_TX(p_uartx) != 0U)
  {
    LL_USART_DisableDMAReq_TX(p_uartx);
    /* Abort the UART DMA Tx channel : use blocking DMA Abort API (no callback) */
    if (huart->hdma_tx != NULL)
    {
      if (huart->hdma_tx->global_state == HAL_DMA_STATE_ACTIVE)
      {
        huart->hdma_tx->p_xfer_abort_cb = UART_DMATxOnlyAbortCallback;
        if (HAL_DMA_Abort_IT(huart->hdma_tx) == HAL_OK)
        {
          abort_cplt = 0U;
        }
      }
    }
  }
#endif /* USE_HAL_UART_DMA */

  /* if no DMA abort complete callback execution is required => call user Abort Complete callback */
  if (abort_cplt != 0U)
  {
    huart->tx_xfer_count = 0U;

    huart->p_tx_isr = NULL;

    LL_USART_RequestTxDataFlush(p_uartx);

#if defined (USE_HAL_UART_GET_LAST_ERRORS) && (USE_HAL_UART_GET_LAST_ERRORS == 1)
    huart->last_transmission_error_codes = 0;
#endif /* USE_HAL_UART_GET_LAST_ERRORS */

    huart->tx_state = HAL_UART_TX_STATE_IDLE;

#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    huart->p_abort_transmit_cplt_callback(huart);
#else
    HAL_UART_AbortTransmitCpltCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
  }
  return HAL_OK;
}

/**
  * @brief  Abort ongoing Receive transfer (Interrupt mode).
  * @param  huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @note   This procedure could be used for aborting any ongoing Rx transfer started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable UART Interrupts (Rx)
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort_IT (in case of transfer in DMA mode)
  *           - Set handle rx_state to HAL_UART_RX_STATE_IDLE
  *           - At abort completion, call user abort complete callback
  * @note   This procedure is executed in Interrupt mode, meaning that abort procedure could be
  *         considered as completed only when user abort complete callback is executed (not when exiting function).
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_UART_AbortReceive_IT(hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;
  uint32_t abort_cplt;

  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  p_uartx = UART_GET_INSTANCE(huart);
  abort_cplt = 1U;

  huart->rx_state = HAL_UART_RX_STATE_ABORT;

  LL_USART_DisableIT_CR1(p_uartx, (LL_USART_CR1_RXNEIE_RXFNEIE | LL_USART_CR1_PEIE | LL_USART_CR1_RXFFIE
                                   | LL_USART_CR1_IDLEIE | LL_USART_CR1_RTOIE | LL_USART_CR1_CMIE));
  LL_USART_DisableIT_CR2(p_uartx, LL_USART_CR2_LBDIE);
  LL_USART_DisableIT_CR3(p_uartx, (LL_USART_CR3_EIE | LL_USART_CR3_RXFTIE));
  LL_USART_ClearFlag(p_uartx, LL_USART_ICR_LBDCF | LL_USART_ICR_IDLECF | LL_USART_ICR_RTOCF | LL_USART_ICR_CMCF);

  LL_USART_ClearFlag(p_uartx, LL_USART_ICR_LBDCF | LL_USART_ICR_IDLECF | LL_USART_ICR_RTOCF | LL_USART_ICR_CMCF);

#if defined (USE_HAL_UART_DMA) && (USE_HAL_UART_DMA == 1)
  if (LL_USART_IsEnabledDMAReq_RX(p_uartx) != 0U)
  {
    LL_USART_DisableDMAReq_RX(p_uartx);
    /* Abort the UART DMA Tx channel : use blocking DMA Abort API (no callback) */
    if (huart->hdma_rx != NULL)
    {
      if (huart->hdma_rx->global_state == HAL_DMA_STATE_ACTIVE)
      {
        huart->hdma_rx->p_xfer_abort_cb = UART_DMARxOnlyAbortCallback;
        if (HAL_DMA_Abort_IT(huart->hdma_rx) == HAL_OK)
        {
          abort_cplt = 0U;
        }
      }
    }
  }

#endif /* USE_HAL_UART_DMA */

  /* if no DMA abort complete callback execution is required => call user Abort Complete callback */
  if (abort_cplt != 0U)
  {
    huart->rx_xfer_count = 0U;

    huart->p_rx_isr = NULL;
    /* Clear the Error flags in the ICR register */
    LL_USART_ClearFlag(p_uartx, LL_USART_ICR_ORECF | LL_USART_ICR_NECF | LL_USART_ICR_PECF | LL_USART_ICR_FECF);

    LL_USART_RequestRxDataFlush(p_uartx);

    huart->reception_type = HAL_UART_RX_STANDARD;

