MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
#if defined (USE_HAL_UART_GET_LAST_ERRORS) && (USE_HAL_UART_GET_LAST_ERRORS == 1)
    huart->last_reception_error_codes = 0;
#endif /* USE_HAL_UART_GET_LAST_ERRORS */

    huart->rx_state = HAL_UART_RX_STATE_IDLE;

#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    huart->p_abort_receive_cplt_callback(huart);
#else
    HAL_UART_AbortReceiveCpltCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
  }
  return HAL_OK;
}
/**
  * @}
  */

/** @addtogroup UART_Exported_Functions_Group17
  * @{
  This subsection provides the function handling the interruption of the USARTx in asynchronous mode.

  - HAL_UART_IRQHandler(): process the interruption of an instance

  HAL_UART_IRQHandler() is designed to process the different interruptions in the following order:
    - Error on Rx side (PE, FE, ORE, NE, RTOF)
    - Error on DMA side
    - Data on Rx side
    - Data on Tx side

  Depending on the process function (_Opt included) one's use, different callback might be triggered:

| Process API \n \ \n Callbacks | HAL_UART_Transmit_IT | HAL_UART_Receive_IT |
|-------------------------------|:--------------------:|:-------------------:|
| HAL_UART_TxCpltCallback       |           x          |                     |
| HAL_UART_RxCpltCallback       |                      |          x          |
| HAL_UART_ErrorCallback        |           x          |          x          |

| Process API \n \ \n Callbacks  | HAL_UART_Transmit_DMA | HAL_UART_Receive_DMA |
|--------------------------------|:---------------------:|:--------------------:|
| HAL_UART_TxHalfCpltCallback*   |           x           |                      |
| HAL_UART_TxCpltCallback        |           x           |                      |
| HAL_UART_RxHalfCpltCallback*   |                       |           x          |
| HAL_UART_RxCpltCallback        |                       |           x          |
| HAL_UART_ErrorCallback**       |           x           |           x          |
@note * these callbacks might be called following DMA IRQ management, not USARTx IRQ management.
@note ** these callbacks might be called following DMA IRQ management, or USARTx IRQ management.

| Process API \n \ \n Callbacks      | HAL_UART_Abort_IT | HAL_UART_AbortTransmit_IT | HAL_UART_AbortReceive_IT |
|------------------------------------|:-----------------:|:-------------------------:|:-----------------------: |
| HAL_UART_AbortCpltCallback         |          x        |                           |                          |
| HAL_UART_AbortTransmitCpltCallback |                   |           x               |                          |
| HAL_UART_AbortReceiveCpltCallback  |                   |                           |           x              |
| HAL_UART_ErrorCallback             |          x        |           x               |           x              |

| Process API \n \ \n Callbacks | HAL_UART_ReceiveToIdle_IT | HAL_UART_ReceiveUntilTMO_IT |
|-------------------------------|:-------------------------:|:--------------------------: |
| HAL_UART_RxCpltCallback       |          x                |           x                 |
| HAL_UART_ErrorCallback        |          x                |           x                 |

| Process API \n \ \n Callbacks | HAL_UART_ReceiveUntilCM_IT |
|-------------------------------|:--------------------------------------:|
| HAL_UART_RxCpltCallback       |                   x                    |
| HAL_UART_ErrorCallback        |                   x                    |

| Process API \n \ \n Callbacks | HAL_UART_ReceiveToIdle_DMA      | HAL_UART_ReceiveUntilTMO_DMA |
|-------------------------------|:-------------------------------:|:---------------------------: |
| HAL_UART_RxHalfCpltCallback   |                x                |               x              |
| HAL_UART_RxCpltCallback       |                x                |               x              |
| HAL_UART_ErrorCallback        |                x                |               x              |

| Process API \n \ \n Callbacks | HAL_UART_ReceiveUntilCM_DMA |
|-------------------------------|:--------------------------------------: |
| HAL_UART_RxHalfCpltCallback   |                   x                     |
| HAL_UART_RxCpltCallback       |                   x                     |
| HAL_UART_ErrorCallback        |                   x                     |

| Process API \n \ \n Callbacks | HAL_UART_EnableLINMode |
|-------------------------------|:---------------------: |
|  HAL_UART_LINBreakCallback    |           x            |

  */

/**
  * @brief Handle UART interrupt request.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  */
void HAL_UART_IRQHandler(hal_uart_handle_t *huart)
{
  ASSERT_DBG_PARAM(huart != NULL);

  USART_TypeDef *p_uartx = UART_GET_INSTANCE(huart);

  uint32_t isr_flags = LL_USART_READ_REG(p_uartx, ISR);
  uint32_t cr1_its   = LL_USART_READ_REG(p_uartx, CR1);
  uint32_t cr2_its   = LL_USART_READ_REG(p_uartx, CR2);
  uint32_t cr3_its   = LL_USART_READ_REG(p_uartx, CR3);

  uint32_t error_flags;
  uint32_t error_code = 0U;
  hal_uart_rx_modes_t reception_type;

  reception_type = huart->reception_type;

  if (reception_type != HAL_UART_RX_TO_RTO)
  {
    error_flags = (isr_flags & (uint32_t)(LL_USART_ISR_PE | LL_USART_ISR_FE | LL_USART_ISR_ORE |
                                          LL_USART_ISR_NE | LL_USART_ISR_RTOF));
  }
  else
  {
    error_flags = (isr_flags & (uint32_t)(LL_USART_ISR_PE | LL_USART_ISR_FE | LL_USART_ISR_ORE |
                                          LL_USART_ISR_NE));
  }

  if (error_flags == 0U)
  {
    /* UART in mode Receiver ---------------------------------------------------*/
    if (((isr_flags & LL_USART_ISR_RXNE_RXFNE) != 0U)
        && (((cr1_its & LL_USART_CR1_RXNEIE_RXFNEIE) != 0U)
            || ((cr3_its & LL_USART_CR3_RXFTIE) != 0U)))
    {
      if (huart->p_rx_isr != NULL)
      {
        huart->p_rx_isr(huart);
      }
      return;
    }
  }

  /* If some errors occur */
  if ((error_flags != 0U)
      && ((((cr3_its & (LL_USART_CR3_RXFTIE | LL_USART_CR3_EIE)) != 0U)
           || ((cr1_its & (LL_USART_CR1_RXNEIE_RXFNEIE | LL_USART_CR1_PEIE | LL_USART_CR1_RTOIE)) != 0U))))
  {
    /* UART parity error interrupt occurred -------------------------------------*/
    if (((isr_flags & LL_USART_ISR_PE) != 0U) && ((cr1_its & LL_USART_CR1_PEIE) != 0U))
    {
      LL_USART_ClearFlag_PE(p_uartx);

