MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
      error_code |= HAL_UART_RECEIVE_ERROR_PE;
    }

    /* UART frame error interrupt occurred --------------------------------------*/
    if (((isr_flags & LL_USART_ISR_FE) != 0U) && ((cr3_its & LL_USART_CR3_EIE) != 0U))
    {
      LL_USART_ClearFlag_FE(p_uartx);

      error_code |= HAL_UART_RECEIVE_ERROR_FE;
    }

    /* UART noise error interrupt occurred --------------------------------------*/
    if (((isr_flags & LL_USART_ISR_NE) != 0U) && ((cr3_its & LL_USART_CR3_EIE) != 0U))
    {
      LL_USART_ClearFlag_NE(p_uartx);

      error_code |= HAL_UART_RECEIVE_ERROR_NE;
    }

    /* UART Over-Run interrupt occurred -----------------------------------------*/
    if (((isr_flags & LL_USART_ISR_ORE) != 0U)
        && (((cr1_its & LL_USART_CR1_RXNEIE_RXFNEIE) != 0U)
            || ((cr3_its & (LL_USART_CR3_RXFTIE | LL_USART_CR3_EIE)) != 0U)))
    {
      LL_USART_ClearFlag_ORE(p_uartx);

      error_code |= HAL_UART_RECEIVE_ERROR_ORE;
    }

    /* UART Receiver Timeout interrupt occurred ---------------------------------*/
    if (((isr_flags & LL_USART_ISR_RTOF) != 0U) && ((cr1_its & LL_USART_CR1_RTOIE) != 0U)
        && (reception_type != HAL_UART_RX_TO_RTO))
    {
      LL_USART_ClearFlag_RTO(p_uartx);

      error_code |= HAL_UART_RECEIVE_ERROR_RTO;
    }

    /* Call UART Error callback function if need be ----------------------------*/
    if (error_code != 0U)
    {
#if defined (USE_HAL_UART_GET_LAST_ERRORS) && (USE_HAL_UART_GET_LAST_ERRORS == 1)
      huart->last_reception_error_codes = error_code;
#endif /* USE_HAL_UART_GET_LAST_ERRORS */
      /* UART in mode Receiver --------------------------------------------------*/
      if (((isr_flags & LL_USART_ISR_RXNE_RXFNE) != 0U)
          && (((cr1_its & LL_USART_CR1_RXNEIE_RXFNEIE) != 0U)
              || ((cr3_its & LL_USART_CR3_RXFTIE) != 0U)))
      {
        if (huart->p_rx_isr != NULL)
        {
          huart->p_rx_isr(huart);
        }
      }

      /* If Error is to be considered as blocking :
          - Receiver Timeout error in Reception
          - Overrun error in Reception
          - any error occurs in DMA mode reception
      */
      if ((LL_USART_IsEnabledDMAReq_RX(p_uartx) != 0U)
          || ((uint32_t)(error_code & (HAL_UART_RECEIVE_ERROR_RTO | HAL_UART_RECEIVE_ERROR_ORE)) != 0U))
      {
        /* Blocking error : transfer is aborted
           Set the UART state ready to be able to start again the process,
           Disable Rx Interrupts, and disable Rx DMA request, if ongoing */
        UART_EndRxTransfer(huart);

#if defined (USE_HAL_UART_DMA) && (USE_HAL_UART_DMA == 1)
        if (LL_USART_IsEnabledDMAReq_RX(p_uartx) != 0U)
        {
          LL_USART_DisableDMAReq_RX(p_uartx);
          /* Abort the UART DMA Rx channel */
          if (huart->hdma_rx != NULL)
          {
            /* Set the UART DMA Abort callback :
                will lead to call HAL_UART_ErrorCallback() at end of DMA abort procedure */
            huart->hdma_rx->p_xfer_abort_cb = UART_DMAAbortOnError;

            if (HAL_DMA_Abort_IT(huart->hdma_rx) != HAL_OK)
            {
              /* Call Directly huart->hdmarx->p_xfer_abort_cb function in case of error */
              huart->hdma_rx->p_xfer_abort_cb(huart->hdma_rx);
            }
          }
          else
          {
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
            huart->p_error_callback(huart);
#else
            HAL_UART_ErrorCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */

          }
        }
        else
#endif /* USE_HAL_UART_DMA */
        {
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
          huart->p_error_callback(huart);
#else
          HAL_UART_ErrorCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
        }
      }
      else
      {
        /* Non-blocking error: transfer can continue.
           Error is notified to the user through the error callback. */
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
        huart->p_error_callback(huart);
#else
        HAL_UART_ErrorCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
      }
    }
    return;
  } /* End if some error occurs */

  if (reception_type != HAL_UART_RX_STANDARD)
  {
    hal_uart_rx_event_types_t rx_type = HAL_UART_RX_EVENT_TC;
    uint32_t it_to_clear = 0U;

    if ((reception_type == HAL_UART_RX_TO_IDLE)
        && ((isr_flags & LL_USART_ISR_IDLE) != 0U)
        && ((cr1_its & LL_USART_CR1_IDLEIE) != 0U))
    {
      rx_type = HAL_UART_RX_EVENT_IDLE;
      it_to_clear = LL_USART_CR1_IDLEIE;
      LL_USART_ClearFlag_IDLE(p_uartx);
    }
    else if ((reception_type == HAL_UART_RX_TO_RTO)
             && ((isr_flags & LL_USART_ISR_RTOF) != 0U)
             && ((cr1_its & LL_USART_CR1_RTOIE) != 0U))
    {
      rx_type = HAL_UART_RX_EVENT_RTO;
      it_to_clear = LL_USART_CR1_RTOIE;
      LL_USART_ClearFlag_RTO(p_uartx);
    }
    else if ((reception_type == HAL_UART_RX_TO_CHAR_MATCH)
             && ((isr_flags & LL_USART_ISR_CMF) != 0U)
             && ((cr1_its & LL_USART_CR1_CMIE) != 0U))
    {
      rx_type = HAL_UART_RX_EVENT_CHAR_MATCH;
      it_to_clear = LL_USART_CR1_CMIE;
      LL_USART_ClearFlag_CM(p_uartx);
    }
    else
    {
      /* do nothing */
    }
    if (rx_type != HAL_UART_RX_EVENT_TC)
    {
#if defined (USE_HAL_UART_DMA) && (USE_HAL_UART_DMA == 1)
      if (LL_USART_IsEnabledDMAReq_RX(p_uartx) != 0U)
      {
        uint32_t nb_remaining_rx_data =
          LL_DMA_GetBlkDataLength((DMA_Channel_TypeDef *)(uint32_t)huart->hdma_rx->instance);
        uint32_t rx_size = huart->rx_xfer_size;
        huart->rx_xfer_count = nb_remaining_rx_data;
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
        if (huart->hdma_rx->xfer_mode == HAL_DMA_XFER_MODE_DIRECT)
#endif /* USE_HAL_DMA_LINKEDLIST */
        {
          /* DMA mode enabled */
          /* Check received length : If all expected data are received, do nothing,
            (DMA cplt callback will be called).
            Otherwise, if at least one data has already been received, IDLE/CM/RTO events are to be notified to user */

