MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
          if ((nb_remaining_rx_data > 0U)
              && (nb_remaining_rx_data < rx_size))
          {
            /* Disable PE and ERR (Frame error, noise error, overrun error) interrupts */
            LL_USART_DisableIT_PE(p_uartx);
            LL_USART_DisableIT_ERROR(p_uartx);

            /* Disable the DMA transfer for the receiver request by resetting the DMAR bit
              in the UART CR3 register */
            LL_USART_DisableDMAReq_RX(p_uartx);

            LL_USART_DisableIT_CR1(p_uartx, it_to_clear);

            huart->hdma_rx->p_xfer_abort_cb = UART_DMAAbortOnSuccessCallback;
            /* Last bytes received, so no need as the abort is immediate */
            (void)HAL_DMA_Abort_IT(huart->hdma_rx);
          }
          return;
        }
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
        else
        {
          if ((nb_remaining_rx_data > 0U) && (nb_remaining_rx_data < rx_size))
          {
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
            huart->p_rx_cplt_callback(huart, (rx_size - nb_remaining_rx_data), rx_type);
#else
            HAL_UART_RxCpltCallback(huart, (rx_size - nb_remaining_rx_data), rx_type);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
            return;
          }
        }
#endif /* USE_HAL_DMA_LINKEDLIST */
      }
      else
#endif /* USE_HAL_UART_DMA */
      {
        /* DMA mode not enabled */
        /* Check received length : If all expected data are received, do nothing.
          Otherwise, if at least one data has already been received, IDLE event is to be notified to user */
        uint32_t rx_size = huart->rx_xfer_size;
        uint16_t nb_rx_data = (uint16_t)(rx_size - huart->rx_xfer_count);
        if ((huart->rx_xfer_count > 0U) && (nb_rx_data > 0U))
        {
          /* Disable the UART Parity Error Interrupt and RXNE interrupts */
          LL_USART_DisableIT_CR1(p_uartx, (USART_CR1_RXNEIE_RXFNEIE | USART_CR1_PEIE));

          /* Disable the UART Error Interrupt(Frame, noise, overrun) and RX FIFO Threshold interrupt */
          LL_USART_DisableIT_CR3(p_uartx, (USART_CR3_EIE | USART_CR3_RXFTIE));

          huart->reception_type = HAL_UART_RX_STANDARD;

          huart->p_rx_isr = NULL;

          LL_USART_DisableIT_CR1(p_uartx, it_to_clear);

#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
          huart->p_rx_cplt_callback(huart, nb_rx_data, rx_type);
#else
          HAL_UART_RxCpltCallback(huart, nb_rx_data, rx_type);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
          huart->rx_state = HAL_UART_RX_STATE_IDLE;
        }
        return;
      }
    }
  }

  /* UART wakeup from Stop mode interrupt occurred. ---------------------------*/
  if (((isr_flags & LL_USART_ISR_WUF) != 0U) && ((cr3_its & LL_USART_CR3_WUFIE) != 0U))
  {
    LL_USART_ClearFlag_WKUP(p_uartx);

    /* UART Rx state is not reset as a reception process might be ongoing.
       If UART handle state fields need to be reset to READY, do this in the wakeup callback. */

#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    huart->p_wakeup_callback(huart);
#else
    HAL_UART_WakeupCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
    return;
  }

  /* UART in mode Transmitter ------------------------------------------------*/
  if (((isr_flags & LL_USART_ISR_TXE_TXFNF) != 0U)
      && (((cr1_its & LL_USART_CR1_TXEIE_TXFNFIE) != 0U)
          || ((cr3_its & LL_USART_CR3_TXFTIE) != 0U)))
  {
    if (huart->p_tx_isr != NULL)
    {
      huart->p_tx_isr(huart);
    }
    return;
  }

  /* UART in mode Transmitter (transmission end) -----------------------------*/
  if (((isr_flags & LL_USART_ISR_TC) != 0U) && ((cr1_its & LL_USART_CR1_TCIE) != 0U))
  {
    UART_EndTransmit_IT(huart);
    return;
  }

  /* UART TX FIFO Empty occurred ----------------------------------------------*/
  if (((isr_flags & LL_USART_ISR_TXFE) != 0U) && ((cr1_its & LL_USART_CR1_TXFEIE) != 0U))
  {
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    huart->p_tx_fifo_empty_callback(huart);
#else
    HAL_UART_TxFifoEmptyCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
    return;
  }

  /* UART RX FIFO Full occurred ----------------------------------------------*/
  if (((isr_flags & LL_USART_ISR_RXFF) != 0U) && ((cr1_its & LL_USART_CR1_RXFFIE) != 0U))
  {
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    huart->p_rx_fifo_full_callback(huart);
#else
    HAL_UART_RxFifoFullCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
    return;
  }
  /* UART CTS occurred ----------------------------------------------*/
  if (((isr_flags & LL_USART_ISR_CTSIF) != 0U) && ((cr3_its & LL_USART_CR3_CTSIE) != 0U))
  {
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    huart->p_clear_to_send_callback(huart);
#else
    HAL_UART_ClearToSendCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
    return;
  }
  /* UART LIN break occurred ----------------------------------------------*/
  if (((isr_flags & LL_USART_ISR_LBDF) != 0U) && ((cr2_its & LL_USART_CR2_LBDIE) != 0U))
  {
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    huart->p_lin_break_callback(huart);
#else
    HAL_UART_LINBreakCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
    return;
  }
}
/**
  * @}
  */

/** @addtogroup UART_Exported_Functions_Group13
  * @{
  This subsection provides a set of functions to use advanced I/O operations on the USARTx
  instance in asynchronous modes.
  Before using advanced I/O operations, configure the instance in asynchronous
  mode with HAL_UART_SetConfig().

  Three specific reception methods are provided:
    - Receive until Idle event is received or specified amount of data is received:
      - HAL_UART_ReceiveToIdle(): in polling mode
      - HAL_UART_ReceiveToIdle_IT(): in interrupt mode
      - HAL_UART_ReceiveToIdle_IT_Opt(): in interrupt mode, with optional interrupt selection
      - HAL_UART_ReceiveToIdle_DMA(): in DMA mode
      - HAL_UART_ReceiveToIdle_DMA_Opt(): in DMA mode, with Optional interrupts selection

    - Receive until Timeout (TMO) event is received or specified amount of data is received:
      - HAL_UART_ReceiveUntilTMO(): in polling mode
      - HAL_UART_ReceiveUntilTMO_IT(): in interrupt mode
      - HAL_UART_ReceiveUntilTMO_IT_Opt(): in interrupt mode, with optional interrupt selection
      - HAL_UART_ReceiveUntilTMO_DMA(): in DMA mode
      - HAL_UART_ReceiveUntilTMO_DMA_Opt(): in DMA mode, with optional interrupt selection

    - Receive until Character Match (CM) event is received or specified amount of data is received:
      - HAL_UART_ReceiveUntilCM(): in polling mode
      - HAL_UART_ReceiveUntilCM_IT(): in interrupt mode
      - HAL_UART_ReceiveUntilCM_IT()_Opt: in interrupt mode, with optional interrupt selection
      - HAL_UART_ReceiveUntilCM_DMA(): in DMA mode
      - HAL_UART_ReceiveUntilCM_DMA_Opt(): in DMA mode, with optional interrupt selection

  To send break character in LIN mode:
    - HAL_UART_SendLINBreak()

  To send a specific request:
    - HAL_UART_SendRequest()

