MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
  A set of Transfer Complete Callbacks are provided in non-blocking mode (IT and DMA):
    - HAL_UART_RxHalfCpltCallback()
    - HAL_UART_RxCpltCallback()
    - HAL_UART_ErrorCallback()

  Abort non-blocking mode transfers using the Abort APIs:
    - HAL_UART_Abort()
    - HAL_UART_AbortReceive()
    - HAL_UART_Abort_IT()
    - HAL_UART_AbortReceive_IT()

  For abort services based on interrupts (HAL_UART_Abortxxx_IT), a set of Abort Complete callbacks are provided:
    - HAL_UART_AbortCpltCallback()
    - HAL_UART_AbortReceiveCpltCallback()

  In non-blocking mode transfers, possible errors are split into two categories:
    - Error is considered recoverable and non-blocking: Transfer can run to completion, but error severity is
      to be evaluated by the user. This concerns Frame Error, Parity Error, or Noise Error
      in interrupt mode reception.
      The received character is then retrieved and stored in the Rx buffer, the error code is set to allow the user
      to identify the error type, and the HAL_UART_ErrorCallback() user callback is executed.
      Transfer remains ongoing on the UART side.
      If you want to abort it, call the Abort services.
    - Error is considered blocking: Transfer cannot be completed properly and is aborted.
      This concerns Overrun Error in interrupt mode reception and all errors in DMA mode.
      The error code is set to allow the user to identify the error type, and the HAL_UART_ErrorCallback()
      user callback is executed.

  In Half Duplex communication, do not run the transmit and receive process in parallel.
  */

/**
  * @brief Send Break Character on the line.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval HAL_OK The Break has been sent.
  * @retval HAL_BUSY Concurrent process ongoing.
  */
hal_status_t HAL_UART_SendLINBreak(hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(IS_UART_LIN_INSTANCE(p_uartx));
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  LL_USART_RequestBreakSending(p_uartx);

  return HAL_OK;
}

/**
  * @brief Send specific UART request.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param request request type to process.
  * @retval HAL_OK The request has been sent.
  * @retval HAL_BUSY Concurrent process ongoing.
  */
hal_status_t HAL_UART_SendRequest(hal_uart_handle_t *huart, hal_uart_request_t request)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);

  ASSERT_DBG_PARAM(IS_UART_REQUEST_PARAMETER(request));
  ASSERT_DBG_PARAM(!IS_LPUART_INSTANCE(p_uartx) || (request != HAL_UART_REQUEST_AUTO_BAUD_RATE));
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  LL_USART_SetRequest(p_uartx, (uint32_t)request);

  return HAL_OK;
}

/**
  * @brief Receive an amount of data in blocking mode till either the expected number of data
  *        is received or an IDLE event occurs.
  * @param huart              Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param p_data             Pointer to data buffer (uint8_t or uint16_t data elements).
  * @param size_byte          Amount of data elements (uint8_t or uint16_t) to be received.
  * @param p_rx_size_byte     Pointer to the number of data elements finally received
  *                           (could be lower than size, in case reception ends on IDLE event).
  * @param timeout_ms         Timeout duration expressed in ms (covers the whole reception sequence).
  * @note  OK is returned if reception is completed (expected number of data has been received)
  *        or if reception is stopped after IDLE event (less than the expected number of data has been received)
  *        In this case, p_rx_size_byte output parameter indicates number of data available in reception buffer.
  * @warning When UART parity is not enabled (PCE bit from the CR1 register = 0), and Word Length is configured to
  *          9 bits (M1-M0 from the CR1 register = 01), the received data is handled as a set of uint16_t.
  *          In this case, size must indicate the number of uint16_t available through p_data.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_TIMEOUT       Operation exceeds user timeout.
  * @retval HAL_ERROR         Error during instance enabling.
  */
hal_status_t HAL_UART_ReceiveToIdle(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte,
                                    uint32_t *p_rx_size_byte, uint32_t timeout_ms)
{
  hal_status_t status;

  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0);
  ASSERT_DBG_PARAM(p_rx_size_byte != 0);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(huart, rx_state, HAL_UART_RX_STATE_IDLE, HAL_UART_RX_STATE_ACTIVE);

  status = UART_Start_Receive_Polling(huart, p_data, size_byte, p_rx_size_byte, timeout_ms, HAL_UART_RX_TO_IDLE);

  huart->rx_state = HAL_UART_RX_STATE_IDLE;
  return status;
}

/**
  * @brief Receive an amount of data in interrupt mode till either the expected number of data
  *        is received or an IDLE event occurs.
  * @param huart              Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param p_data             Pointer to data buffer (uint8_t or uint16_t data elements).
  * @param size_byte          Amount of data elements (uint8_t or uint16_t) to be received.
  * @note  Reception is initiated by this function call. Further progress of reception is achieved thanks
  *        to UART interrupts raised by RXNE and IDLE events. Callback is called at end of reception indicating
  *        number of received data elements.
  * @warning When UART parity is not enabled (PCE bit from the CR1 register = 0), and Word Length is configured to
  *          9 bits (M1-M0 from the CR1 register = 01), the received data is handled as a set of uint16_t.
  *          In this case, size must indicate the number of uint16_t available through p_data.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_ERROR         Error during instance enabling.
  */
hal_status_t HAL_UART_ReceiveToIdle_IT(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte)
{
  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0);

