MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(huart, rx_state, HAL_UART_RX_STATE_IDLE, HAL_UART_RX_STATE_ACTIVE);


  huart->reception_type = HAL_UART_RX_TO_RTO;

  LL_USART_SetRxTimeout(p_uartx, char_timeout_bit);
  LL_USART_EnableRxTimeout(p_uartx);

  return UART_Start_Receive_IT(huart, (uint8_t *)p_data, size_byte, HAL_UART_RX_TO_RTO, interrupts);
}

#if defined (USE_HAL_UART_DMA) && (USE_HAL_UART_DMA == 1)
/**
  * @brief Receive an amount of data in DMA mode till the timeout(TMO) expires or an amount of data is received.
  * @param huart              Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param p_data             Pointer to data buffer.
  * @param size_byte          Amount of data elements to be received.
  * @param char_timeout_bit   Timeout duration expressed in bit.
  * @note  Reception is initiated by this function call. Further progress of reception is achieved thanks
  *        to DMA services, transferring automatically received data elements in user reception buffer and
  *        calling registered callbacks at half/end of reception. UART IDLE events are also used to consider
  *        reception phase as ended. In all cases, callback execution will indicate number of received data elements.
  * @note This feature is not available for LPUART instances.
  * @warning When the UART parity is enabled (PCE bit from the CR1 register = 1), the received data contain
  *          the parity bit (MSB position).
  * @warning When UART parity is not enabled (PCE bit from the CR1 register = 0), and Word Length is configured to
  *          9 bits (M1-M0 from the CR1 register = 01), the received data is handled as a set of uint16_t.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_ERROR         DMA handler not set or Error during instance enabling.
  */
hal_status_t HAL_UART_ReceiveUntilTMO_DMA(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte,
                                          uint32_t char_timeout_bit)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(!IS_LPUART_INSTANCE(p_uartx));
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0);
  ASSERT_DBG_PARAM(IS_UART_RECEIVER_TIMEOUT_VALUE(char_timeout_bit));
  ASSERT_DBG_PARAM(huart->hdma_rx != NULL);
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(huart, rx_state, HAL_UART_RX_STATE_IDLE, HAL_UART_RX_STATE_ACTIVE);

  huart->reception_type = HAL_UART_RX_TO_RTO;

  LL_USART_SetRxTimeout(p_uartx, char_timeout_bit);
  LL_USART_EnableRxTimeout(p_uartx);

  return (UART_Start_Receive_DMA(huart, (uint8_t *)p_data, size_byte, HAL_UART_RX_TO_RTO,
                                 HAL_UART_OPT_DMA_RX_IT_HT));
}

/**
  * @brief Receive an amount of data in DMA mode till the timeout(TMO) expires or an amount of data is received,
  *        with optional interrupts selection. Allows the user to enable optional interrupts part of
  *        \ref UART_Receive_DMA_Optional_Interrupts.
  * @param huart              Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param p_data             Pointer to data buffer.
  * @param size_byte          Amount of data elements to be received.
  * @param char_timeout_bit   Timeout duration expressed in bit.
  * @param interrupts         Optional interrupts part of \ref UART_Receive_DMA_Optional_Interrupts.
  * @note  Reception is initiated by this function call. Further progress of reception is achieved thanks
  *        to DMA services, transferring automatically received data elements in user reception buffer and
  *        calling registered callbacks at half/end of reception. UART IDLE events are also used to consider
  *        reception phase as ended. In all cases, callback execution will indicate number of received data elements.
  * @note This feature is not available for LPUART instances.
  * @warning When the UART parity is enabled (PCE bit from the CR1 register = 1), the received data contain
  *          the parity bit (MSB position).
  * @warning When UART parity is not enabled (PCE bit from the CR1 register = 0), and Word Length is configured to
  *          9 bits (M1-M0 from the CR1 register = 01), the received data is handled as a set of uint16_t.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_ERROR         DMA handler not set or Error during instance enabling.
  */
hal_status_t HAL_UART_ReceiveUntilTMO_DMA_Opt(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte,
                                              uint32_t char_timeout_bit, uint32_t interrupts)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM(huart != NULL);
  p_uartx = UART_GET_INSTANCE(huart);
  ASSERT_DBG_PARAM(!IS_LPUART_INSTANCE(p_uartx));
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0);
  ASSERT_DBG_PARAM(IS_UART_RECEIVER_TIMEOUT_VALUE(char_timeout_bit));
  ASSERT_DBG_PARAM(IS_UART_OPT_RX_DMA(interrupts));
  ASSERT_DBG_PARAM(huart->hdma_rx != NULL);
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  ASSERT_DBG_PARAM(IS_UART_DMA_RX_VALID_SILENT_MODE(huart->hdma_rx, interrupts));
#endif /* USE_HAL_DMA_LINKEDLIST */

