MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(huart, rx_state, HAL_UART_RX_STATE_IDLE, HAL_UART_RX_STATE_ACTIVE);

  huart->reception_type = HAL_UART_RX_TO_RTO;

  LL_USART_SetRxTimeout(p_uartx, char_timeout_bit);
  LL_USART_EnableRxTimeout(p_uartx);

  return (UART_Start_Receive_DMA(huart, (uint8_t *)p_data, size_byte, HAL_UART_RX_TO_RTO,
                                 interrupts));
}

#endif /* USE_HAL_UART_DMA */

/**
  * @brief Receive an amount of data in blocking mode till the character passed in parameters match
  *        the received sequence or an amount of data is received.
  *        In this case, p_rx_size_byte output parameter indicates number of data available in reception buffer.
  * @param huart              Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param p_data             Pointer to data buffer.
  * @param size_byte          Amount of data elements to be received.
  * @param character          Character to match in the received sequence.
  * @param p_rx_size_byte     Pointer to the number of data elements finally received.
  * @param timeout_ms         Timeout duration expressed in ms (covers the whole reception sequence).
  * @warning When UART parity is not enabled (PCE bit from the CR1 register = 0), and Word Length is configured to
  *          9 bits (M1-M0 from the CR1 register = 01), the received data is handled as a set of uint16_t.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_TIMEOUT       Operation exceeds user timeout.
  * @retval HAL_ERROR         Error during instance enabling.
  */
hal_status_t HAL_UART_ReceiveUntilCM(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte,
                                     uint8_t character, uint32_t *p_rx_size_byte, uint32_t timeout_ms)
{
  hal_status_t status;
  USART_TypeDef *p_uartx;
  hal_uart_parity_t parity;

  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0);
  ASSERT_DBG_PARAM(p_rx_size_byte != NULL);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  p_uartx = UART_GET_INSTANCE(huart);

  ASSERT_DBG_PARAM(LL_USART_IsEnabledMuteMode(p_uartx) == 0U);
  ASSERT_DBG_PARAM(LL_USART_GetDataWidth(p_uartx) != LL_USART_DATAWIDTH_9_BIT);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(huart, rx_state, HAL_UART_RX_STATE_IDLE, HAL_UART_RX_STATE_ACTIVE);
  parity = (hal_uart_parity_t)LL_USART_GetParity(p_uartx);
  if (parity != HAL_UART_PARITY_NONE)
  {
    UART_Parity_Computation(huart, &character);
  }

  UART_ENSURE_INSTANCE_DISABLED(p_uartx);
  LL_USART_SetNodeAddress(p_uartx, (uint32_t)character);
  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  status = UART_Start_Receive_Polling(huart, p_data, size_byte, p_rx_size_byte, timeout_ms,
                                      HAL_UART_RX_TO_CHAR_MATCH);

  huart->rx_state = HAL_UART_RX_STATE_IDLE;

  return status;
}

/**
  * @brief Receive an amount of data in interrupt mode till the character passed in parameters match
  *        the received sequence or an amount of data is received.
  * @param huart      Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param p_data     Pointer to data buffer.
  * @param size_byte  Amount of data elements to be received.
  * @param character  Character to match in the received sequence.
  * @note  Reception is initiated by this function call. Further progress of reception is achieved thanks
  *        to UART interrupts raised by RXNE and IDLE events. Callback is called at end of reception indicating
  *        number of received data elements.
  * @warning When UART parity is not enabled (PCE bit from the CR1 register = 0), and Word Length is configured to
  *          9 bits (M1-M0 from the CR1 register = 01), the received data is handled as a set of uint16_t.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_BUSY          Concurrent process ongoing.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_ERROR         Error during instance enabling.
  */
hal_status_t HAL_UART_ReceiveUntilCM_IT(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte,
                                        uint8_t character)
{
  USART_TypeDef *p_uartx;
  hal_uart_parity_t parity;

  ASSERT_DBG_PARAM(huart != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_byte != 0);

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);

  p_uartx = UART_GET_INSTANCE(huart);

  ASSERT_DBG_PARAM(LL_USART_IsEnabledMuteMode(p_uartx) == 0U);
  ASSERT_DBG_PARAM(LL_USART_GetDataWidth(p_uartx) != LL_USART_DATAWIDTH_9_BIT);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(huart, rx_state, HAL_UART_RX_STATE_IDLE, HAL_UART_RX_STATE_ACTIVE);


  huart->reception_type = HAL_UART_RX_TO_CHAR_MATCH;
  parity = (hal_uart_parity_t)LL_USART_GetParity(p_uartx);
  if (parity != HAL_UART_PARITY_NONE)
  {
    UART_Parity_Computation(huart, &character);
  }
  UART_ENSURE_INSTANCE_DISABLED(p_uartx);
  LL_USART_SetNodeAddress(p_uartx, (uint32_t)character);
  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

