MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);
  ASSERT_DBG_STATE(huart->rx_state, HAL_UART_RX_STATE_IDLE);
  ASSERT_DBG_STATE(huart->tx_state, HAL_UART_TX_STATE_IDLE);

  p_uartx = UART_GET_INSTANCE(huart);

  ASSERT_DBG_PARAM(LL_USART_IsEnabledMuteMode(p_uartx) == 0U);
  ASSERT_DBG_PARAM(LL_USART_GetDataWidth(p_uartx) != LL_USART_DATAWIDTH_9_BIT);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_data == NULL) || (size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(huart, rx_state, HAL_UART_RX_STATE_IDLE, HAL_UART_RX_STATE_ACTIVE);

  huart->reception_type = HAL_UART_RX_TO_CHAR_MATCH;

  parity = (hal_uart_parity_t)LL_USART_GetParity(p_uartx);
  if (parity != HAL_UART_PARITY_NONE)
  {
    UART_Parity_Computation(huart, &character);
  }
  UART_ENSURE_INSTANCE_DISABLED(p_uartx);
  LL_USART_SetNodeAddress(p_uartx, (uint32_t)character);
  UART_ENSURE_INSTANCE_ENABLED(p_uartx);

  return (UART_Start_Receive_DMA(huart, (uint8_t *)p_data, size_byte, HAL_UART_RX_TO_CHAR_MATCH,
                                 interrupts));
}

/**
  * @}
  */

#endif /* USE_HAL_UART_DMA */
/** @addtogroup UART_Exported_Functions_Group14
  * @{
  This subsection provides functions to read the current frequency, state, and last error codes
  of the USARTx in asynchronous mode:

    - HAL_UART_GetClockFreq(): Return the current clock frequency of the UART peripheral.
    - HAL_UART_GetState(): Return the UART handle state.
    - HAL_UART_GetTxState(): Return the HAL UART Tx process state.
    - HAL_UART_GetRxState(): Return the HAL UART Rx process state.
    - HAL_UART_GetLastErrorCodes(): Return the last error of the UART handle.
  */

/** @brief  Return the peripheral clock frequency for UART.
  * @param  huart Pointer to a \ref hal_uart_handle_t structure that contains
  *               the configuration information for UART module.
  * @retval uint32_t Frequency in Hz.
  * @retval 0 source clock of the huart not configured or not ready.
  */
uint32_t HAL_UART_GetClockFreq(const hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  ASSERT_DBG_PARAM((huart != NULL));

  ASSERT_DBG_STATE(huart->global_state, HAL_UART_STATE_CONFIGURED);

  p_uartx = UART_GET_INSTANCE(huart);

  return HAL_RCC_UART_GetKernelClkFreq(p_uartx);
}

/**
  * @brief Return the UART handle state.
  * @param  huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval hal_uart_state_t UART state
  */
hal_uart_state_t HAL_UART_GetState(const hal_uart_handle_t *huart)
{
  ASSERT_DBG_PARAM(huart != NULL);

  return huart->global_state;
}

/**
  * @brief Return the HAL UART Tx process state.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval hal_uart_tx_state_t UART Tx process state
  */
hal_uart_tx_state_t HAL_UART_GetTxState(const hal_uart_handle_t *huart)
{
  ASSERT_DBG_PARAM(huart != NULL);

  return huart->tx_state;
}

/**
  * @brief  Return the HAL UART Rx process state.
  * @param  huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval hal_uart_rx_state_t UART Rx process state
  */
hal_uart_rx_state_t HAL_UART_GetRxState(const hal_uart_handle_t *huart)
{
  ASSERT_DBG_PARAM(huart != NULL);

  return huart->rx_state;
}

/**
  * @brief  Return the UART last errors.
  * @param  huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval Current last error codes.
  */
#if defined (USE_HAL_UART_GET_LAST_ERRORS) && (USE_HAL_UART_GET_LAST_ERRORS == 1)
uint32_t HAL_UART_GetLastErrorCodes(const hal_uart_handle_t *huart)
{
  uint32_t tmp;

  ASSERT_DBG_PARAM(huart != NULL);

  tmp = huart->last_reception_error_codes;
  return (huart->last_transmission_error_codes | tmp);
}
#endif /* USE_HAL_UART_GET_LAST_ERRORS */

/**
  * @}
  */
#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
/** @addtogroup UART_Exported_Functions_Group15
  * @{
  This subsection provides functions to control the bus of the USARTx instance:
    - HAL_UART_AcquireBus(): Acquire the bus
    - HAL_UART_ReleaseBus(): Release the bus.

  For multi-task applications, use the bus operation functions to avoid race conditions.
  */
/**
  * @brief  Acquire the current instance bus.
  * @param  huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param  timeout_ms Timeout in milliseconds for the Acquire to expire.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR Operation completed with error.
  */
hal_status_t HAL_UART_AcquireBus(hal_uart_handle_t *huart, uint32_t timeout_ms)
{
  hal_status_t status;

  ASSERT_DBG_PARAM((huart != NULL));

  status = HAL_ERROR;

  if (HAL_OS_SemaphoreTake(&huart->semaphore, timeout_ms) == HAL_OS_OK)
  {
    status = HAL_OK;
  }

  return status;
}

/**
  * @brief  Release the current instance bus.
  * @param  huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval HAL_OK Operation completed successfully.
  * @retval HAL_ERROR Operation completed with error.
  */
hal_status_t HAL_UART_ReleaseBus(hal_uart_handle_t *huart)
{
  hal_status_t status;

  ASSERT_DBG_PARAM((huart != NULL));

  status = HAL_ERROR;

  if (HAL_OS_SemaphoreRelease(&huart->semaphore) == HAL_OS_OK)
  {
    status = HAL_OK;
  }

  return status;
}

/**
  * @}
  */
#endif /*USE_HAL_MUTEX */
#if defined (USE_HAL_UART_USER_DATA) && (USE_HAL_UART_USER_DATA == 1)

/** @addtogroup UART_Exported_Functions_Group16
  * @{
  This subsection provides functions to set user-specific data for a USARTx instance:
    - HAL_UART_SetUserData(): Set user data in the handler.
    - HAL_UART_GetUserData(): Get user data from the handler.
  */

/**
  * @brief Store the user data pointer into the handle.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param p_user_data Pointer to the user data.
  */
void HAL_UART_SetUserData(hal_uart_handle_t *huart, const void *p_user_data)
{
  ASSERT_DBG_PARAM(huart != NULL);

