MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
  huart->p_user_data = p_user_data;
}

/**
  * @brief Retrieve the user data pointer from the handle.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval Pointer to the user data.
  */
const void *HAL_UART_GetUserData(const hal_uart_handle_t *huart)
{
  ASSERT_DBG_PARAM(huart != NULL);

  return (huart->p_user_data);
}

/**
  * @}
  */
#endif /* USE_HAL_UART_USER_DATA */

/** @addtogroup UART_Exported_Functions_Group18
  * @{
  This subsection provides the default weak callbacks of the USARTx instance.
  Refer to HAL_UART_IRQHandler() documentation to get the details of which callback is triggered for each process
  function. Refer to the "How to use the UART HAL module driver" section to find the association between
  callbacks, registration functions, and default callback values.
  */
/**
  * @brief Tx Transfer completed callback.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  */
__WEAK void HAL_UART_TxCpltCallback(hal_uart_handle_t *huart)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(huart);

  /** @warning This function must not be modified. When the callback is needed,
               the HAL_UART_TxCpltCallback can be implemented in the user file.
   */
}

/**
  * @brief Tx Half Transfer completed callback.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  */
__WEAK void HAL_UART_TxHalfCpltCallback(hal_uart_handle_t *huart)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(huart);

  /** @warning This function must not be modified. When the callback is needed,
               the HAL_UART_TxHalfCpltCallback can be implemented in the user file.
   */
}

/**
  * @brief Rx Transfer completed callback.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param size_byte Number of bytes received.
  * @param rx_event Event that triggered the callback.
  */
__WEAK void HAL_UART_RxCpltCallback(hal_uart_handle_t *huart, uint32_t size_byte, hal_uart_rx_event_types_t rx_event)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(huart);
  STM32_UNUSED(size_byte);
  STM32_UNUSED(rx_event);

  /** @warning This function must not be modified. When the callback is needed,
               the HAL_UART_RxCpltCallback can be implemented in the user file.
   */
}

/**
  * @brief Rx Half Transfer completed callback.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  */
__WEAK void HAL_UART_RxHalfCpltCallback(hal_uart_handle_t *huart)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(huart);

  /** @warning This function must not be modified. When the callback is needed,
               the HAL_UART_RxHalfCpltCallback can be implemented in the user file.
   */
}

/**
  * @brief UART error callback.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  */
__WEAK void HAL_UART_ErrorCallback(hal_uart_handle_t *huart)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(huart);

  /** @warning This function must not be modified. When the callback is needed,
               the HAL_UART_ErrorCallback can be implemented in the user file.
   */
}

/**
  * @brief UART Abort Complete callback.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  */
__WEAK void HAL_UART_AbortCpltCallback(hal_uart_handle_t *huart)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(huart);

  /** @warning This function must not be modified. When the callback is needed,
               the HAL_UART_AbortCpltCallback can be implemented in the user file.
   */
}

/**
  * @brief UART Abort Transmit Complete callback.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  */
__WEAK void HAL_UART_AbortTransmitCpltCallback(hal_uart_handle_t *huart)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(huart);

  /** @warning This function must not be modified. When the callback is needed,
               the HAL_UART_AbortTransmitCpltCallback can be implemented in the user file.
   */
}

/**
  * @brief UART Abort Receive Complete callback.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  */
__WEAK void HAL_UART_AbortReceiveCpltCallback(hal_uart_handle_t *huart)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(huart);

  /** @warning This function must not be modified. When the callback is needed,
               the HAL_UART_AbortReceiveCpltCallback can be implemented in the user file.
   */
}

/**
  * @brief UART wakeup from Stop mode callback.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  */
__WEAK void HAL_UART_WakeupCallback(hal_uart_handle_t *huart)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(huart);

  /** @warning This function must not be modified. When the callback is needed,
               the HAL_UART_WakeupCallback can be implemented in the user file.
   */
}

/**
  * @brief UART Rx FIFO full callback.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  */
__WEAK void HAL_UART_RxFifoFullCallback(hal_uart_handle_t *huart)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(huart);

  /** @warning This function must not be modified. When the callback is needed,
               the HAL_UART_RxFifoFullCallback can be implemented in the user file.
   */
}

/**
  * @brief UART Tx FIFO empty callback.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  */
__WEAK void HAL_UART_TxFifoEmptyCallback(hal_uart_handle_t *huart)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(huart);

  /** @warning This function must not be modified. When the callback is needed,
               the HAL_UART_TxFifoEmptyCallback can be implemented in the user file.
   */
}

/**
  * @brief UART LIN break callback.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  */
__WEAK void HAL_UART_LINBreakCallback(hal_uart_handle_t *huart)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(huart);

  /** @warning This function must not be modified. When the callback is needed,
               the HAL_UART_LINBreakCallback can be implemented in the user file.
   */
}

/**
  * @brief UART Clear to send callback.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  */
__WEAK void HAL_UART_ClearToSendCallback(hal_uart_handle_t *huart)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(huart);

  /** @warning This function must not be modified. When the callback is needed,
               the HAL_UART_ClearToSendCallback can be implemented in the user file.
   */
}

/**
  * @}
  */
/**
  * @}
  */
/** @addtogroup UART_Private_Functions UART Private Functions
  * @{
  */

