MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
/**
  * @brief Initialize the callbacks to their default values.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  */
void UART_InitCallbacksToDefault(hal_uart_handle_t *huart)
{
  /* Init the UART Callback settings */
  huart->p_tx_half_cplt_callback        = HAL_UART_TxHalfCpltCallback;       /* Legacy weak TxHalfCpltCallback        */
  huart->p_tx_cplt_callback             = HAL_UART_TxCpltCallback;           /* Legacy weak TxCpltCallback            */
  huart->p_rx_half_cplt_callback        = HAL_UART_RxHalfCpltCallback;       /* Legacy weak RxHalfCpltCallback        */
  huart->p_rx_cplt_callback             = HAL_UART_RxCpltCallback;           /* Legacy weak RxCpltCallback            */
  huart->p_error_callback               = HAL_UART_ErrorCallback;            /* Legacy weak ErrorCallback             */
  huart->p_abort_cplt_callback          = HAL_UART_AbortCpltCallback;        /* Legacy weak AbortCpltCallback         */
  huart->p_abort_transmit_cplt_callback = HAL_UART_AbortTransmitCpltCallback;/* Legacy weak AbortTransmitCpltCallback */
  huart->p_abort_receive_cplt_callback  = HAL_UART_AbortReceiveCpltCallback; /* Legacy weak AbortReceiveCpltCallback  */
  huart->p_wakeup_callback              = HAL_UART_WakeupCallback;           /* Legacy weak WakeUpCallback            */
  huart->p_rx_fifo_full_callback        = HAL_UART_RxFifoFullCallback;       /* Legacy weak RxFifoFullCallback        */
  huart->p_tx_fifo_empty_callback       = HAL_UART_TxFifoEmptyCallback;      /* Legacy weak TxFifoEmptyCallback       */
  huart->p_clear_to_send_callback       = HAL_UART_ClearToSendCallback;      /* Legacy weak ClearToSendCallback       */
  huart->p_lin_break_callback           = HAL_UART_LINBreakCallback;         /* Legacy weak LINBreakCallback          */
}
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */

/**
  * @brief Abort current UART exchange.
  * @param  huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval HAL_OK UART Abort completed.
  */
hal_status_t UART_Abort(hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx = UART_GET_INSTANCE(huart);

  LL_USART_DisableIT_CR1(p_uartx, (LL_USART_CR1_RXNEIE_RXFNEIE | LL_USART_CR1_PEIE | LL_USART_CR1_TXEIE_TXFNFIE
                                   | LL_USART_CR1_TCIE | LL_USART_CR1_RXFFIE | LL_USART_CR1_TXFEIE | LL_USART_CR1_IDLEIE
                                   | LL_USART_CR1_RTOIE | LL_USART_CR1_CMIE));
  LL_USART_DisableIT_CR2(p_uartx, LL_USART_CR2_LBDIE);
  LL_USART_DisableIT_CR3(p_uartx, (LL_USART_CR3_EIE | LL_USART_CR3_RXFTIE | LL_USART_CR3_TXFTIE | LL_USART_CR3_CTSIE));
  LL_USART_ClearFlag(p_uartx, (LL_USART_ICR_TXFECF | LL_USART_ICR_LBDCF | LL_USART_ICR_CTSCF));

  return HAL_OK;
}
/**
  * @brief If not enabled, enable the UART instance and check acknowledge bits.
  * @param  huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @retval HAL_OK UART Ready for processing.
  * @retval HAL_TIMEOUT UART took too long to acknowledge.
  */
hal_status_t UART_CheckEnabledState(hal_uart_handle_t *huart)
{
  uint32_t count;
  USART_TypeDef *p_uartx = UART_GET_INSTANCE(huart);

  /* Check if Instance is enabled */
  /* - If Instance is already enabled : nothing to do */
  /* - If not, enable instance and check TEACK and REACK bits if needed */
  if (LL_USART_IsEnabled(p_uartx) == 0U)
  {
    LL_USART_Enable(p_uartx);

    if (LL_USART_IsEnabledDirectionTx(p_uartx) != 0U)
    {
      /** 8 is the number of required instructions cycles for the below loop statement.
        * The UART_ENABLE_TIMEOUT_MS is expressed in ms.
        */
      count = UART_ENABLE_TIMEOUT_MS * (SystemCoreClock / 8U / 1000U);
      do
      {
        count--;
        if (count == 0U)
        {
          /* Timeout occurred */
          return HAL_TIMEOUT;
        }
      } while (LL_USART_IsActiveFlag_TEACK(p_uartx) == 0U);
    }

    if (LL_USART_IsEnabledDirectionRx(p_uartx) != 0U)
    {
      /** 8 is the number of required instructions cycles for the below loop statement.
        * The UART_ENABLE_TIMEOUT_MS is expressed in ms.
        */
      count = UART_ENABLE_TIMEOUT_MS * (SystemCoreClock / 8U / 1000U);
      do
      {
        count--;
        if (count == 0U)
        {
          /* Timeout occurred */
          return HAL_TIMEOUT;
        }
      } while (LL_USART_IsActiveFlag_REACK(p_uartx) == 0U);
    }
  }

  return HAL_OK;
}

/**
  * @brief This function handles UART communication timeout. It waits
  *        until a flag is no longer in the specified status.
  * @param huart      Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param flag       Specifies the UART flag to check
  * @param status     The actual flag status (1U or 0U)
  * @param tick_start Tick start value
  * @param timeout_ms Timeout duration
  * @retval HAL_OK UART Flag unset.
  * @retval HAL_TIMEOUT UART took to long to acknowledge.
  */
hal_status_t UART_WaitOnFlagUntilTimeout(hal_uart_handle_t *huart, uint32_t flag, uint32_t status,
                                         uint32_t tick_start, uint32_t timeout_ms)
{
  USART_TypeDef *p_uartx = UART_GET_INSTANCE(huart);

  /* Wait until flag is set */
  while (((LL_USART_READ_REG(p_uartx, ISR) & flag) == status))
  {
    if (huart->reception_type != HAL_UART_RX_TO_RTO)
    {
      if (LL_USART_IsEnabledDirectionRx(p_uartx) != 0U)
      {
        if (LL_USART_IsActiveFlag_RTO(p_uartx) != 0U)
        {
          /* Disable TXE, RXNE, PE and ERR (Frame error, noise error, overrun error)
             interrupts for the interrupt process */
          LL_USART_DisableIT_CR1(p_uartx, LL_USART_CR1_RXNEIE_RXFNEIE | LL_USART_CR1_PEIE |
                                 LL_USART_CR1_TXEIE_TXFNFIE);
          LL_USART_DisableIT_CR3(p_uartx, LL_USART_CR3_EIE);

          LL_USART_ClearFlag_RTO(p_uartx);

