MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
          return HAL_TIMEOUT;
        }
      }
    }
    /* Check for the timeout */
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tick_start) > timeout_ms) || (timeout_ms == 0U))
      {
        if (((LL_USART_READ_REG(p_uartx, ISR) & flag) == status))
        {
          /* Disable TXE, RXNE, PE and ERR (Frame error, noise error, overrun error)
           interrupts for the interrupt process */
          LL_USART_DisableIT_CR1(p_uartx, LL_USART_CR1_RXNEIE_RXFNEIE | LL_USART_CR1_PEIE |
                                 LL_USART_CR1_TXEIE_TXFNFIE);
          LL_USART_DisableIT_CR3(p_uartx, LL_USART_CR3_EIE);

          return HAL_TIMEOUT;
        }
      }
    }
  }
  return HAL_OK;
}

/**
  * @brief  Start receive operation in interrupt mode.
  * @param  huart      Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param  p_data     Pointer to data buffer (u8 or u16 data elements).
  * @param  size       Amount of data elements (u8 or u16) to be received.
  * @param  rx_mode    Reception mode
  * @param  interrupts List of optional interruptions to activate.
  * @note   This function could be called by all HAL UART API providing reception in Interrupt mode.
  * @note   When calling this function, parameters validity is considered as already checked,
  *         i.e. Rx State, buffer address, ...
  *         UART Handle is assumed as Locked.
  * @retval HAL_OK Receive started in IT mode.
  */
hal_status_t UART_Start_Receive_IT(hal_uart_handle_t *huart, uint8_t *p_data, uint32_t size,
                                   hal_uart_rx_modes_t rx_mode, uint32_t interrupts)
{
  uint32_t reg_temp;
  uint32_t nine_bits_data;
  USART_TypeDef *p_uartx = UART_GET_INSTANCE(huart);

  nine_bits_data = 0U;
  huart->p_rx_buff = p_data;
  huart->rx_xfer_size = size;
  huart->rx_xfer_count = size;
  huart->p_rx_isr = NULL;

  if (UART_CheckEnabledState(huart) != HAL_OK)
  {
    huart->rx_state = HAL_UART_RX_STATE_IDLE;
    return HAL_ERROR;
  }

  /* If HalfDuplex mode selected, enable RE */
  if (LL_USART_IsEnabledHalfDuplex(p_uartx) != 0U)
  {
    LL_USART_EnableDirectionRx(p_uartx);
  }

  if (!IS_LPUART_INSTANCE(p_uartx))
  {
    if (LL_USART_IsEnabledRxTimeout(p_uartx) != 0U)
    {
      LL_USART_EnableIT_RTO(p_uartx);
    }
  }

  reg_temp = LL_USART_READ_REG(p_uartx, CR1);

  if (((reg_temp & USART_CR1_M) == LL_USART_DATAWIDTH_9_BIT) && ((reg_temp & USART_CR1_PCE) == LL_USART_PARITY_NONE))
  {
    nine_bits_data = 1U;
  }

  /* Computation of UART mask to apply to RDR register */
  if (UART_RDRMaskComputation(huart) != HAL_OK)
  {
    huart->rx_state = HAL_UART_RX_STATE_IDLE;
    return HAL_ERROR;
  }

  LL_USART_EnableIT_ERROR(p_uartx);
  if ((huart->fifo_mode == HAL_UART_FIFO_MODE_ENABLED) && (size >= huart->nb_rx_data_to_process))
  {
    if (nine_bits_data != 0U)
    {
      huart->p_rx_isr = UART_RxISR_16BIT_FIFOEN;
    }
    else
    {
      huart->p_rx_isr = UART_RxISR_8BIT_FIFOEN;
    }
    if ((reg_temp & USART_CR1_PCE) != LL_USART_PARITY_NONE)
    {
      LL_USART_EnableIT_PE(p_uartx);
    }
    LL_USART_EnableIT_RXFT(p_uartx);
  }
  else
  {
    if (nine_bits_data != 0U)
    {
      huart->p_rx_isr = UART_RxISR_16BIT;
    }
    else
    {
      huart->p_rx_isr = UART_RxISR_8BIT;
    }
    if ((reg_temp & USART_CR1_PCE) != LL_USART_PARITY_NONE)
    {
      LL_USART_EnableIT_PE(p_uartx);
    }
    LL_USART_EnableIT_RXNE_RXFNE(p_uartx);
  }

  if (huart->rx_state != HAL_UART_RX_STATE_ACTIVE)
  {
    huart->p_rx_isr = NULL;
    return HAL_ERROR;
  }

  LL_USART_ClearFlag(p_uartx, LL_USART_ICR_IDLECF | LL_USART_ICR_RTOCF | LL_USART_ICR_CMCF);

  if (rx_mode == HAL_UART_RX_TO_IDLE)
  {
    LL_USART_EnableIT_IDLE(p_uartx);
  }
  else if (rx_mode == HAL_UART_RX_TO_RTO)
  {
    LL_USART_EnableIT_RTO(p_uartx);
  }
  else if (rx_mode == HAL_UART_RX_TO_CHAR_MATCH)
  {
    LL_USART_EnableIT_CM(p_uartx);
  }
  else
  {
    /* do nothing */
  }

  if ((interrupts & HAL_UART_OPT_RX_IT_FIFO_FULL) == HAL_UART_OPT_RX_IT_FIFO_FULL)
  {
    LL_USART_EnableIT_RXFF(p_uartx);
  }
  if ((interrupts & HAL_UART_OPT_RX_IT_LIN_BREAK) == HAL_UART_OPT_RX_IT_LIN_BREAK)
  {
    LL_USART_EnableIT_LBD(p_uartx);
  }
  return HAL_OK;
}

/**
  * @brief  Start transmit operation in interrupt mode.
  * @param  huart      Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param  p_data     Pointer to data buffer (u8 or u16 data elements).
  * @param  size       Amount of data elements (u8 or u16) to be received.
  * @param  interrupts List of optional interruptions to activate.
  * @note   This function could be called by all HAL UART API providing transmission in Interrupt mode.
  * @note   When calling this function, parameters validity is considered as already checked,
  *         i.e. Rx State, buffer address, ...
  *         UART Handle is assumed as Locked.
  * @retval HAL_OK Transmit started in IT mode.
  */
hal_status_t UART_Start_Transmit_IT(hal_uart_handle_t *huart, const uint8_t *p_data, uint32_t size,
                                    uint32_t interrupts)
{
  uint32_t reg_temp;
  uint32_t nine_bits_data;
  USART_TypeDef *p_uartx = UART_GET_INSTANCE(huart);

  nine_bits_data = 0U;

  if (UART_CheckEnabledState(huart) != HAL_OK)
  {
    huart->tx_state = HAL_UART_TX_STATE_IDLE;
    return HAL_ERROR;
  }

  /* If HalfDuplex mode selected, disable RE to avoid overrun */
  if (LL_USART_IsEnabledHalfDuplex(p_uartx) != 0U)
  {
    LL_USART_SetTransferDirection(p_uartx, LL_USART_DIRECTION_TX);
  }

  reg_temp = LL_USART_READ_REG(p_uartx, CR1);

  if (((reg_temp & USART_CR1_M) == LL_USART_DATAWIDTH_9_BIT) && ((reg_temp & USART_CR1_PCE) == LL_USART_PARITY_NONE))
  {
    nine_bits_data = 1U;
  }

  huart->tx_xfer_size  = size;
  huart->tx_xfer_count = size;
  huart->p_tx_buff = p_data;
  huart->p_tx_isr = NULL;

  if (huart->fifo_mode == HAL_UART_FIFO_MODE_ENABLED)
  {
    if (nine_bits_data != 0U)
    {
      huart->p_tx_isr = UART_TxISR_16BIT_FIFOEN;
    }
    else
    {
      huart->p_tx_isr = UART_TxISR_8BIT_FIFOEN;
    }
    LL_USART_EnableIT_TXFT(p_uartx);
  }
  else
  {
    if (nine_bits_data != 0U)
    {
      huart->p_tx_isr = UART_TxISR_16BIT;
    }
    else
    {
      huart->p_tx_isr = UART_TxISR_8BIT;
    }
    LL_USART_EnableIT_TXE_TXFNF(p_uartx);
  }

