MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
  if ((interrupts & HAL_UART_OPT_TX_IT_FIFO_EMPTY) == HAL_UART_OPT_TX_IT_FIFO_EMPTY)
  {
    LL_USART_EnableIT_TXFE(p_uartx);
  }
  if ((interrupts & HAL_UART_OPT_TX_IT_CLEAR_TO_SEND) == HAL_UART_OPT_TX_IT_CLEAR_TO_SEND)
  {
    LL_USART_EnableIT_CTS(p_uartx);
  }
  return HAL_OK;
}

/**
  * @brief  Start receive operation in polling mode.
  * @param  huart          Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param  p_data         Pointer to data buffer (u8 or u16 data elements).
  * @param  size_byte      Amount of data elements (u8 or u16) to be received.
  * @param  p_rx_size_byte Pointer on actual number of received data
  * @param  timeout_ms     Timeout value before exiting
  * @param  rx_mode        Reception mode
  * @note   This function could be called by all HAL UART API providing reception in Interrupt mode.
  * @note   When calling this function, parameters validity is considered as already checked,
  *         i.e. Rx State, buffer address, ...
  *         UART Handle is assumed as Locked.
  * @retval HAL_OK Receive finished in polling mode.
  * @retval HAL_TIMEOUT Timeout expired
  * @retval HAL_ERROR Error during instance enabling.
  */
hal_status_t UART_Start_Receive_Polling(hal_uart_handle_t *huart, void *p_data, uint32_t size_byte,
                                        uint32_t *p_rx_size_byte, uint32_t timeout_ms,
                                        hal_uart_rx_modes_t rx_mode)
{
  uint32_t reg_temp;
  uint32_t flags_until_timeout;
  uint32_t tick_start;
  uint16_t uh_mask;
  uint16_t *p_data_16_bits;
  uint8_t  *p_data_8_bits;
  USART_TypeDef *p_uartx = UART_GET_INSTANCE(huart);

  flags_until_timeout = 0;

  if (UART_CheckEnabledState(huart) != HAL_OK)
  {
    huart->rx_state = HAL_UART_RX_STATE_IDLE;
    return HAL_ERROR;
  }

  /* If HalfDuplex mode selected, enable RE */
  if (LL_USART_IsEnabledHalfDuplex(p_uartx) != 0U)
  {
    LL_USART_EnableDirectionRx(p_uartx);
  }

  reg_temp = LL_USART_READ_REG(p_uartx, CR1);

  if (((reg_temp & USART_CR1_M) == LL_USART_DATAWIDTH_9_BIT) && ((reg_temp & USART_CR1_PCE) == LL_USART_PARITY_NONE))
  {
    p_data_16_bits = (uint16_t *)p_data;
    p_data_8_bits = NULL;
  }
  else
  {
    p_data_8_bits = (uint8_t *)p_data;
    p_data_16_bits = NULL;
  }

  huart->reception_type = rx_mode;

  huart->rx_xfer_size  = size_byte;
  huart->rx_xfer_count = size_byte;

  /* Computation of UART mask to apply to RDR register */
  if (UART_RDRMaskComputation(huart) != HAL_OK)
  {
    huart->rx_state = HAL_UART_RX_STATE_IDLE;
    return HAL_ERROR;
  }
  uh_mask = huart->rdr_mask;

  if (huart->reception_type == HAL_UART_RX_STANDARD)
  {
    flags_until_timeout = LL_USART_ISR_RXNE_RXFNE;
  }
  else if (huart->reception_type == HAL_UART_RX_TO_IDLE)
  {
    flags_until_timeout = LL_USART_ISR_RXNE_RXFNE | LL_USART_ISR_IDLE;
  }
  else if (huart->reception_type == HAL_UART_RX_TO_RTO)
  {
    flags_until_timeout = LL_USART_ISR_RXNE_RXFNE | LL_USART_ISR_RTOF;
  }
  else if (huart->reception_type == HAL_UART_RX_TO_CHAR_MATCH)
  {
    flags_until_timeout = LL_USART_ISR_RXNE_RXFNE | LL_USART_ISR_CMF;
    LL_USART_ClearFlag_CM(p_uartx);
  }
  else
  {
    /* do nothing */
  }

  if (p_rx_size_byte != NULL)
  {
    *p_rx_size_byte = 0U;
  }

  /* Init tick_start for timeout management */
  tick_start = HAL_GetTick();

  /* as long as data have to be received */
  while (huart->rx_xfer_count > 0U)
  {
    if (UART_WaitOnFlagUntilTimeout(huart, flags_until_timeout, 0U, tick_start, timeout_ms) != HAL_OK)
    {
      return HAL_TIMEOUT;
    }
    if ((LL_USART_IsActiveFlag_IDLE(p_uartx) != 0U) && (rx_mode == HAL_UART_RX_TO_IDLE))
    {
      LL_USART_ClearFlag_IDLE(p_uartx);
      if (huart->rx_xfer_count != size_byte)
      {
        return HAL_OK;
      }
    }
    if ((LL_USART_IsActiveFlag_RTO(p_uartx) != 0U) && (rx_mode == HAL_UART_RX_TO_RTO))
    {
      LL_USART_ClearFlag_RTO(p_uartx);
      if (huart->rx_xfer_count != size_byte)
      {
        return HAL_OK;
      }
    }
    if (LL_USART_IsActiveFlag_RXNE_RXFNE(p_uartx) != 0U)
    {
      if (p_data_8_bits == NULL)
      {
        *p_data_16_bits = LL_USART_ReceiveData9(p_uartx) & uh_mask;
        p_data_16_bits++;
      }
      else
      {
        *p_data_8_bits = (uint8_t)((uint16_t)LL_USART_ReceiveData8(p_uartx) & uh_mask);
        p_data_8_bits++;
      }
      if (p_rx_size_byte != NULL)
      {
        *p_rx_size_byte += 1U;
      }
      huart->rx_xfer_count--;
    }
    if ((LL_USART_IsActiveFlag_CM(p_uartx) != 0U) && (rx_mode == HAL_UART_RX_TO_CHAR_MATCH))
    {
      LL_USART_ClearFlag_CM(p_uartx);
      if (huart->rx_xfer_count != size_byte)
      {
        return HAL_OK;
      }
    }
  }
  huart->reception_type = HAL_UART_RX_STANDARD;
  return HAL_OK;
}

#if defined (USE_HAL_UART_DMA) && (USE_HAL_UART_DMA == 1)
/**
  * @brief  Start receive operation in DMA mode.
  * @param  huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param  p_data Pointer to data buffer (u8 or u16 data elements).
  * @param  size  Amount of data elements (u8 or u16) to be received.
  * @param  interrupts List of optional interruptions to activate.
  * @param  rx_mode Mode of the current reception (ToIdle, ToCM, UntilTimeout)
  * @note   This function could be called by all HAL UART API providing reception in DMA mode.
  * @note   When calling this function, parameters validity is considered as already checked,
  *         i.e. Rx State, buffer address, ...
  *         UART Handle is assumed as Locked.
  * @retval HAL_OK Receive started in DMA mode.
  * @retval HAL_ERROR DMA did not start.
  */
hal_status_t UART_Start_Receive_DMA(hal_uart_handle_t *huart, uint8_t *p_data, uint32_t size,
                                    hal_uart_rx_modes_t rx_mode, uint32_t interrupts)
{
  USART_TypeDef *p_uartx;
  uint32_t interrupts_dma;

  p_uartx = UART_GET_INSTANCE(huart);
  huart->p_rx_buff = p_data;
  huart->rx_xfer_size = size;

  if (UART_CheckEnabledState(huart) != HAL_OK)
  {
    huart->rx_state = HAL_UART_RX_STATE_IDLE;
    return HAL_ERROR;
  }

  /* If HalfDuplex mode selected, enable RE */
  if (LL_USART_IsEnabledHalfDuplex(p_uartx) != 0U)
  {
    LL_USART_EnableDirectionRx(p_uartx);
  }

