MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
  if (!IS_LPUART_INSTANCE(p_uartx))
  {
    if (LL_USART_IsEnabledRxTimeout(p_uartx) != 0U)
    {
      LL_USART_EnableIT_RTO(p_uartx);
    }
  }
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  if (interrupts == HAL_UART_OPT_DMA_RX_IT_SILENT)
  {
    interrupts_dma = HAL_UART_OPT_DMA_RX_IT_SILENT;
  }
  else
#endif /* USE_HAL_DMA_LINKEDLIST */
  {
    interrupts_dma = (interrupts & HAL_UART_OPT_DMA_RX_IT_HT);
  }

  if (huart->hdma_rx != NULL)
  {
    huart->hdma_rx->p_xfer_cplt_cb = UART_DMAReceiveCplt;

    huart->hdma_rx->p_xfer_halfcplt_cb = UART_DMARxHalfCplt;

    huart->hdma_rx->p_xfer_error_cb = UART_DMAError;

    if (HAL_DMA_StartPeriphXfer_IT_Opt(huart->hdma_rx, (uint32_t)&p_uartx->RDR,
                                       (uint32_t)huart->p_rx_buff, size, interrupts_dma) != HAL_OK)
    {
      huart->rx_state = HAL_UART_RX_STATE_IDLE;
#if defined (USE_HAL_UART_GET_LAST_ERRORS) && (USE_HAL_UART_GET_LAST_ERRORS == 1)
      huart->last_reception_error_codes |= HAL_UART_RECEIVE_ERROR_DMA;
#endif /* USE_HAL_UART_GET_LAST_ERRORS */
      return HAL_ERROR;
    }
  }

  LL_USART_EnableDMAReq_RX(p_uartx);
  LL_USART_EnableIT_ERROR(p_uartx);
  LL_USART_EnableIT_PE(p_uartx);

  if (rx_mode == HAL_UART_RX_TO_IDLE)
  {
    LL_USART_ClearFlag_IDLE(p_uartx);
    LL_USART_EnableIT_IDLE(p_uartx);
  }
  else if (rx_mode == HAL_UART_RX_TO_RTO)
  {
    LL_USART_ClearFlag_RTO(p_uartx);
    LL_USART_EnableIT_RTO(p_uartx);
  }
  else if (rx_mode == HAL_UART_RX_TO_CHAR_MATCH)
  {
    LL_USART_ClearFlag_CM(p_uartx);
    LL_USART_EnableIT_CM(p_uartx);
  }
  else
  {
    /* do nothing */
  }

  if (((interrupts & HAL_UART_OPT_RX_IT_LIN_BREAK) == HAL_UART_OPT_RX_IT_LIN_BREAK)
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
      && (interrupts_dma != HAL_UART_OPT_DMA_RX_IT_SILENT)
#endif /* USE_HAL_DMA_LINKEDLIST */
     )
  {
    LL_USART_EnableIT_LBD(p_uartx);
  }
  return HAL_OK;
}

/**
  * @brief  Start transmit operation in DMA mode.
  * @param  huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  * @param  p_data Pointer to data buffer (u8 or u16 data elements).
  * @param  size  Amount of data elements (u8 or u16) to be received.
  * @param  interrupts List of optional interruptions to activate.
  * @note   This function could be called by all HAL UART API providing transmission in DMA mode.
  * @note   When calling this function, parameters validity is considered as already checked,
  *         i.e. Rx State, buffer address, ...
  *         UART Handle is assumed as Locked.
  * @retval HAL_OK Receive started in DMA mode.
  * @retval HAL_ERROR DMA did not start.
  */
hal_status_t UART_Start_Transmit_DMA(hal_uart_handle_t *huart, const uint8_t *p_data, uint32_t size,
                                     uint32_t interrupts)
{
  USART_TypeDef *p_uartx;
  uint32_t interrupts_dma;

  p_uartx = UART_GET_INSTANCE(huart);
  huart->p_tx_buff     = p_data;
  huart->tx_xfer_size  = size;
  huart->tx_xfer_count = size;

  if (UART_CheckEnabledState(huart) != HAL_OK)
  {
    huart->tx_state = HAL_UART_TX_STATE_IDLE;
    return HAL_ERROR;
  }

  /* If HalfDuplex mode selected, disable RE to avoid overrun */
  if (LL_USART_IsEnabledHalfDuplex(p_uartx) != 0U)
  {
    LL_USART_SetTransferDirection(p_uartx, LL_USART_DIRECTION_TX);
  }

#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  if (interrupts == HAL_UART_OPT_DMA_TX_IT_SILENT)
  {
    interrupts_dma = HAL_UART_OPT_DMA_TX_IT_SILENT;
  }
  else
#endif /* USE_HAL_DMA_LINKEDLIST */
  {
    interrupts_dma = (interrupts & HAL_UART_OPT_DMA_TX_IT_HT);
  }

  if (huart->hdma_tx != NULL)
  {
    huart->hdma_tx->p_xfer_cplt_cb = UART_DMATransmitCplt;

    huart->hdma_tx->p_xfer_halfcplt_cb = UART_DMATxHalfCplt;

    huart->hdma_tx->p_xfer_error_cb = UART_DMAError;

    if (HAL_DMA_StartPeriphXfer_IT_Opt(huart->hdma_tx, (uint32_t)huart->p_tx_buff, (uint32_t)&p_uartx->TDR,
                                       size, interrupts_dma) != HAL_OK)
    {
      huart->tx_state = HAL_UART_TX_STATE_IDLE;
#if defined (USE_HAL_UART_GET_LAST_ERRORS) && (USE_HAL_UART_GET_LAST_ERRORS == 1)
      huart->last_transmission_error_codes |= HAL_UART_TRANSMIT_ERROR_DMA;
#endif /* USE_HAL_UART_GET_LAST_ERRORS */
      return HAL_ERROR;
    }
  }

  LL_USART_ClearFlag_TC(p_uartx);
  LL_USART_EnableDMAReq_TX(p_uartx);

  if (((interrupts & HAL_UART_OPT_TX_IT_CLEAR_TO_SEND) == HAL_UART_OPT_TX_IT_CLEAR_TO_SEND)
#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
      && (interrupts_dma != HAL_UART_OPT_DMA_TX_IT_SILENT)
#endif /* USE_HAL_DMA_LINKEDLIST */
     )
  {
    LL_USART_EnableIT_CTS(p_uartx);
  }

  return HAL_OK;
}

/**
  * @brief End ongoing Tx transfer on UART peripheral (following error detection or Transmit completion).
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  */
void UART_EndTxTransfer(hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  p_uartx = UART_GET_INSTANCE(huart);
  LL_USART_DisableIT_CR1(p_uartx, (LL_USART_CR1_TXEIE_TXFNFIE | LL_USART_CR1_TCIE));
  LL_USART_DisableIT_CR3(p_uartx, (LL_USART_CR3_TXFTIE));
  if (LL_USART_IsEnabledIT_CTS(p_uartx) != 0U)
  {
    LL_USART_DisableIT_CTS(p_uartx);
    LL_USART_ClearFlag_nCTS(p_uartx);
  }
  huart->tx_state = HAL_UART_TX_STATE_IDLE;
}
#endif /* USE_HAL_UART_DMA */

/**
  * @brief  End ongoing Rx transfer on UART peripheral (following error detection or Reception completion).
  * @param  huart Pointer to a \ref hal_uart_handle_t structure which contains the UART instance.
  */
static void UART_EndRxTransfer(hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx = UART_GET_INSTANCE(huart);

  LL_USART_DisableIT_CR1(p_uartx, (LL_USART_CR1_RXNEIE_RXFNEIE | LL_USART_CR1_PEIE));
  LL_USART_DisableIT_CR3(p_uartx, (LL_USART_CR3_EIE | LL_USART_CR3_RXFTIE));

  /* In case of reception waiting for IDLE event, disable also the IDLE IE interrupt source */
  if (huart->reception_type == HAL_UART_RX_TO_IDLE)
  {
    LL_USART_DisableIT_IDLE(p_uartx);
    LL_USART_ClearFlag_IDLE(p_uartx);
  }
  if (huart->reception_type == HAL_UART_RX_TO_CHAR_MATCH)
  {
    LL_USART_DisableIT_CM(p_uartx);
    LL_USART_ClearFlag_CM(p_uartx);
  }
  if (huart->reception_type == HAL_UART_RX_TO_RTO)
  {
    LL_USART_DisableRxTimeout(p_uartx);
    LL_USART_DisableIT_RTO(p_uartx);
    LL_USART_ClearFlag_RTO(p_uartx);
  }
  if (LL_USART_IsEnabledIT_RXFF(p_uartx) != 0U)
  {
    LL_USART_DisableIT_RXFF(p_uartx);
  }
  if (LL_USART_IsEnabledIT_LBD(p_uartx) != 0U)
  {
    LL_USART_DisableIT_LBD(p_uartx);
    LL_USART_ClearFlag_LBD(p_uartx);
  }

  huart->reception_type = HAL_UART_RX_STANDARD;
  huart->p_rx_isr = NULL;
  huart->rx_state = HAL_UART_RX_STATE_IDLE;
}

#if defined (USE_HAL_UART_DMA) && (USE_HAL_UART_DMA == 1)
/**
  * @brief DMA UART transmit process complete callback.
  * @param hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  */
static void UART_DMATransmitCplt(hal_dma_handle_t *hdma)
{
  hal_uart_handle_t *huart = (hal_uart_handle_t *)(hdma->p_parent);
  USART_TypeDef *p_uartx = UART_GET_INSTANCE(huart);

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  if (hdma->xfer_mode == HAL_DMA_XFER_MODE_DIRECT)
#endif /* USE_HAL_DMA_LINKEDLIST */
  {
    huart->tx_xfer_count = 0U;
    /* Disable the DMA transfer for transmit request by resetting the DMAT bit
        in the UART CR3 register */
    LL_USART_DisableDMAReq_TX(p_uartx);
    LL_USART_EnableIT_TC(p_uartx);
  }
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  /* DMA Circular mode */
  else
  {
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    huart->p_tx_cplt_callback(huart);
#else
    HAL_UART_TxCpltCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
  }
#endif /* USE_HAL_DMA_LINKEDLIST */
}

/**
  * @brief DMA UART transmit process half complete callback.
  * @param hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  */
static void UART_DMATxHalfCplt(hal_dma_handle_t *hdma)
{
  hal_uart_handle_t *huart = (hal_uart_handle_t *)(hdma->p_parent);

