MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
  huart->p_tx_half_cplt_callback(huart);
#else
  HAL_UART_TxHalfCpltCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
}

/**
  * @brief DMA UART receive process complete callback.
  * @param hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  */
static void UART_DMAReceiveCplt(hal_dma_handle_t *hdma)
{
  hal_uart_handle_t *huart = (hal_uart_handle_t *)(hdma->p_parent);
  USART_TypeDef *p_uartx = UART_GET_INSTANCE(huart);

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  if (hdma->xfer_mode == HAL_DMA_XFER_MODE_DIRECT)
#endif /* USE_HAL_DMA_LINKEDLIST */
  {
    huart->rx_xfer_count = 0U;
    LL_USART_DisableIT_CR1(p_uartx, (LL_USART_CR1_PEIE | LL_USART_CR1_IDLEIE | LL_USART_CR1_RTOIE | LL_USART_CR1_CMIE));
    LL_USART_DisableIT_ERROR(p_uartx);
    LL_USART_DisableRxTimeout(p_uartx);
    /* Disable the DMA transfer for the receiver request by resetting the DMAR bit
       in the UART CR3 register */
    LL_USART_DisableDMAReq_RX(p_uartx);

    if (LL_USART_IsEnabledIT_LBD(p_uartx) != 0U)
    {
      if (LL_USART_IsActiveFlag_LBD(p_uartx) != 0U)
      {
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
        huart->p_lin_break_callback(huart);
#else
        HAL_UART_LINBreakCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
      }
      LL_USART_DisableIT_LBD(p_uartx);
    }
    LL_USART_ClearFlag(p_uartx, LL_USART_ICR_LBDCF | LL_USART_ICR_IDLECF | LL_USART_ICR_RTOCF | LL_USART_ICR_CMCF);
    LL_USART_ClearFlag(p_uartx, LL_USART_ICR_IDLECF | LL_USART_ICR_RTOCF | LL_USART_ICR_CMCF);

    huart->rx_state = HAL_UART_RX_STATE_IDLE;
  }
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
  huart->p_rx_cplt_callback(huart, huart->rx_xfer_size, HAL_UART_RX_EVENT_TC);
#else
  HAL_UART_RxCpltCallback(huart, huart->rx_xfer_size, HAL_UART_RX_EVENT_TC);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
}

/**
  * @brief DMA UART receive process half complete callback.
  * @param hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  */
static void UART_DMARxHalfCplt(hal_dma_handle_t *hdma)
{
  hal_uart_handle_t *huart = (hal_uart_handle_t *)(hdma->p_parent);

#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
  huart->p_rx_half_cplt_callback(huart);
#else
  HAL_UART_RxHalfCpltCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
}

/**
  * @brief DMA UART communication error callback.
  * @param hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  */
static void UART_DMAError(hal_dma_handle_t *hdma)
{
  hal_uart_handle_t *huart = (hal_uart_handle_t *)(hdma->p_parent);
  USART_TypeDef *p_uartx = UART_GET_INSTANCE(huart);
  const hal_uart_rx_state_t rx_state = huart->rx_state;
  const hal_uart_tx_state_t tx_state = huart->tx_state;

  /* Stop UART DMA Tx request if ongoing */
  if ((LL_USART_IsEnabledDMAReq_TX(p_uartx) != 0U) && (tx_state == HAL_UART_TX_STATE_ACTIVE))
  {
    huart->tx_xfer_count = 0U;
    UART_EndTxTransfer(huart);
#if defined (USE_HAL_UART_GET_LAST_ERRORS) && (USE_HAL_UART_GET_LAST_ERRORS == 1)
    huart->last_transmission_error_codes |= HAL_UART_TRANSMIT_ERROR_DMA;
#endif /* USE_HAL_UART_GET_LAST_ERRORS */
  }

  if ((LL_USART_IsEnabledDMAReq_RX(p_uartx) != 0U) && (rx_state == HAL_UART_RX_STATE_ACTIVE))
  {
    huart->rx_xfer_count = 0U;
    UART_EndRxTransfer(huart);
#if defined (USE_HAL_UART_GET_LAST_ERRORS) && (USE_HAL_UART_GET_LAST_ERRORS == 1)
    huart->last_reception_error_codes |= HAL_UART_RECEIVE_ERROR_DMA;
#endif /* USE_HAL_UART_GET_LAST_ERRORS */
  }

#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
  huart->p_error_callback(huart);
#else
  HAL_UART_ErrorCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
}

/**
  * @brief DMA UART communication abort callback, when initiated by HAL services on Error
  *        (To be called at end of DMA Abort procedure following error occurrence).
  * @param hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  */
static void UART_DMAAbortOnError(hal_dma_handle_t *hdma)
{
  hal_uart_handle_t *huart = (hal_uart_handle_t *)(hdma->p_parent);
  huart->rx_xfer_count = 0U;

#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
  huart->p_error_callback(huart);
#else
  HAL_UART_ErrorCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
}

/**
  * @brief DMA UART Tx communication abort callback, when initiated by user
  *        (To be called at end of DMA Tx Abort procedure following user abort request).
  * @param hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  * @note  When this callback is executed, User Abort complete callback is called only if no
  *        Abort still ongoing for Rx DMA Handle.
  */
static void UART_DMATxAbortCallback(hal_dma_handle_t *hdma)
{
  hal_uart_handle_t *huart = (hal_uart_handle_t *)(hdma->p_parent);
  USART_TypeDef *p_uartx = UART_GET_INSTANCE(huart);

  /* Check if an Abort process is still ongoing */
  if (huart->hdma_rx != NULL)
  {
    if (huart->hdma_rx->global_state == HAL_DMA_STATE_ABORT)
    {
      return;
    }
  }
  /* No Abort process still ongoing : All DMA channels are aborted, call user Abort Complete callback */
  huart->rx_xfer_count = 0U;
  huart->tx_xfer_count = 0U;
  /* Clear the Error flags in the ICR register */
  LL_USART_ClearFlag(p_uartx, LL_USART_ICR_ORECF | LL_USART_ICR_NECF | LL_USART_ICR_PECF | LL_USART_ICR_FECF);

  if (huart->fifo_mode == HAL_UART_FIFO_MODE_ENABLED)
  {
    LL_USART_RequestTxDataFlush(p_uartx);
  }

  huart->reception_type = HAL_UART_RX_STANDARD;

#if defined (USE_HAL_UART_GET_LAST_ERRORS) && (USE_HAL_UART_GET_LAST_ERRORS == 1)
  huart->last_reception_error_codes = 0U;
  huart->last_transmission_error_codes = 0U;
#endif /* USE_HAL_UART_GET_LAST_ERRORS */

