MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
  huart->tx_state = HAL_UART_TX_STATE_IDLE;
  huart->rx_state = HAL_UART_RX_STATE_IDLE;

#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
  huart->p_abort_cplt_callback(huart);
#else
  HAL_UART_AbortCpltCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
}

/**
  * @brief DMA UART Rx communication abort callback, when initiated by user
  *        (To be called at end of DMA Rx Abort procedure following user abort request).
  * @param hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  * @note  When this callback is executed, User Abort complete callback is called only if no
  *        Abort still ongoing for Tx DMA handle.
  */
static void UART_DMARxAbortCallback(hal_dma_handle_t *hdma)
{
  hal_uart_handle_t *huart = (hal_uart_handle_t *)(hdma->p_parent);
  USART_TypeDef *p_uartx = UART_GET_INSTANCE(huart);

  /* Check if an Abort process is still ongoing */
  if (huart->hdma_tx != NULL)
  {
    if (huart->hdma_tx->global_state == HAL_DMA_STATE_ABORT)
    {
      return;
    }
  }
  /* No Abort process still ongoing : All DMA channels are aborted, call user Abort Complete callback */
  huart->rx_xfer_count = 0U;
  huart->tx_xfer_count = 0U;
  /* Clear the Error flags in the ICR register */
  LL_USART_ClearFlag(p_uartx, LL_USART_ICR_ORECF | LL_USART_ICR_NECF | LL_USART_ICR_PECF | LL_USART_ICR_FECF);

  huart->reception_type = HAL_UART_RX_STANDARD;

#if defined (USE_HAL_UART_GET_LAST_ERRORS) && (USE_HAL_UART_GET_LAST_ERRORS == 1)
  huart->last_reception_error_codes = 0U;
  huart->last_transmission_error_codes = 0U;
#endif /* USE_HAL_UART_GET_LAST_ERRORS */

  LL_USART_RequestRxDataFlush(p_uartx);

  huart->tx_state = HAL_UART_TX_STATE_IDLE;
  huart->rx_state = HAL_UART_RX_STATE_IDLE;
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
  huart->p_abort_cplt_callback(huart);
#else
  HAL_UART_AbortCpltCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
}

/**
  * @brief DMA UART Tx communication abort callback, when initiated by user by a call to
  *        HAL_UART_AbortTransmit_IT API (Abort only Tx transfer)
  *        (This callback is executed at end of DMA Tx Abort procedure following user abort request,
  *        and leads to user Tx Abort Complete callback execution).
  * @param hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  */
static void UART_DMATxOnlyAbortCallback(hal_dma_handle_t *hdma)
{
  hal_uart_handle_t *huart = (hal_uart_handle_t *)(hdma->p_parent);
  USART_TypeDef *p_uartx = UART_GET_INSTANCE(huart);

  huart->tx_xfer_count = 0U;


  LL_USART_RequestTxDataFlush(p_uartx);

#if defined (USE_HAL_UART_GET_LAST_ERRORS) && (USE_HAL_UART_GET_LAST_ERRORS == 1)
  huart->last_transmission_error_codes = 0U;
#endif /* USE_HAL_UART_GET_LAST_ERRORS */

  huart->tx_state = HAL_UART_TX_STATE_IDLE;

#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
  huart->p_abort_transmit_cplt_callback(huart);
#else
  HAL_UART_AbortTransmitCpltCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
}

/**
  * @brief DMA UART Rx communication abort callback, when initiated by user by a call to
  *        HAL_UART_AbortReceive_IT API (Abort only Rx transfer)
  *        (This callback is executed at end of DMA Rx Abort procedure following user abort request,
  *        and leads to user Rx Abort Complete callback execution).
  * @param hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  */
static void UART_DMARxOnlyAbortCallback(hal_dma_handle_t *hdma)
{
  hal_uart_handle_t *huart = (hal_uart_handle_t *)(hdma->p_parent);
  USART_TypeDef *p_uartx = UART_GET_INSTANCE(huart);

  /* No Abort process still ongoing : All DMA channels are aborted, call user Abort Complete callback */
  huart->rx_xfer_count = 0U;
  huart->tx_xfer_count = 0U;
  /* Clear the Error flags in the ICR register */
  LL_USART_ClearFlag(p_uartx, LL_USART_ICR_ORECF | LL_USART_ICR_NECF | LL_USART_ICR_PECF | LL_USART_ICR_FECF);

  huart->reception_type = HAL_UART_RX_STANDARD;

#if defined (USE_HAL_UART_GET_LAST_ERRORS) && (USE_HAL_UART_GET_LAST_ERRORS == 1)
  huart->last_reception_error_codes = 0U;
#endif /* USE_HAL_UART_GET_LAST_ERRORS */

  LL_USART_RequestRxDataFlush(p_uartx);
  huart->rx_state = HAL_UART_RX_STATE_IDLE;

#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
  huart->p_abort_receive_cplt_callback(huart);
#else
  HAL_UART_AbortReceiveCpltCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
}

/**
  * @brief DMA UART Rx on communication abort callback, when initiated by
  *        IRQ handler API for reception to CHAR_MATCH, IDLE, RTO modes.
  *        (This callback is executed by the IRQ handler when a CM, RTO or IDLE IT is received and DMA transfer is
  *        not complete).
  * @param hdma Pointer to a hal_dma_handle_t structure which contains a DMA instance.
  */
static void UART_DMAAbortOnSuccessCallback(hal_dma_handle_t *hdma)
{
  hal_uart_handle_t *huart = (hal_uart_handle_t *)(hdma->p_parent);
  USART_TypeDef *p_uartx = UART_GET_INSTANCE(huart);
  hal_uart_rx_event_types_t rx_type = HAL_UART_RX_EVENT_TC;
  uint32_t rx_size = huart->rx_xfer_size;
  uint16_t nb_remaining_rx_data =
    (uint16_t)LL_DMA_GetBlkDataLength((DMA_Channel_TypeDef *)(uint32_t)huart->hdma_rx->instance);

  LL_USART_DisableIT_CR1(p_uartx, (LL_USART_CR1_PEIE | LL_USART_CR1_IDLEIE | LL_USART_CR1_RTOIE | LL_USART_CR1_CMIE));

  if (huart->reception_type == HAL_UART_RX_TO_IDLE)
  {
    rx_type = HAL_UART_RX_EVENT_IDLE;
  }
  else if (huart->reception_type == HAL_UART_RX_TO_RTO)
  {
    rx_type = HAL_UART_RX_EVENT_RTO;
    LL_USART_DisableRxTimeout(p_uartx);
  }
  else if (huart->reception_type == HAL_UART_RX_TO_CHAR_MATCH)
  {
    rx_type = HAL_UART_RX_EVENT_CHAR_MATCH;
  }
  else
  {
    /* Nothing to do */
  }

  if (LL_USART_IsEnabledIT_LBD(p_uartx) != 0U)
  {
    LL_USART_DisableIT_LBD(p_uartx);
  }
  if (LL_USART_IsEnabledIT_CTS(p_uartx) != 0U)
  {
    LL_USART_DisableIT_CTS(p_uartx);
  }
  LL_USART_ClearFlag(p_uartx, LL_USART_ICR_IDLECF | LL_USART_ICR_RTOCF | LL_USART_ICR_CMCF | LL_USART_ICR_LBDCF
                     | LL_USART_ICR_CTSCF);

  huart->reception_type = HAL_UART_RX_STANDARD;
  huart->rx_state = HAL_UART_RX_STATE_IDLE;
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
  huart->p_rx_cplt_callback(huart, (rx_size - nb_remaining_rx_data), rx_type);
#else
  HAL_UART_RxCpltCallback(huart, (rx_size - nb_remaining_rx_data), rx_type);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
}
#endif /* USE_HAL_UART_DMA */

/**
  * @brief Tx interrupt handler for 7-bit or 8-bit data word length and FIFO mode is enabled.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains a UART instance.
  * @note  Function is called under interruption only, once
  *        interruptions have been enabled by HAL_UART_Transmit_IT().
  */
static void UART_TxISR_8BIT_FIFOEN(hal_uart_handle_t *huart)
{
  uint16_t nb_tx_data;
  USART_TypeDef *p_uartx;

  p_uartx = UART_GET_INSTANCE(huart);

  for (nb_tx_data = huart->nb_tx_data_to_process ; nb_tx_data > 0U ; nb_tx_data--)
  {
    if (huart->tx_xfer_count == 0U)
    {
      LL_USART_DisableIT_TXFT(p_uartx);

      LL_USART_EnableIT_TC(p_uartx);

      if (LL_USART_IsEnabledIT_TXFE(p_uartx) != 0U)
      {
        if (LL_USART_IsActiveFlag_TXFE(p_uartx) != 0U)
        {
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
          huart->p_tx_fifo_empty_callback(huart);
#else
          HAL_UART_TxFifoEmptyCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
        }
        LL_USART_DisableIT_TXFE(p_uartx);
        LL_USART_ClearFlag_TXFE(p_uartx);
      }

