MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
      if (LL_USART_IsEnabledIT_CTS(p_uartx) != 0U)
      {
        if (LL_USART_IsActiveFlag_CTS(p_uartx) != 0U)
        {
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
          huart->p_clear_to_send_callback(huart);
#else
          HAL_UART_ClearToSendCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
        }
        LL_USART_DisableIT_CTS(p_uartx);
        LL_USART_ClearFlag_nCTS(p_uartx);
      }
      break;
    }
    else if (LL_USART_IsActiveFlag_TXE_TXFNF(p_uartx) != 0U)
    {
      LL_USART_TransmitData8(p_uartx, *huart->p_tx_buff);
      huart->p_tx_buff++;
      huart->tx_xfer_count--;
    }
    else
    {
      /* Nothing to do */
    }
  }
}

/**
  * @brief TX interrupt handler for 9-bit data word length and FIFO mode is enabled.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains a UART instance.
  * @note  Function is called under interruption only, once
  *        interruptions have been enabled by HAL_UART_Transmit_IT().
  */
static void UART_TxISR_16BIT_FIFOEN(hal_uart_handle_t *huart)
{
  const uint16_t *p_tmp;
  uint16_t nb_tx_data;
  USART_TypeDef *p_uartx;

  p_uartx = UART_GET_INSTANCE(huart);

  for (nb_tx_data = huart->nb_tx_data_to_process ; nb_tx_data > 0U ; nb_tx_data--)
  {
    if (huart->tx_xfer_count == 0U)
    {
      LL_USART_DisableIT_TXFT(p_uartx);

      LL_USART_EnableIT_TC(p_uartx);
      if (LL_USART_IsEnabledIT_TXFE(p_uartx) != 0U)
      {
        if (LL_USART_IsActiveFlag_TXFE(p_uartx) != 0U)
        {
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
          huart->p_tx_fifo_empty_callback(huart);
#else
          HAL_UART_TxFifoEmptyCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
        }
        LL_USART_DisableIT_TXFE(p_uartx);
        LL_USART_ClearFlag_TXFE(p_uartx);
      }

      if (LL_USART_IsEnabledIT_CTS(p_uartx) != 0U)
      {
        if (LL_USART_IsActiveFlag_CTS(p_uartx) != 0U)
        {
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
          huart->p_clear_to_send_callback(huart);
#else
          HAL_UART_ClearToSendCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
        }
        LL_USART_DisableIT_CTS(p_uartx);
        LL_USART_ClearFlag_nCTS(p_uartx);
      }

      break;
    }
    else if (LL_USART_IsActiveFlag_TXE_TXFNF(p_uartx) != 0U)
    {
      p_tmp = (const uint16_t *) huart->p_tx_buff;
      LL_USART_TransmitData9(p_uartx, *p_tmp);
      huart->p_tx_buff += 2U;
      huart->tx_xfer_count--;
    }
    else
    {
      /* Nothing to do */
    }
  }
}

/**
  * @brief TX interrupt handler for 7-bit or 8-bit data word length.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains a UART instance.
  * @note  Function is called under interruption only, once
  *        interruptions have been enabled by HAL_UART_Transmit_IT().
  */
static void UART_TxISR_8BIT(hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;

  p_uartx = UART_GET_INSTANCE(huart);

  if (huart->tx_xfer_count == 0U)
  {
    LL_USART_DisableIT_TXE_TXFNF(p_uartx);

    LL_USART_EnableIT_TC(p_uartx);

    if (LL_USART_IsEnabledIT_CTS(p_uartx) != 0U)
    {
      if (LL_USART_IsActiveFlag_CTS(p_uartx) != 0U)
      {
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
        huart->p_clear_to_send_callback(huart);
#else
        HAL_UART_ClearToSendCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
      }
      LL_USART_DisableIT_CTS(p_uartx);
      LL_USART_ClearFlag_nCTS(p_uartx);
    }
  }
  else
  {
    LL_USART_TransmitData8(p_uartx, *huart->p_tx_buff);
    huart->p_tx_buff++;
    huart->tx_xfer_count--;
  }
}

/**
  * @brief TX interrupt handler for 9-bit data word length.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains a UART instance.
  * @note  Function is called under interruption only, once
  *        interruptions have been enabled by HAL_UART_Transmit_IT().
  */
static void UART_TxISR_16BIT(hal_uart_handle_t *huart)
{
  const uint16_t *p_tmp;
  USART_TypeDef *p_uartx;

  p_uartx = UART_GET_INSTANCE(huart);

  if (huart->tx_xfer_count == 0U)
  {
    LL_USART_DisableIT_TXE_TXFNF(p_uartx);

    LL_USART_EnableIT_TC(p_uartx);

    if (LL_USART_IsEnabledIT_CTS(p_uartx) != 0U)
    {
      if (LL_USART_IsActiveFlag_CTS(p_uartx) != 0U)
      {
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
        huart->p_clear_to_send_callback(huart);
#else
        HAL_UART_ClearToSendCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
      }
      LL_USART_DisableIT_CTS(p_uartx);
      LL_USART_ClearFlag_nCTS(p_uartx);
    }
  }
  else
  {
    p_tmp = (const uint16_t *) huart->p_tx_buff;
    LL_USART_TransmitData9(p_uartx, *p_tmp);
    huart->p_tx_buff += 2U;
    huart->tx_xfer_count--;
  }
}

/**
  * @brief  Complete transmission in non-blocking mode.
  * @param  huart Pointer to a \ref hal_uart_handle_t structure which contains a UART instance.
  */
static void UART_EndTransmit_IT(hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx = UART_GET_INSTANCE(huart);

  LL_USART_DisableIT_TC(p_uartx);

  huart->p_tx_isr = NULL;

  huart->tx_state = HAL_UART_TX_STATE_IDLE;

#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
  huart->p_tx_cplt_callback(huart);
#else
  HAL_UART_TxCpltCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
}

/**
  * @brief RX interrupt handler for 7-bit or 8-bit data word length.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains a UART instance.
  */
static void UART_RxISR_8BIT(hal_uart_handle_t *huart)
{
  uint16_t uh_mask = huart->rdr_mask;
  USART_TypeDef *p_uartx;

  p_uartx = UART_GET_INSTANCE(huart);

  if (huart->rx_state == HAL_UART_RX_STATE_ACTIVE)
  {
    *huart->p_rx_buff = (uint8_t)((uint16_t)LL_USART_ReceiveData8(p_uartx) & uh_mask);
    huart->p_rx_buff++;
    huart->rx_xfer_count--;
    if (huart->rx_xfer_count == 0U)
    {
      /* Disable the UART Rx interrupts */
      LL_USART_DisableIT_CR1(p_uartx, (LL_USART_CR1_RXNEIE_RXFNEIE | LL_USART_CR1_PEIE | LL_USART_CR1_IDLEIE
                                       | LL_USART_CR1_RTOIE | LL_USART_CR1_CMIE));
      LL_USART_DisableIT_ERROR(p_uartx);
      LL_USART_DisableRxTimeout(p_uartx);

      huart->p_rx_isr = NULL;

      LL_USART_ClearFlag(p_uartx, LL_USART_ICR_IDLECF | LL_USART_ICR_RTOCF | LL_USART_ICR_CMCF);

      if (LL_USART_IsEnabledIT_LBD(p_uartx) != 0U)
      {
        if (LL_USART_IsActiveFlag_LBD(p_uartx) != 0U)
        {
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
          huart->p_lin_break_callback(huart);
#else
          HAL_UART_LINBreakCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
        }
        LL_USART_DisableIT_LBD(p_uartx);
        LL_USART_ClearFlag_LBD(p_uartx);
      }

      huart->reception_type = HAL_UART_RX_STANDARD;
      huart->rx_state = HAL_UART_RX_STATE_IDLE;

