MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
      huart->p_rx_cplt_callback(huart, huart->rx_xfer_size, HAL_UART_RX_EVENT_TC);
#else
      HAL_UART_RxCpltCallback(huart, huart->rx_xfer_size, HAL_UART_RX_EVENT_TC);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
    }
  }
  else
  {
    LL_USART_RequestRxDataFlush(p_uartx);
  }
}

/**
  * @brief RX interrupt handler for 9-bit data word length.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains a UART instance.
  * @note  Function is called under interruption only, once
  *        interruptions have been enabled by HAL_UART_Receive_IT().
  */
static void UART_RxISR_16BIT(hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;
  uint16_t uh_mask = huart->rdr_mask;
  uint16_t *p_tmp;
  uint16_t  uh_data;

  p_uartx = UART_GET_INSTANCE(huart);

  if (huart->rx_state == HAL_UART_RX_STATE_ACTIVE)
  {
    uh_data = LL_USART_ReceiveData9(p_uartx);
    p_tmp = (uint16_t *)huart->p_rx_buff;
    *p_tmp = (uint16_t)(uh_data & uh_mask);
    huart->p_rx_buff += 2U;
    huart->rx_xfer_count--;
    if (huart->rx_xfer_count == 0U)
    {
      /* Disable the UART Parity Error Interrupt and RXNE interrupts */
      LL_USART_DisableIT_CR1(p_uartx, (LL_USART_CR1_RXNEIE_RXFNEIE | LL_USART_CR1_PEIE | LL_USART_CR1_IDLEIE
                                       | LL_USART_CR1_RTOIE));
      /* Disable the UART Error Interrupt: (Frame error, noise error, overrun error) */
      LL_USART_DisableIT_ERROR(p_uartx);

      LL_USART_DisableRxTimeout(p_uartx);

      huart->p_rx_isr = NULL;

      LL_USART_ClearFlag(p_uartx, LL_USART_ICR_IDLECF | LL_USART_ICR_RTOCF);

      huart->reception_type = HAL_UART_RX_STANDARD;
      huart->rx_state = HAL_UART_RX_STATE_IDLE;

#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
      huart->p_rx_cplt_callback(huart, huart->rx_xfer_size, HAL_UART_RX_EVENT_TC);
#else
      HAL_UART_RxCpltCallback(huart, huart->rx_xfer_size, HAL_UART_RX_EVENT_TC);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
    }
  }
  else
  {
    LL_USART_RequestRxDataFlush(p_uartx);
  }
}

/**
  * @brief RX interrupt handler for 7-bit or 8-bit data word length and FIFO mode is enabled.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains a UART instance.
  * @note  Function is called under interruption only, once
  *        interruptions have been enabled by HAL_UART_Receive_IT().
  */
static void UART_RxISR_8BIT_FIFOEN(hal_uart_handle_t *huart)
{
  USART_TypeDef *p_uartx;
  uint32_t isr_flags;
  uint32_t cr1_its;
  uint32_t cr3_its;
  uint32_t error_code;
  uint16_t uh_mask = huart->rdr_mask;
  uint16_t nb_rx_data;
  uint16_t rx_data_count;

  p_uartx = UART_GET_INSTANCE(huart);
  isr_flags = LL_USART_READ_REG(p_uartx, ISR);
  cr1_its   = LL_USART_READ_REG(p_uartx, CR1);
  cr3_its   = LL_USART_READ_REG(p_uartx, CR3);
  error_code = 0U;

  if (huart->rx_state == HAL_UART_RX_STATE_ACTIVE)
  {
    nb_rx_data = huart->nb_rx_data_to_process;
    while ((nb_rx_data > 0U) && ((isr_flags & LL_USART_ISR_RXNE_RXFNE) != 0U))
    {

      /* Char Match interrupt occurred --------------------------------------*/
      if (((isr_flags & LL_USART_ISR_CMF) != 0U) && ((cr1_its & LL_USART_CR1_CMIE) != 0U))
      {
        LL_USART_DisableIT_CR1(p_uartx, (LL_USART_CR1_RXNEIE_RXFNEIE));
        LL_USART_DisableIT_CR3(p_uartx, (LL_USART_CR3_RXFTIE));
        *huart->p_rx_buff = (uint8_t)((uint16_t)LL_USART_ReceiveData8(p_uartx) & uh_mask);
        huart->p_rx_buff++;
        huart->rx_xfer_count--;
        return;
      }
      else
      {
        *huart->p_rx_buff = (uint8_t)((uint16_t)LL_USART_ReceiveData8(p_uartx) & uh_mask);
        huart->p_rx_buff++;
        huart->rx_xfer_count--;
      }

      isr_flags = LL_USART_READ_REG(p_uartx, ISR);

      /* If some non-blocking errors occurred */
      if ((isr_flags & (LL_USART_ISR_PE | LL_USART_ISR_FE | LL_USART_ISR_NE)) != 0U)
      {
        /* UART parity error interrupt occurred -------------------------------------*/
        if (((isr_flags & LL_USART_ISR_PE) != 0U) && ((cr1_its & LL_USART_CR1_PEIE) != 0U))
        {
          LL_USART_ClearFlag_PE(p_uartx);
          error_code |= HAL_UART_RECEIVE_ERROR_PE;
        }

        /* UART frame error interrupt occurred --------------------------------------*/
        if (((isr_flags & LL_USART_ISR_FE) != 0U) && ((cr3_its & LL_USART_CR3_EIE) != 0U))
        {
          LL_USART_ClearFlag_FE(p_uartx);
          error_code |= HAL_UART_RECEIVE_ERROR_FE;
        }

        /* UART noise error interrupt occurred --------------------------------------*/
        if (((isr_flags & LL_USART_ISR_NE) != 0U) && ((cr3_its & LL_USART_CR3_EIE) != 0U))
        {
          LL_USART_ClearFlag_NE(p_uartx);
          error_code |= HAL_UART_RECEIVE_ERROR_NE;
        }
        /* Call UART Error callback function if needed ----------------------------*/
        if (error_code != HAL_UART_RECEIVE_ERROR_NONE)
        {
#if defined (USE_HAL_UART_GET_LAST_ERRORS) && (USE_HAL_UART_GET_LAST_ERRORS == 1)
          huart->last_reception_error_codes = error_code;
#endif /* USE_HAL_UART_GET_LAST_ERRORS */
          /* Non-blocking error: transfer can continue.
             Error is notified to the user through the error callback. */
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
          huart->p_error_callback(huart);
#else
          HAL_UART_ErrorCallback(huart);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
        }
      }

      if (huart->rx_xfer_count == 0U)
      {
        LL_USART_DisableIT_CR1(p_uartx, (LL_USART_CR1_PEIE | LL_USART_CR1_IDLEIE
                                         | LL_USART_CR1_RTOIE | LL_USART_CR1_CMIE));

        /* Disable the UART Error Interrupt: (Frame error, noise error, overrun error)
          and RX FIFO Threshold interrupt */
        LL_USART_DisableIT_CR3(p_uartx, (LL_USART_CR3_EIE | LL_USART_CR3_RXFTIE));

