MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_uart.c
#if defined(USE_HAL_UART_REGISTER_CALLBACKS) && (USE_HAL_UART_REGISTER_CALLBACKS == 1)
        huart->p_rx_cplt_callback(huart, huart->rx_xfer_size, HAL_UART_RX_EVENT_TC);
#else
        HAL_UART_RxCpltCallback(huart, huart->rx_xfer_size, HAL_UART_RX_EVENT_TC);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
      }
    }
    /* When remaining number of bytes to receive is less than the RX FIFO
    threshold, next incoming frames are processed as if FIFO mode was
    disabled (i.e. one interrupt per received frame).
    */
    rx_data_count = (uint16_t)huart->rx_xfer_count;
    if ((rx_data_count != 0U) && (rx_data_count < huart->nb_rx_data_to_process))
    {
      LL_USART_DisableIT_RXFT(p_uartx);

      huart->p_rx_isr = UART_RxISR_16BIT;

      LL_USART_EnableIT_RXNE_RXFNE(p_uartx);
    }
  }
  else
  {
    LL_USART_RequestRxDataFlush(p_uartx);
  }
}

/**
  * @brief Calculate FIFO data to process depending on threshold.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains a UART instance.
  */
static void UART_SetNbDataToProcess(hal_uart_handle_t *huart)
{
  uint8_t rx_fifo_depth;
  uint8_t tx_fifo_depth;
  uint8_t rx_fifo_threshold;
  uint8_t tx_fifo_threshold;
  static const uint8_t numerator[] = {1U, 1U, 1U, 3U, 7U, 1U, 0U, 0U};
  static const uint8_t denominator[] = {8U, 4U, 2U, 4U, 8U, 1U, 1U, 1U};
  USART_TypeDef *p_uartx = UART_GET_INSTANCE(huart);

  if (huart->fifo_mode == HAL_UART_FIFO_MODE_DISABLED)
  {
    huart->nb_tx_data_to_process = 1U;
    huart->nb_rx_data_to_process = 1U;
  }
  else
  {
    rx_fifo_depth = UART_RX_FIFO_DEPTH;
    tx_fifo_depth = UART_TX_FIFO_DEPTH;
    rx_fifo_threshold = (uint8_t)LL_USART_GetRXFIFOThreshold(p_uartx);
    tx_fifo_threshold = (uint8_t)LL_USART_GetTXFIFOThreshold(p_uartx);
    huart->nb_tx_data_to_process = ((uint16_t)tx_fifo_depth * numerator[tx_fifo_threshold]) /
                                   (uint16_t)denominator[tx_fifo_threshold];
    huart->nb_rx_data_to_process = ((uint16_t)rx_fifo_depth * numerator[rx_fifo_threshold]) /
                                   (uint16_t)denominator[rx_fifo_threshold];
  }
}

#if defined(USE_ASSERT_DBG_PARAM)
/**
  * @brief Calculate and check baud rate validity.
  * @param instance_clock_freq Clock frequency of the lpuart instance used
  * @param instance_clock_prescaler Clock prescaler of the lpuart instance used
  * @param baud_rate Baud rate to be tested
  * @retval HAL_OK baud rate value is valid
  * @retval HAL_ERROR baud rate value is invalid
  */
hal_status_t UART_Check_lpuart_baudrate_validity(uint32_t instance_clock_freq, uint32_t instance_clock_prescaler,
                                                 uint32_t baud_rate)
{
  uint32_t lpuart_clock_freq_div = (instance_clock_freq / UARTPrescTable[instance_clock_prescaler]);
  if ((lpuart_clock_freq_div > (3U * baud_rate)) && (lpuart_clock_freq_div < (4096U * baud_rate)))
  {
    return HAL_OK;
  }
  else
  {
    return HAL_ERROR;
  }
}

/**
  * @brief Calculate and check baud rate validity.
  * @param instance_clock_freq Clock frequency of the uart instance used
  * @param instance_clock_prescaler Clock prescaler of the uart instance used
  * @param baud_rate Baud rate to be tested
  * @param oversampling Oversampling of the uart instance used
  * @retval HAL_OK baud rate value is valid
  * @retval HAL_ERROR baud rate value is invalid
  */
hal_status_t UART_Check_uart_baudrate_validity(uint32_t instance_clock_freq, uint32_t instance_clock_prescaler,
                                               uint32_t baud_rate, hal_uart_oversampling_t oversampling)
{
  uint32_t div_temp;
  if (oversampling == HAL_UART_OVERSAMPLING_8)
  {
    div_temp = LL_USART_DIV_SAMPLING8(instance_clock_freq, instance_clock_prescaler, baud_rate);
    if ((div_temp >= UART_BRR_MIN) && (div_temp <= UART_BRR_MAX))
    {
      return HAL_OK;
    }
  }
  else
  {
    div_temp = LL_USART_DIV_SAMPLING16(instance_clock_freq, instance_clock_prescaler, baud_rate);
    if ((div_temp >= UART_BRR_MIN) && (div_temp <= UART_BRR_MAX))
    {
      return HAL_OK;
    }
  }
  return HAL_ERROR;
}
#endif /* USE_ASSERT_DBG_PARAM */

/**
  * @brief Set parity on the current character.
  * @param huart Pointer to a \ref hal_uart_handle_t structure which contains a UART instance.
  * @param p_character Character to set the parity on.
  */
void UART_Parity_Computation(hal_uart_handle_t *huart, uint8_t *p_character)
{
  uint8_t mask = 0x1;
  uint8_t c_length;
  uint8_t ones = 0;
  uint8_t i;
  USART_TypeDef *p_uartx = UART_GET_INSTANCE(huart);
  hal_uart_parity_t parity = (hal_uart_parity_t)LL_USART_GetParity(p_uartx);
  hal_uart_word_length_t length = (hal_uart_word_length_t)LL_USART_GetDataWidth(p_uartx);

  ASSERT_DBG_PARAM(length != HAL_UART_WORD_LENGTH_9_BIT);

  if (length == HAL_UART_WORD_LENGTH_7_BIT)
  {
    c_length = 7U;
  }
  else
  {
    c_length = 8U;
  }
  if (parity != HAL_UART_PARITY_NONE)
  {
    i = c_length;
    while (i != 0U)
    {
      if ((*p_character & mask) == mask)
      {
        ones ++;
      }
      mask = mask << 1U;
      i --;
    }
    if (((parity == HAL_UART_PARITY_EVEN) && ((ones % 2U) != 0U))
        || ((parity == HAL_UART_PARITY_ODD) && ((ones % 2U) == 0U)))
    {
      *p_character = (*p_character ^ (1U << (c_length - 1U)));
    }
  }
}
/**
  * @}
  */
#endif /* USE_HAL_UART_MODULE */
/**
  * @}
  */
#endif /* USART1 || USART2 || USART3 || UART4 || UART5 || USART6 || UART7 || LPUART1 */
/**
  * @}
  */
